{"url": "https://www.heinzhistorycenter.org/", "title": "Home - Heinz History Center", "content": "heinz\\_history\\_-\\_web\\_hero\\_video (1080p).mp4 from Heinz History Center on Vimeo\n\nPlaying in picture-in-picture\n\nPause\n\nPicture-in-Picture\n\nPlay VideoPause Video\n\n# Always Free for Kids!\n\n[Plan Your Visit](https://www.heinzhistorycenter.org/families/)\n\n## Get to Know Our Family of Museums\n\n- [![A brightly lit, blue-colored castle model with rounded towers and arched windows displayed indoors; the structure is designed in a playful, whimsical style, and a small puppet or character is visible standing on one of the balconies.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/MicrosoftTeams-image-15-100x100.png)\\\\\n\\\\\n**Heinz History Center** \\\\\n\\\\\n10 AM - 5 PM](https://www.heinzhistorycenter.org/visit/heinz-history-center/)\n- [![A wax figure of a Black baseball player dressed in a vintage catcher’s uniform holds a mitt and baseball in a throwing pose; multiple baseballs and wooden bats are displayed on shelves in the background at a museum exhibit.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/SportsMuseum_WPSM_281216_AnnieONeill10-100x100.jpg)\\\\\n\\\\\n**Western Pennsylvania Sports Museum** \\\\\n\\\\\n10 AM - 5 PM](https://www.heinzhistorycenter.org/visit/sports-museum/)\n- [![Four men in historical military uniforms stand beside a cannon as it fires, releasing white smoke. They are participating in a reenactment on a grassy field with tents and various equipment visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/MicrosoftTeams-image-17-100x100.png)\\\\\n\\\\\n**Fort Pitt Museum** \\\\\n\\\\\n10 AM - 5 PM](https://www.heinzhistorycenter.org/visit/fort-pitt/)\n- [![A modern building with wooden slats and a slanted roof is built into a lush, green forest hillside. People walk up stairs and ramps toward the entrance, surrounded by tall trees and dense foliage.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/Meadowcroft-Rockshelter-exterior-100x100.jpg)\\\\\n\\\\\n**Meadowcroft Rockshelter and Historic Village** \\\\\n\\\\\n10 AM - 4 PM](https://www.heinzhistorycenter.org/visit/meadowcroft/)\n\n## Pittsburgh’s Hidden History\n\nExhibit\n\nHeinz History Center\n\nWander through a whimsical world of wonders inside our dynamic new exhibition, featuring a yinzsplosion of rarely and never-before-seen objects that tell stories from Pittsburgh’s past.\n\n[Uncover More](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/pittsburghs-hidden-history/)\n\n## Haunted History Center Halloween\n\nEvents\n\nHeinz History Center\n\nStep inside the History Center for a spooktacular day of tricks, treats, and ghoulishly grand fun on Oct. 26!\n\n[Learn More](https://www.heinzhistorycenter.org/event/haunted-history-center-halloween/)\n\n## What's On: Events\n\nSearch our calendar of upcoming events hosted by our family of museums!\n\n[View All Events](https://www.heinzhistorycenter.org/events/)\n\n- October 11\n\nFort Pitt Museum –\n1:00 PM\n\n### [Speaker Saturday: Overshadowed by These Occult Influences](https://www.heinzhistorycenter.org/event/speaker-saturday-overshadowed-by-these-occult-influences/)\n\nJoin the Fort Pitt Museum to learn about the hidden beliefs that lingered in the Ohio Valley.\n\n- October 16\n\nHeinz History Center –\n6:30 PM\n\n### [Hidden History Trivia Night](https://www.heinzhistorycenter.org/event/hidden-history-trivia-night-10162025/)\n\nIt’s a dark and stormy trivia night in Pittsburgh…with a spooky twist!\n\nTickets Required\n\n- October 18\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Archaeology Day](https://www.heinzhistorycenter.org/event/archaeology-day-2025/)\n\nDig into the past at Meadowcroft’s Archaeology Day!\n\n[View All Events](https://www.heinzhistorycenter.org/events/)\n\n## Preserving Pittsburgh’s Memories\n\nDetre Library & Archives\n\nHeinz History Center\n\nResearch family history, explore historic images, and search thousands of documents in the Detre Library & Archives at the History Center. Open Wednesday through Saturday and free to all visitors.\n\n[Research & Explore](https://www.heinzhistorycenter.org/research/detre-library-archives/)\n\n## More than a ketchup museum.\n\nThe Heinz History Center is Pittsburgh’s people museum. We share the inspiring stories of Western Pennsylvania’s people who have helped change the course of American history. See for yourself.\n\n[Explore Exhibits](https://www.heinzhistorycenter.org/whats-on/exhibits/)\n\n- ![A man and a young girl enthusiastically interact with a colorful exhibit at the Heinz History Center; the man smiles while the girl, dressed in a blue dress, points at the display. Other visitors and museum exhibits appear in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Family-Zone-300x200.jpg)\n\n### [Kids & Families](https://www.heinzhistorycenter.org/families/)\n\nBuild bridges in the interactive Discovery Place or explore the Neighborhood of Make–Believe.\n\n- ![various sports museum merchandise](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/pittsburgh-flatlay-300x200.jpg)\n\n### [Unique Pittsburgh Gifts](https://shop.heinzhistorycenter.org/)\n\nFrom exclusive Heinz merch to the Mister Rogers kindness collection, find the perfect Pittsburgh gift at the Museum Shop.\n\n- ![Two people stand in front of a vintage military Jeep displayed indoors against brick walls, reading an informational plaque.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Great-Hall_HHC_2377-copy-300x200.jpg)\n\n### [Smithsonian Treasures](https://www.heinzhistorycenter.org/about/the-smithsonians-home-in-pittsburgh/)\n\nDiscover Smithsonian artifacts at the History Center and learn more about the museum’s Smithsonian affiliation.\n\n- ![Two women wearing striped aprons and white caps prepare and pack vegetables at a table labeled Heinz, surrounded by bowls of produce and glass jars, reminiscent of a historical food processing scene.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Heinz-pickle-workers-300x200.jpeg)\n\n### [Explore Our Collections](https://www.heinzhistorycenter.org/research/explore/)\n\nThousands of artifacts and historic images, at your fingertips.\n\n- ![A man and a young girl enthusiastically interact with a colorful exhibit at the Heinz History Center; the man smiles while the girl, dressed in a blue dress, points at the display. Other visitors and museum exhibits appear in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Family-Zone-300x200.jpg)\n\n### [Kids & Families](https://www.heinzhistorycenter.org/families/)\n\nBuild bridges in the interactive Discovery Place or explore the Neighborhood of Make–Believe.\n\n- ![various sports museum merchandise](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/pittsburgh-flatlay-300x200.jpg)\n\n### [Unique Pittsburgh Gifts](https://shop.heinzhistorycenter.org/)\n\nFrom exclusive Heinz merch to the Mister Rogers kindness collection, find the perfect Pittsburgh gift at the Museum Shop.\n\n- ![Two people stand in front of a vintage military Jeep displayed indoors against brick walls, reading an informational plaque.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Great-Hall_HHC_2377-copy-300x200.jpg)\n\n### [Smithsonian Treasures](https://www.heinzhistorycenter.org/about/the-smithsonians-home-in-pittsburgh/)\n\nDiscover Smithsonian artifacts at the History Center and learn more about the museum’s Smithsonian affiliation.\n\n- ![Two women wearing striped aprons and white caps prepare and pack vegetables at a table labeled Heinz, surrounded by bowls of produce and glass jars, reminiscent of a historical food processing scene.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Heinz-pickle-workers-300x200.jpeg)\n\n### [Explore Our Collections](https://www.heinzhistorycenter.org/research/explore/)\n\nThousands of artifacts and historic images, at your fingertips.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.167139", "metadata": {"original_content_length": 9395, "cleaned_content_length": 7822, "word_count": 823, "char_count": 7822, "description": "Welcome to the #1 History Museum in America and the Smithsonian's home in Pittsburgh.", "event_time": "10 AM - 5 PM"}}
{"url": "https://www.heinzhistorycenter.org/blog/was-the-worlds-first-gas-station-in-pittsburgh-its-complicated/", "title": "Was the World’s First Gas Station in Pittsburgh? It’s Complicated. - Heinz History Center", "content": "Every December 1, posts celebrate the anniversary of Gulf opening the first drive-in gas station in 1913. That small, somewhat circular building on Baum Boulevard in East Liberty was a game-changer in automotive history, but was it the world’s first?\n\nNo. The Gulf Oil Historical Society, which assures us of the 1913 station’s significance, likewise admits, “This was NOT the first filling station. It was NOT Gulf’s first station, it is not the oldest station, or the first place where you could drive off the road into a lot and buy gas.”1\n\nSo why do we celebrate it every December?\n\nIn 2000, the society sponsored a state historical marker at the spot titled the “First Drive-In Filling Station,”2 but even that skinny “urban street style” marker, with limited wording, does little to clarify the confusion.\n\nAnd while this famous Gulf station lasted only about a decade, an even older gas station survives in Pittsburgh, yet it receives no attention or yearly celebrations.\n\nAs usual, the real story is more interesting than the mythologized tale.\n\n# Was the World’s First Gas Station in Pittsburgh? It’s Complicated.\n\n## Contents\n\n- [1 Early Stations](https://www.heinzhistorycenter.org/blog/was-the-worlds-first-gas-station-in-pittsburgh-its-complicated/#EarlyStations)\n- [2 Automobile Row](https://www.heinzhistorycenter.org/blog/was-the-worlds-first-gas-station-in-pittsburgh-its-complicated/#AutomobileRow)\n- [3 Building Gulf's First Station](https://www.heinzhistorycenter.org/blog/was-the-worlds-first-gas-station-in-pittsburgh-its-complicated/#BuildingGulfsFirstStation)\n- [4 Free Services](https://www.heinzhistorycenter.org/blog/was-the-worlds-first-gas-station-in-pittsburgh-its-complicated/#FreeServices)\n- [5 Competition](https://www.heinzhistorycenter.org/blog/was-the-worlds-first-gas-station-in-pittsburgh-its-complicated/#Competition)\n- [6 So was Gulf First?](https://www.heinzhistorycenter.org/blog/was-the-worlds-first-gas-station-in-pittsburgh-its-complicated/#SowasGulfFirst)\n- [7 Legacy](https://www.heinzhistorycenter.org/blog/was-the-worlds-first-gas-station-in-pittsburgh-its-complicated/#Legacy)\n\n### **Early Stations**\n\n- c. 1900 Global — Motorists purchase gasoline at blacksmith shops, hardware stores, even grocery stores, especially if they already carried kerosene for home lighting. Fuel would be scooped or poured from a barrel into a can to then fill the car.3\n- 1905 St. Louis, Mo. — Automobile Gasoline Co. opens the first purpose-built gas station, a tiny building adjacent to an oil distribution center, using a converted hot water tank and gravity-fed hose.4\n- 1907 Seattle, Wa. — Standard Oil of California opens a station at its bulk plant.5\n- 1908 Pittsburgh, Pa. — Harvey Dauler opens a station for his Petroleum Products Company on Bigelow (then called Grant) Boulevard near today’s Bloomfield Bridge.\n- 1909 St. Louis, Mo. — American Gasoline builds the first “drive-in”—a tin shed.6\n- 1909 Altoona, Pa. — east of Pittsburgh, Reighard’s Gas Station opens in Altoona. It remains the world’s oldest continually operating gas station.7\n- 1910 Flint, Mich. — Central Oil and Gasoline Station opens with a canopy above a drive-in lane, gas pump, and free air.\n- 1910 Columbus, Ohio — Standard Oil of Ohio builds a drive- _through_ station.\n- 1912 Pittsburgh, Pa. — Dauler replaces his station on Grant with a huge warehouse and station. He had also opened another station a block west near Polish Hill.\n- 1913 Pittsburgh, Pa. — In June, Murwin Gasoline Company opens “the latest in gasoline filling stations” on Grant, with space to pull off the street.8\n- 1913 Pittsburgh, Pa. — By November, Gasoline Supply Co. has four stations in the metro area.9\n- 1913 Pittsburgh, Pa. — December 1, Gulf opens its first station on Baum Boulevard.\n\n### **Automobile Row**\n\nGulf Oil Corporation traces its roots to 1901 but was formally founded in 1907 through a merger of oil businesses.10 Pittsburgh’s Mellon family was Gulf’s first and foremost investor, intertwining its oil holdings and Mellon Bank for decades.11\n\nThe company grew alongside car sales—registrations rose from 8,000 in 1900 to 1.2 million in 1913.12 That year became a turning point in auto-related architecture, moving beyond manufacturing plants to repair stations, parking garages, salesrooms, and retail facilities to dispense gas and charge batteries.13\n\nGulf watched the rise of stations, even right in its hometown, and saw the potential to control another step in the process from well to consumer, especially as independent oil producers were making gains in reaching the new customers. Gulf was an early proponent of branding its gas as a sales tactic, and a branded station was the next natural step.\n\nAmong the Mellon family holdings were numerous properties along Baum Boulevard in the city’s East End. The carriage trade had settled in this strategically central location between the downtown business district and Millionaire’s Row residences in today’s Point Breeze neighborhood to the east. Baum was not a through street yet, chopped up by a couple of ravines and the East Liberty Presbyterian Church blocking the road at Penn Avenue. So while parallel Centre Avenue clogged with streetcars, Baum had none, making it easier for its businesses to serve horse-drawn vehicles.14 The straight, uncrowded road was known as a racer’s paradise in summer, while snow was left uncleared throughout the winter for sleighs.15\n\nBy 1910, those businesses had begun serving horseless carriages. By 1913, Baum, now bridged west to Craig Street and Grant Boulevard, became known as Pittsburgh’s Automobile Row, a term for where an area’s car businesses congregated.16 Block after block filled with garages, tire shops, and car dealers. The local auto club settled there, and Ford soon built a plant on Baum at Morewood Avenue to assemble Model Ts.\n\nThe biggest boost came in 1913 when the Lincoln Highway was established on Halloween; multitudes of cross-country drivers following the premier transcontinental route entered Pittsburgh from the east via Penn Avenue, turned onto Baum Boulevard, followed it for a mile and a half, turned right onto Craig, and quickly merged onto Grant Boulevard for the rest of the route into downtown.\n\n### **Building Gulf’s First Station**\n\nThe site chosen by Gulf for its first station was a triangle of land on Baum where St. Clair Street branches northeast. An 1890 map labels that triangle as “Baum Grove—Mellon’s Plan,” a green space in a planned housing development. An 1899 map still shows the grove, and Baum remains mostly empty, but substantial houses had begun to fill plots to the north. By 1911, the triangle was still ascribed to T.R. Mellon et al; from that point east, numerous garages and dealerships had been established selling makes such as Arlen, Buick, Ford, Franklin, Keystone, Standard, White, and Winton.\n\nIt’s rumored that Mellon’s triangular property already had a primitive setup selling Gulf gas. When Gulf Oil took over midway through 1913, it leased the property from Mellon at $16 a month for the first year, $24 the second year.\n\nThe idea to build a station to rise above all others was the brainchild of Gulf general sales manager W.V. Hartmann, and he turned to James Giesey, architect for the Mellon family.17 Giesey’s challenge was to create a unique structure that could serve the public efficiently and professionally while also storing gasoline, oil, and lube, plus have space for an office and restroom.\n\nGiesey had broad and varied experience; in 1912, he’d assisted in lowering the floor of the Mellon Bank building by 28 inches to accommodate the elimination of Pittsburgh’s “hump,” the rise at the foot of Grant’s Hill that made travel in town difficult.18 Just a few months later, he designed a new office building in Tudor style for the United States Aluminum Company at New Kensington.19 And later that year, when brothers Andrew and Richard Beatty Mellon built the first Mellon Institute for Industrial Research, they turned to Giesey, who chose an austere Classical style.20\n\nConstruction got underway in summer 1913. H.S. Moorhead, whose company was tasked with building the novel structure, recalled that the job took a few months, not only because it was a new concept but also because pilings were needed in the sandy soil.21 Lower walls of dark, rough red brick had stucco above the windowsills. Above that, a cantilevered roof (an overhang without supports) covered 13 Bowser Red Sentry pumps that sat on a concrete sidewalk around the building. The style is often called a pagoda for being a small, rounded building with a low, squarish roof, though otherwise it was more workmanlike than stylized. The overhanging roof did shield motorists from weather in the era when almost all cars were open-topped, though few cars ventured out in rainy weather and spent winters up on blocks. Finally, Gulf advertised with large signs made of incandescent bulbs along the roofline cornice.22\n\n### **Free Services**\n\nA notice was sent to nearby automobile owners to announce the opening on December 1.23 Frank McLaughlin, first manager of the station, later explained, “We sent out invitations to all motorists in the neighborhood but how much business this station would do, no one dared to guess.”24 To provide prompt service, four attendants were hired in two overlapping shifts. Early sales were disappointing: just 30 gallons sold the first day, 32 the next. However, word spread and 350 gallons were sold the first Saturday.\n\nMcLaughlin recalled, “We had two gasolines, Good Gulf and Peerless Motor, and every drop had to be raised from the underground storage tanks by a one-gallon capacity hand-operated pump.”25 And though gas could be pumped straight into gas tanks, he was instructed to follow what most customers were used to—pour the gas into a five-gallon can and then into the car. Many a driver also brought along a hydrometer to test the specific gravity, which was the current measure of quality.\n\nMcLaughlin said that when the first customer asked for crankcase service—an oil change—he didn’t charge for the service, just told the man to tell his neighbors. A few days later, the first neighbor came by and told McLaughlin, “It’s the little extras in a business like this that bring people in.” McLaughlin took the cue, responding that he would also fill radiators for no charge, fill tires with air, and not charge for labor when tires and tubes were bought or repaired. Like Gulf management, McLaughlin wanted it to be, as he said, “a service station.”26\n\nThe station was open 7 a.m. to 11 p.m., with a guard overnight. Late one night the first spring, a car pulled up, just about out of gas, hoping the guard could drain enough out of the hoses for them to reach home. Instead, the guard offered to turn on the pump and fill the car; two days later, 24-hour service was inaugurated.27 That same spring, the employee washroom was opened to the public, starting a welcome trend that continues to this day.\n\nTo promote the station, Gulf embraced the concept of free oil company road maps. The idea originated in spring 1914 with Pittsburgh advertising executive William Akin. After servicing his car (a 1912 Chalmers) at the station, the next day he took a sketch of his idea to company headquarters and convinced Gulf it should mail maps of Allegheny County to potential customers as a way of attracting them to their new retail outlet. His run of 10,000 was a success, so Gulf ordered 300,000 maps of Pennsylvania, New York, New Jersey, and New England to mail or hand out. Unfortunately, no copies or photos of the first map are known to survive.28\n\n### **Competition**\n\nAt least a couple good photos survive of the first Gulf station, but an account that captures the novelty comes from a near-identical station that opened in 1916 on Penn Avenue/Lincoln Highway in Wilkinsburg. Its style was said to be “harmonious in every detail, and is a building designed to look like a gasoline service station—nothing else—and yet have architectural beauty…. The circular construction and the placing of the great pumps which supply gasoline lend particular convenience to incoming and outgoing traffic, the pumps being so placed that there can be no congestion of cars, and the cars are not forced to stop at the curb for oils and gasoline.”29\n\nWithin months, imitators were building similar stations too. One company made news by proposing “a chain of service stations along the Lincoln Highway.”30 Standard Oil of California began a chain of 34 stations following standardized guidelines.31\n\nGulf itself began opening other locations as well. In anticipation of the Bloomfield Bridge that would open in November 1914, Gulf purchased Dauler’s Petroleum Products complex at the bridge’s west end and opened its second station on July 1, 1914.32 The busy intersection at 3600 Grant Boulevard was known as the “Big Bend” for the curve that met the bridge.33 Meanwhile, Dauler still operated his station on Grant at Finland Street, near Polish Hill.34\n\nAtlantic Refining opened its first outlet, which it called a “service station,” in August 1914. Atlantic had purchased a lot on Baum that had been part of the shuttered Luna Park; the site was being developed into numerous auto businesses.35 Atlantic had planned for its plot, on the northeast corner of Melwood, to be “a handsome salesroom and warehouse” for fuel and oils.36Following Gulf’s success, Atlantic instead opened its first station with public restrooms, free air, telephones, and daily operation (except Sunday).37\n\nSensing that communities wanted more visual appeal from what was seen as a grimy industry, Atlantic embraced Beaux Arts classicism to appeal to wealthy car-owners and to confer respectability to its brand. Glazed terra cotta abounded along with other architectural flourishes. In a direct challenge to Gulf’s bragging, Atlantic even went as far as calling its first outlet “the first service station in the east.”38 Atlantic would continue to pivot away from Gulf’s small, plain structures by building ever-more elaborate, monument-size stations.\n\nAfter a stop-and-go gestation, by 1920—just seven years later—the United States had 15,000 service stations.39\n\n### **So was Gulf First?**\n\nOn the 50th anniversary of the first Gulf in 1963, a wire-service article feted Gulf’s establishment of “the world’s first drive-in gasoline station.”40 The claim was that other stations were less formal. Most of the other stations lasted only a few years or the companies folded, letting Gulf write and promote its history as being the first.\n\nHowever, that history would not go unchallenged. The day after the 50th anniversary article ran in the _Southeast Missourian_, Harvey Dauler’s daughter called the newspaper to defend his claim and make a further one: Gulf had even purchased his existing drive-in station at the Bloomfield Bridge.41\n\nHarvey Dauler, who opened at least two Petroleum Products Company stations in Pittsburgh before Gulf, has a long line of defenders to these claims. His first station in 1908 was the one where the western end of the Bloomfield Bridge would land in 1914 (at 3600 Grant Boulevard, called the “Big Bend”).42 The novelty of it offering fuel, oils, and carburetor adjustments even made the papers: “The gasoline sub-station of Petroleum Products Company on the Grant Boulevard has made quite a stir.”43\n\nIn 1910, he also bought property a big block west at Finland Street, where he opened his second station.\n\nIn 1912, Dauler replaced his building at the bridge with a massive warehouse, office, and a wide apron for drive-in service. The location made the news this time for its construction of “steel, hollow tile … and ornamental tile roofing.”44 Sadly it made the front page a few months later for a major explosion and horrific death.45\n\nOn the Gulf station’s 100th anniversary in 2013, the _Pittsburgh Post-Gazette_ ran a story46 that brought a swift response from Harvey Dauler’s grandson, Van Dauler, who was the chairman of the board and former president of Neville Chemical Company, founded by Harvey in 1925.\n\nVan wrote, “The _Post-Gazette_ is once again perpetuating the myth that Gulf Oil Company started the first drive in filling station when in fact the first such service station was started by my grandfather Harvey N. Dauler. In the February 26, 1936, _National Petroleum_ _News_, \\[they\\] published a retraction of two articles that they had published and indicated that Harvey N. Dauler had submitted proof that he opened his gas station in 1908. This station was remodeled to a drive-in station in 1912. Both these dates are prior to the Gulf oil claim.”\n\nTo this day, Neville Chemical celebrates Harvey’s achievement: “In 1908, Harvey N. Dauler was employed by Gulf Oil Corporation, selling oil and gasoline to garages and repair shops. When he suggested that Gulf establish curbside stations to sell gasoline directly to motorists, his idea was rejected. Dauler resigned and opened what is generally accepted to be the world’s first service station on Bigelow Boulevard in Pittsburgh.”47 By 1923, maps show his location on Grant at Finland Street was now a Pure Oil station.\n\nDauler and Gulf had other competitors in town too. Gasoline Supply Co. began opening locations in 1913. Little else is known, but by November, it advertised four “service stations”: downtown on Liberty Avenue at Second Street, East End on Penn Avenue at Beatty Street, Wilkinsburg at 606 Penn, and its “Boulevard Station” at 3755 Grant Boulevard in North Oakland.48\n\nAnd then there was the Murwin Gasoline Company drive-in station, opened in June 1913. It sat just west of Dauler’s at 3393 Grant Boulevard, near the five-way intersection with Herron Avenue. A news report explained that Murwin “set their building back of the pavement line, so that the cars, when filling, are off the street and pavement line and in no danger of a collision from the rear.”49 The drive-in had Wayne pumps, a pagoda-style roof, and overall the building was “of Swiss architecture”—surely all noticed by Gulf’s architect Giesey.\n\nMore amazing, the Murwin station survives! It is painted black and covered with graffiti but it still stands along Bigelow Boulevard. Decrepit and silent, it remains the lone tangible connection to the “who was first” station competition.\n\n### **Legacy**\n\nMore than a century on, no one living can remember what became of Gulf’s first station, but luckily an 80-year-old postcard can now bring some clarity. I was contacted by Ellen Smith Davis, whose family took over Gulf’s first station site about 1940.50 The postcard shows the first Gulf had been replaced by a larger station in the new “brick tapestry” style that Gulf had adopted in the early 1920s.\n\nEllen wrote, “My husband’s grandfather, Trevor Leonard Smith, and his brother, Lewis G. Smith, owned that business and its precursor, Lewis G. Smith and Co., Inc. From family lore I know that Mr. Trevor Smith was friendly with many of the chauffeurs to the rich of the day, as he kept their cars in working order. He resided close by the Baum/St. Clair Street location.”51\n\nBy 1952, directories show the triangular site on Baum vacant, then the following year it was a used car lot.52 It has been a parking lot as long as anyone can remember, but when the concrete ages, some old driveway outlines can still be discerned.\n\nSo what can we conclude about Gulf’s first station?\n\nAs the 50th anniversary articles stated, “This first station was to change the concept of gasoline marketing, set a style for such stations for years to come, and, for the first time, change the name of such outlets from ‘filling’ stations to ‘service’ stations.”53 Gulf too has long referred to it as the “world’s first drive-in service station,”54 though we see others were using that term beforehand.\n\nUltimately, the long-standing tussle shows the peculiar human desire to be first. Claiming a “first” brings pride to a community and shows, in their minds, that they are more innovative, more welcoming to inventors, or just plain smarter for having created something before others … no matter how many qualifiers must be added after the word “first.”\n\nGulf may not have been the first drive-in, or first to call itself a service station, but it undoubtedly had the foresight to design its building for convenience, then deliver its products and services in a welcoming, professional manner that set the standard for all that followed. Perhaps we can call it “the world’s first architect-designed, drive-in service station.”\n\n## About the Author\n\nBrian Butko has published books on local and roadside businesses, and is writing a haunted historical mystery inspired by his hometown quarry. He is editor of the History Center’s quarterly journal, _Western Pennsylvania History_.\n\nThank you to the History Center’s Library & Archives staff including Jennie Benford, Tim Breslin, Margaret Hewitt, Art Louderback, Carly Lough, and Matt Strauss, and thank you also to proofreaders Lee Ann Draud, Margaret Hewitt, Sue Morris, and Elizabeth Simpson Romano.\n\nLearn more about Gulf at the Heinz History Center’s Detre Library & Archives in the extensive Gulf Oil Corporation Records, 1865-1985, MSS 954. Artifacts in the museum collection can also be found at: [http://museumcollections.heinzhistorycenter.org/search/gulf/](http://museumcollections.heinzhistorycenter.org/search/gulf/).\n\n## Image Gallery\n\n## Image Gallery\n\nThe first Gulf station, artist rendering, adapted.\nHHC Detre L&A, MSS 954, _The Orange Disc_, 1940.\n\n## Image Gallery\n\nA 1924 composite map shows the location of Gulf’s first station, just left of center in the midst of Pittsburgh’s Automobile Row. The station’s footprint suggests that the 1913 station had already been replaced by Gulf’s second generation style.\nUniversity of Pittsburgh Digital Research Library, G.M. Hopkins Co., Volume 3.\n\n## Image Gallery\n\nGulf’s pioneering station in Pittsburgh, perhaps December 1, 1913.\nHHC Detre L&A, MSS 954.\n\n## Image Gallery\n\nReproduction of the opening day invite mailer from 1913.\nHHC Detre L&A, MSS 954, _The Orange Disc_, 1940.\n\n## Image Gallery\n\nGulf purchased Dauler’s big Petroleum Products location at 3600 Grant Boulevard to open its second station on July 1, 1914. The site was at the “Big Bend” curve where it met the Bloomfield Bridge that opened four months later. Photo July 10, 1921.\nUniversity of Pittsburgh, Pittsburgh City Photographer, 715.2181.CP.\n\n## Image Gallery\n\nA c. 1940 postcard of the Lewis G. Smith Gulf at 5801 Baum shows the 1920s building that replaced Gulf’s original 1913 station.\nEllen Smith.\n\n## Image Gallery\n\nAt the replacement building on Baum, co-owner Trevor Smith stands second from left at the station named for his brother.\nEllen Smith, colorized by author.\n\n## Image Gallery\n\nThe Murwin drive-in station opened in summer 1913.\n_Pittsburgh Press_, June 29, 1913, p. 17.\n\n## Image Gallery\n\nThe Murwin building, having seen better days, survives as Pittsburgh’s true first drive-in station.\nBrian Butko, November 2022.\n\n## Image Gallery\n\nAtlantic opened a station in August 1914 on Baum on the northeast corner at Melwood, where it had been planning a warehouse. The company opted for a more “respectable” look by employing terra cotta and a tile roof.\nBrian Butko.\n\n## Image Gallery\n\nA free Gulf map from c. 1922 directed drivers along the Lincoln Highway, where most of the company’s first stations were located.\nBrian Butko.\n\nPreviousNext\n\n1234567891011\n\n1 The Gulf Oil Historical Society offers brand information, including about the first station at [http://www.gulfhistory.org/specs/stations/page2.html](http://www.gulfhistory.org/specs/stations/page2.html). The mention of previous Gulf stations refers to others who were selling Gulf gas such as Harvey Dauler’s Petroleum Products Company station.\n\n2 “First Drive-In Filling Station Historical Marker,” dedicated July 11, 2000, at [http://explorepahistory.com/hmarker.php?markerId=1-A-112](http://explorepahistory.com/hmarker.php?markerId=1-A-112). “Gulf Refining was the first company to professionalize the service.”\n\n3 Six years after Model T intro, gasoline replaced kerosene as the country’s leading refined petroleum product. Michael Karl Witzel, _The American Gas Station_ (Osceola, WI: Motorbooks, 1992), p. 29.\n\n4 The 1905 story is recounted (though mentions a hand pump and not gravity) in the National Register of Historic Places Registration Form for “Gardner & Tinslev Filling Station” in New Cambria, MO, 2002, at [https://mostateparks.com/sites/mostateparks/files/Gardner%20and%20Tinsely%20Filling%20Station.pdf](https://mostateparks.com/sites/mostateparks/files/Gardner%20and%20Tinsely%20Filling%20Station.pdf)\n\n5 “1st Gas Station Argued: Gulf Kicks at Standard Claim,” _Pittsburgh Post-Gazette_, September 5, 1966, p. 10; “Service Station Controversy,” _The Morning Record_, Meriden, CT, Sept. 29, 1966.\n\n6 John A. Jakle and Keith A. Sculle, “The Gas Station in America” (Baltimore: Johns Hopkins Univ. Press, 1994) p. 131-132.\n\n7 See Reighard’s history at [https://martinoilco.com/reighards/](https://martinoilco.com/reighards/).\n\n8 “Handsome Quarter of Murwin Gasoline Co.,” _Pittsburgh Press_, June 29, 1913, p. 17.\n\n9 “Gasoline Supply Co.” ad, _Pittsburgh Press_, Nov. 16, 1913, Editorial Section, p. 6.\n\n10 The Gulf Oil Historical Society says that Gulf’s “true ‘Birthday’ was November 10th, 1901. On that date, in Pittsburgh PA, the charter for the ‘Gulf Refining Company of Texas’ was signed. This was the first official use of the word ‘Gulf’ as an oil concern,” at [http://www.gulfhistory.org/specs/index.htm](http://www.gulfhistory.org/specs/index.htm).\n\n11 Sculle p. 100.\n\n12 Figures are from Motor Vehicle Registrations via [www.allcountries.org/uscensus/1027\\_motor\\_vehicle\\_registrations.html](http://www.allcountries.org/uscensus/1027_motor_vehicle_registrations.html), sourced from the U.S. Federal Highway Administration, Highway Statistics, annual:\n\n1900 8,000\n\n1905 79,000\n\n1909 312,000\n\n1913 1,258,000\n\n1915 2,491,000\n\n13 Gabrielle Esperdy, _American Autopia: An Intellectual History of the American Roadside at Midcentury_ (Charlottesville: University of Virginia Press, 2019), online at [https://www.google.com/books/edition/American\\_Autopia/QeONDwAAQBAJ?hl=en&gbpv=1&dq=pittsburgh+architect+%22James+Giesey%22&pg=PT52&printsec=frontcover](https://www.google.com/books/edition/American_Autopia/QeONDwAAQBAJ?hl=en&gbpv=1&dq=pittsburgh+architect+%22James+Giesey%22&pg=PT52&printsec=frontcover)\n\n14 Brian Butko, _Luna: Pittsburgh’s Original Lost Kennywood_ (Pittsburgh: Heinz History Center, 2017), p. 45–46. Before it was complete, Baum had been Atlantic, and then briefly, Atherton Avenue.\n\n15 H.S. Moorhead, “Old Baum Boulevard,” _The Orange Disc_, November-December, 1953, p. 11.\n\n16 As historian Robert Bruce noted, by 1919, “For more than a mile this section of Baum Street, or Baum Boulevard, is the ‘Automobile Row’ of Pittsburgh; and even a run through without stop impresses the stranger with the number and variety of motor car agencies, many occupying their own large and costly buildings,” per Robert Bruce, “The Historic Philadelphia-Pittsburgh Highway—Part XXVII,” _Motor Travel_, September 1919, p. 35 (p 29-37). This is the magazine of the Automobile Club of America. Society could sense the coming tidal wave: a June 1913 newspaper article lamented that the end was near for the hitching post, the livery stable, and the blacksmith now that the automobile has become so ubiquitous, bringing with it garages, repair shops, and gasoline filling stations. But the article was not negative—it saw far greater opportunity for manufacturers to turn to automobile needs, per “What has Become of the Hitching Post?,” _Pittsburgh Post_, June 25, 1913, Sporting Section, p. 3. The July 23, 1913, _Horseless Age_ mentions Baum Boulevard businesses U.S. Tire, Buick, Forbes, Ford, Henderson, Locomobile, Oldsmobile, Wahl, Williams-Halsey, Winton, and Pittsburgh-Haynes Automobile Co. The East Liberty market house had been taken over by the Automobile Dealers’ Assn. and renamed Motor Square Garden.\n\n17 Obituary for J.H. Giesey, _Pittsburgh Press_, November 18, 1938, p. 4, states that he was an architect in Pittsburgh for 20 years, c. 1899¬–1919.\n\n18 “Drop Building 28 Inches in the Hump District,” _Pittsburgh Press_, June 1, 1912, p. 2. At its largest excavation, the hump was lowered 18 feet.\n\n19 “New Office Building for the United States Aluminum Co.,” _Pittsburgh Press_, June 14, 1914, p. 36.\n\n20 It is still there as Allen Hall for the University of Pittsburgh, per Patricia Lowery, “Remnants of Pitt’s ‘Campus Beautiful’ May Face Demolition,” _Pittsburgh Post-Gazette_, November 7, 1993, _Sunday Magazine_ p. 12, and “The New Mellon Institute is a Modern Research Laboratory,” _Pittsburgh Press_, February 14, 1915, p. 8. A 1916 clipping states that he was designing a residential home.\n\n21 Building information is from Moorhead, 1953. H.S. Moorhead was also president of the Pittsburgh Transportation Association, per Gas Saving Accelerator Co. ad, _Pittsburgh Sunday Post_, June 20, 1920.\n\n22 The builder said anchors had to run down to the footers to keep the roof from blowing off, per Moorhead, p. 11.\n\n23 It’s widely reported that on the exact same day, December 1, 1913, Ford introduced the moving assembly line to mass produce cars, but it’s not true. Experiments with a moving assembly line had been underway for some time, with full use underway on October 7. The December day saw a test of making the line longer, per Horace Lucian Arnold and Fay Leone Faurote, _Ford Methods and the Ford Shops_ (New York: Engineering Magazine Co., 1915), p. 136.\n\n24 F.P. McLaughlin, “We Were First!,” _The Orange Disc_, March-April, 1940, p. 3.\n\n25 McLaughlin, 1940, p. 4.\n\n26 Ibid.\n\n27 McLaughlin, 1940, p. 5.\n\n28 Harold Cramer, “The Early Gulf Road Maps of Pennsylvania,” Articles on Historical Maps of Pennsylvania, [https://www.mapsofpa.com/article5.htm](https://www.mapsofpa.com/article5.htm).\n\n29 Penn was also the Lincoln Highway. Duplicate stations had also opened in Philadelphia and Atlantic City. This station was opposite Columbia Hospital, just west of the PRR tracks, per and “Gulf Refining Co. Locates New Station,” _Pittsburgh Sunday Post_, October 29, 1916, Sec. 3, p. 7, and “New Gasoline Service Station is Completed,” _Pittsburgh Gazette Times_, October 29, 1916, Sec. 6, p. 4.\n\n30 National United Service Co. of Detroit, as reported in _Horseless Age: The Automobile Trade Magazine_, May 27, 1914, p. 817.\n\n31 The chain was launched in 1914 per Sculle p. 132, and Witzel, p. 29.\n\n32 See for example, “Gulf Service Stations” ad, _Pittsburgh Gazette Times_, July 12, 1914, Sec. 2, p. 7.\n\n33 Ad, acquisition of new service station, _Pittsburgh Gazette Times_, Sec 6, p. 3\n\n34 “Gasoline & Oils” classified lists the PPC retail station at 3501 Grant Boulevard, though that does differ from the 3500 address previously listed, per _Pittsburgh Press_, September 5, 1915, p. 43.\n\n35 “Realty Sales Were of Minor Nature Today, _Pittsburgh Press_, Oct. 16, 1913, p 16.\n\n36 “Handsome Building Is Planned,” _Pittsburgh Gazette Times_, Oct 22, 1913, p. 15.\n\n37 Opening ad, _Pittsburgh Gazette Times_, Aug. 15, 1914, p. 11.\n\n38 Information on Atlantic architecture is from Keith A. Sculle, “Pittsburgh’s Monuments to Motoring: Atlantic’s Fabulous Stations,” _Western Pennsylvania History_, Fall 2000, p. 122–135, 168.\n\n39 Sculle p. 132.\n\n40 See for example, “Anniversary of First Gas Station,” the _Southeast Missourian_, Dec. 9, 1963. Oddly, Pittsburgh’s over version in the Press was a short feature in the Sunday Roto, Dec. 1, 1963. Also see Rich Gigler, “Who Did Open The First Gas Station,” _Pittsburgh Press_, July 10, 1983, _Family Magazine_, p. 1 & 3.\n\n41 “Father of Local Woman Was Gas Station Pioneer,” _St. Joseph Gazette_, Dec. 3, 1963, p. 2.\n\n42 “New Gasoline Basis,” _Pittsburgh Gazette Times_, Oct. 4, 1908, Sec. 3, p. 5., is the first mention of a Dauler station. Since “Other Notable Sales,” _Pittsburgh Post_, Feb. 18, 1910, p. 11, is the first mention of Dauler buying the Polish Hill site on Grant near Finland, the 1908 site is likely the Bloomfield Bridge area site. Also see city directories; for example, 1909 lists Harvey Dauler Petroleum 3600 Grant Boulevard, 1917 lists him as President of Petroleum Products at 3503 Bigelow Blvd., and 1919 as President of Beaver Refining Co\n\n43 “New Gasoline Basis,” 1908.\n\n44 “It is noticeable that the builders are not losing sight of the artistic in having architects design them,” this one by architect Sidney F. Heckert, per “Warehouse to Be Built,” _Pittsburgh Gazette Times_, September 24, 1911, Sec. 2, p. 4, and see “Another New Industry,” _Pittsburgh Gazette Times_, October 22, 1911, Sec. 2, p. 6.\n\n45 “Grant Boulevard Explosion Kills One, Injures Ten,” _Pittsburgh Post_, July 12, 1910, p.1\n\n46 Michael Sanserino, “Fill ’Er Up!,” _Pittsburgh Post-Gazette_, Dec. 1, 2013, p. D1 & D4\n\n47 “Neville Chemical Company History” at [https://www.nevchem.com/history?rq=Dauler/](https://www.nevchem.com/history?rq=Dauler/).\n\n48 “Gasoline Supply Co.” ad, 1913. Also see incorporation notices, May 1911.\n\n49 “Handsome Quarter,” 1913. Also see the company ad, _Pittsburgh Press_, June 22, 1913, p. 16, and “State Charters Granted,” _Pittsburgh Post_, April 16, 1913, p. 3, showing that the name was a combination of Murphy and Irwin.\n\n50 The 1940 Pittsburgh City Directory shows for the first time that could be located, a listing for 5801-09 Baum of “Smith Lewis G & Co. filling station.”\n\n51 E-mails with Ellen Smith Davis, Houston, Texas, Nov. 30 and Dec. 1, 2017. She added, “I believe the business may have been originally at 138 Whitfield St. based on some correspondence.”\n\n52 Pittsburgh City Directories, 1916–1953.\n\n53 “Anniversary,” _Southeast Missourian_, 1963, and similar wire service articles. For more recent writing, see “Fill ’er Up: Convenience on the Road, 1913,” in Fran Capo and Scott Bruce, _It Happened in Pennsylvania_ (Guilford, CT: Twodot, 2005), p. 77–80.\n\n54 See, for example, McLaughlin, 1940, and Moorhead, 1953.\n\nDateNovember 30, 2022\n\nAuthor\n\n- Brian Butko\n\nCategory\n\n- [Western Pennsylvania History](https://www.heinzhistorycenter.org/blog/?filters[category]=western-pennsylvania-history#filter_results)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.173146", "metadata": {"original_content_length": 38773, "cleaned_content_length": 34373, "word_count": 5217, "char_count": 34373, "description": "", "event_date": "July 1, 1914", "event_time": "7 a.m."}}
{"url": "https://www.heinzhistorycenter.org/whats-on/history-center/", "title": "Heinz History Center - Heinz History Center", "content": "Exhibit\n\nHeinz History Center\n\n# Pittsburgh’s Hidden History\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/pittsburghs-hidden-history/)\n\n## Heinz History Center\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/whats-on/history-center/#page_content)\n\nExplore This SectionClose\n\nThe Heinz History Center is located in Pittsburgh’s historic Strip District. We are open daily from 10 a.m. to 5 p.m.\n\n[Plan Your Visit](https://www.heinzhistorycenter.org/visit/heinz-history-center/)\n\n## Exhibits on View\n\n### Mister Rogers' Neighborhood\n\nExhibit\n\nHeinz History Center\n\nVisit the Special Collections Gallery to see original set pieces and exclusive artifacts from “Mister Rogers’ Neighborhood.”\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/mr-rogers-neighborhood/)\n\n- ![](https://www.heinzhistorycenter.org/wp-content/uploads/2025/03/list-image-PHH-exhibit-page-1-300x200.png)\n\n## [Pittsburgh’s Hidden History](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/pittsburghs-hidden-history/)\n\n**Open Now** This spring, the Heinz History Center is unlocking the vault and unveiling a treasure trove of artifacts from its vast collection.\n\n- ![A museum exhibit titled From Slavery to Freedom displays a large metal shackle and chain on a pedestal, floor illustrations depicting bodies linked by chains, and a seated mannequin representing an enslaved person. The display evokes the transatlantic slave trade era within a history museum in the US.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/FromSlaverytoFreedom_HistoryCenter_011_0072-300x200.jpg)\n\n## [From Slavery to Freedom](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/from-slavery-to-freedom/)\n\nEmbark on a journey that begins in 18th century Africa and continues through 21st century Western Pennsylvania.\n\n- ![A large, illuminated Heinz Tomato Ketchup bottle display stands in the center of a vibrant exhibition space featuring colorful walls, retro-style signage, classic Heinz memorabilia cases, and vintage decor elements.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/DSC_6041_HDR-credit-Amy-Cicconi_16by9-300x200.jpg)\n\n## [Heinz](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/heinz/)\n\nPour on the excitement for 150 years of Heinz innovations as part of the History Center’s newest exhibition.\n\n- ![A vintage red and cream streetcar labeled Pittsburgh is displayed indoors on tracks, surrounded by brick walls, metal beams, and empty café tables.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/History-Center_Trolley-300x200.jpg)\n\n## [Explore All Exhibits](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/)\n\nThe History Center has six floors of exhibits to explore!\n\n- ![](https://www.heinzhistorycenter.org/wp-content/uploads/2025/03/list-image-PHH-exhibit-page-1-300x200.png)\n\n## [Pittsburgh’s Hidden History](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/pittsburghs-hidden-history/)\n\n**Open Now** This spring, the Heinz History Center is unlocking the vault and unveiling a treasure trove of artifacts from its vast collection.\n\n- ![A museum exhibit titled From Slavery to Freedom displays a large metal shackle and chain on a pedestal, floor illustrations depicting bodies linked by chains, and a seated mannequin representing an enslaved person. The display evokes the transatlantic slave trade era within a history museum in the US.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/FromSlaverytoFreedom_HistoryCenter_011_0072-300x200.jpg)\n\n## [From Slavery to Freedom](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/from-slavery-to-freedom/)\n\nEmbark on a journey that begins in 18th century Africa and continues through 21st century Western Pennsylvania.\n\n- ![A large, illuminated Heinz Tomato Ketchup bottle display stands in the center of a vibrant exhibition space featuring colorful walls, retro-style signage, classic Heinz memorabilia cases, and vintage decor elements.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/DSC_6041_HDR-credit-Amy-Cicconi_16by9-300x200.jpg)\n\n## [Heinz](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/heinz/)\n\nPour on the excitement for 150 years of Heinz innovations as part of the History Center’s newest exhibition.\n\n- ![A vintage red and cream streetcar labeled Pittsburgh is displayed indoors on tracks, surrounded by brick walls, metal beams, and empty café tables.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/History-Center_Trolley-300x200.jpg)\n\n## [Explore All Exhibits](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/)\n\nThe History Center has six floors of exhibits to explore!\n\n## Upcoming Events\n\n[View All Events](https://www.heinzhistorycenter.org/events/)\n\n- October 7\n\nHeinz History Center –\n5:30 PM\n\n### [Fall Educator Open House](https://www.heinzhistorycenter.org/event/fall-educator-open-house/)\n\nExplore the museum and learn about History Center teacher resources.\n\nTickets Required\n\n- October 16\n\nHeinz History Center –\n6:30 PM\n\n### [Hidden History Trivia Night](https://www.heinzhistorycenter.org/event/hidden-history-trivia-night-10162025/)\n\nIt’s a dark and stormy trivia night in Pittsburgh…with a spooky twist!\n\nTickets Required\n\n- October 18\n\nHeinz History Center –\n8:30 AM\n\n### [Act 48: Preparing Students for America’s 250th](https://www.heinzhistorycenter.org/event/act-48-preparing-students-for-americas-250th/)\n\nJoin the Learning Team to learn primary sources strategies for your classroom.\n\nTickets Required\n\n- October 26\n\nHeinz History Center –\n10:00 AM\n\n### [Haunted History Center Halloween](https://www.heinzhistorycenter.org/event/haunted-history-center-halloween/)\n\nStep inside the History Center for a spooktacular day of tricks, treats, and ghoulishly grand fun!\n\nTickets Required\n\n[View All Events](https://www.heinzhistorycenter.org/events/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.179511", "metadata": {"original_content_length": 7626, "cleaned_content_length": 6034, "word_count": 580, "char_count": 6034, "description": "The Senator John Heinz History Center is located in Pittsburgh’s historic Strip District, home to a wide variety of restaurants and shops. Open daily from 10 a.m. to 5 p.m.", "event_time": "10 a.m."}}
{"url": "https://www.heinzhistorycenter.org/visit/meadowcroft/", "title": "Meadowcroft Rockshelter and Historic Village - Heinz History Center", "content": "meadowcroft\\_web\\_hero (1080p).mp4 from Heinz History Center on Vimeo\n\nPlaying in picture-in-picture\n\nPause\n\nPicture-in-Picture\n\nPlay VideoPause Video\n\n# 19,000 Years of History, All in One Day\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/visit/meadowcroft/#page_content)\n\nExplore This SectionClose\n\nTake your family on a day-long adventure at Meadowcroft Rockshelter and Historic Village, located in Avella, Washington County, Pa.\n\nA National Historic Landmark, Meadowcroft features a massive rock overhang – the Rockshelter – used 19,000 years ago for shelter by the region’s first inhabitants. Take a tour of this internationally-renowned archeological treasure and learn more about the lives of Western Pennsylvania’s prehistoric hunters and gatherers.\n\nAt Meadowcroft’s interpretive villages, you can step back in time to encounter rural life over the past 500 years. Explore a wigwam and test your aim with a spear thrower at the 16th-century Eastern Woodland Indian Village, experience an 18th-century log cabin and open-sided trading post, and watch a blacksmith forge red-hot iron or take a lesson in a one-room school house at the site’s 19th-century Historic Village.\n\n## Hours & Location\n\n- Address: 401 Meadowcroft Road, Avella, PA 15312, in the town of Avella in Washington County, Pa., about a one-hour drive from downtown Pittsburgh\n- Hours: Open seasonally from May through November 23\n\n[DRIVING DIRECTIONS](https://www.heinzhistorycenter.org/visit/meadowcroft/directions-parking/)\n\n## Admission\n\n## Daily Tours\n\nDuring Meadowcroft’s season, tours of the Rockshelter are offered daily and last approximately one hour. Times vary. Please check in at the Visitor Center to sign up for a Rockshelter tour, or call 724-587-3412 for more information.\n\n## Learn More About Meadowcroft\n\nMeadowcroft Rockshelter, the oldest site of human habitation in North America, provides a unique glimpse into the lives of prehistoric hunters and gatherers. This National Historic Landmark, located in Avella, Washington County, Pa., features a massive rock overhang used 19,000 years ago for shelter by the first people in North America. The enclosure at Meadowcroft Rockshelter provides visitors with a unique, never-before-seen perspective into the oldest and deepest parts of this internationally-renowned archeological excavation.\n\nIn addition to ancient history at the Rockshelter, visitors to Meadowcroft can also step back in time to experience rural life over the past 500 years through a series of interpretive villages, including a 16th century Eastern Woodland Indian Village, an 18th century log cabin and open-sided trading post, and a 19th century village that includes a church, one-room schoolhouse, and blacksmith shop.\n\n**Bring a picnic lunch, relax, and enjoy Meadowcroft’s beautiful rural setting for the afternoon. Plan to spend at least three hours if you want to see all that Meadowcroft has to offer.**\n\n**_Thank you to the Observer-Reporter for being Meadowcroft’s media sponsor._**\n\n## What's On at Meadowcroft?\n\nExhibits & Events\n\nMeadowcroft Rockshelter and Historic Village\n\nLearn more about Meadowcroft’s upcoming public programs and everyday offerings.\n\n[What's On](https://www.heinzhistorycenter.org/whats-on/meadowcroft/)\n\n- October 5\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Walk in Penn’s Woods](https://www.heinzhistorycenter.org/event/walk-in-penns-woods-2025/)\n\nTake a walk in Penn’s Woods with Meadowcroft.\n\n- October 18\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Archaeology Day](https://www.heinzhistorycenter.org/event/archaeology-day-2025/)\n\nDig into the past at Meadowcroft’s Archaeology Day!\n\n- November 22\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Meadowcroft’s Taffy Pull & Fall Celebration](https://www.heinzhistorycenter.org/event/meadowcrofts-taffy-pull-fall-celebration-2025/)\n\nWrap up the season with a sweet celebration at Meadowcroft!\n\n[View All Events](https://www.heinzhistorycenter.org/events/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.179511", "metadata": {"original_content_length": 6411, "cleaned_content_length": 4025, "word_count": 531, "char_count": 4025, "description": "Take your family on a day-long adventure at Meadowcroft Rockshelter and Historic Village, located in Avella, Washington County, Pa."}}
{"url": "https://www.heinzhistorycenter.org/visit/health-safety/", "title": "Health & Safety - Heinz History Center", "content": "# Health & Safety \\| Response to COVID-19\n\n## Health & Safety Policies\n\nOur museums have implemented extensive health and sanitation measures to ensure a safe and enjoyable experience for visitors and staff:\n\n- In accordance with guidelines set by the [Centers for Disease Control and Prevention](https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/about-face-coverings.html) (CDC) and the Pennsylvania Department of Health, masks are optional at the Heinz History Center, Fort Pitt Museum, and Meadowcroft Rockshelter and Historic Village.\n- The History Center utilizes high-efficiency MERV-13 filters that screen out airborne particulates down to 0.3 microns in diameter. Our filter systems, which rival hospital-grade systems, capture 99.97% of airborne particulates, well above the level of an N-95 mask, and supply an air change rate (ACR) of 8.5 per hour, or approximately once every seven minutes.\n- Daily capacity will continue to be monitored to ensure visitor safety.\n- Sanitation supplies, such as disinfecting wipes, Kleenex, hand sanitizer, etc. are readily available for added use by patrons and placed throughout the museums.\n- Contactless payment methods, such as Apple Pay and Google Wallet, are available for visitor use at the Admissions Desk and our Museum Shop.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.179511", "metadata": {"original_content_length": 1543, "cleaned_content_length": 1293, "word_count": 187, "char_count": 1293, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/give/", "title": "Join & Give - Heinz History Center", "content": "# Let's Make History Together\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/give/#page_content)\n\nExplore This SectionClose\n\nVisitors can help sustain the legacy of the History Center in a variety of ways.\n\n## Fundraising Events\n\nCelebrate the ‘can do’ spirit and rich history of the Pittsburgh region by attending an annual History Center fundraising event.\n\n[Learn More](https://www.heinzhistorycenter.org/give/fundraising-events/)\n\n## Commemorative Gifts\n\nPreserve your memories and celebrate loved ones by purchasing a lasting gift inside the History Center. From time capsules and personalized floor tiles to rocking chairs and commemorative sports items, the museum can help preserve your own piece of history for generations to come.\n\n[Purchase Your Historic Gift](https://www.heinzhistorycenter.org/donate/commemorative-gifts/)\n\n## Planned Giving\n\nIncluding the History Center in your estate planning directly supports the museum’s mission while providing tax benefits for you and your benefactors. A wide variety of planned giving options are available, including charitable trusts and bequests.\n\n[Explore Options](https://www.heinzhistorycenter.org/donate/planned-giving/)\n\n## Artifact Donations\n\nThe Heinz History Center actively seeks artifacts and archival materials related to the history of Western Pennsylvania and the experiences of its people, both past and present. If you have an object, photo, or other archival material that you think is of historic significance, we want to hear from you!\n\n[Donate an Artifact](https://www.heinzhistorycenter.org/research/contribute-to-our-collections/)\n\n* * *\n\nCan your employer match your gift? You can double or triple your gift if you or your spouse work for an organization that matches charitable contributions to the History Center. Please contact your organization’s human resources department for their matching gift policy.\n\nYou can also make a donation by contacting Lauren Meals at 412-454-6351 or lameals@heinzhistorycenter.org.\n\n_Please note that the Senator John Heinz History Center’s IRS legal name is the Historical Society of Western Pennsylvania._", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.184498", "metadata": {"original_content_length": 3956, "cleaned_content_length": 2134, "word_count": 277, "char_count": 2134, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/give/make-a-donation/", "title": "Make a Donation - Heinz History Center", "content": "# Make a Donation\n\nHelp us celebrate the ‘can do’ spirit and rich history of the Pittsburgh region by making a contribution to the History Center.\n\n## Every Gift Counts\n\nYour donation directly supports the History Center’s exhibitions, public programs, educational outreach, and publications, as well as the world’s top collection of historic artifacts and archival materials dedicated to Western Pennsylvania.\n\n[Donate Now](https://heinzhistorycenter.humanitru.com/donate?page=donation-page-4695dfe9-0788-45f0-a1ed-25d498585491&amount=100&options=1000%2C500%2C250%2C100%2C50%2C20&tribute=true&address=required&locale=en)\n\n## Donor Privacy Policy\n\nThe Senator John Heinz History Center will not share or sell a donor’s personal information with any entity, nor send donor mailings on behalf of other organizations.\n\n* * *\n\nThe History Center recently earned the coveted **4-star rating** from Charity Navigator for sound fiscal management and commitment to accountability and transparency, so you can be confident that your donation is going to a great place.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.184498", "metadata": {"original_content_length": 1862, "cleaned_content_length": 1059, "word_count": 133, "char_count": 1059, "description": "Help us celebrate the 'can do' spirit and rich history of the Pittsburgh region by making a contribution to the History Center."}}
{"url": "https://www.heinzhistorycenter.org/whats-on/fort-pitt/", "title": "Fort Pitt Museum - Heinz History Center", "content": "Exhibit\n\nFort Pitt Museum\n\n# Homelands: Native Nations of Allegheny\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/fort-pitt/exhibits/homelands-native-nations-of-allegheny/)\n\n## Fort Pitt Museum\n\nStep back in time to Pittsburgh’s birthplace at the Fort Pitt Museum. Open daily 10 a.m. to 5 p.m.\n\n[Plan Your Visit](https://www.heinzhistorycenter.org/visit/fort-pitt/)\n\n## Across\n\nExhibit\n\nFort Pitt Museum\n\nThis spring, the Fort Pitt Museum will open Across, a powerful new exhibition featuring the photography of Seneca artist DJ Huff.\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/fort-pitt/exhibits/across/)\n\n## Diorama & Trader's Cabin\n\nExhibit\n\nFort Pitt Museum\n\nStep back in time to the 18th century frontier and discover what life was like for the earliest residents of the region.\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/fort-pitt/exhibits/diorama-traders-cabin/)\n\n## Fort Pitt: Keystone of the Frontier\n\nExhibit\n\nFort Pitt Museum\n\nDiscover the pivotal role of our region in the French & Indian War, American Revolution, and Early Republic.\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/fort-pitt/exhibits/fort-pitt-keystone-of-the-frontier/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.184498", "metadata": {"original_content_length": 2039, "cleaned_content_length": 1229, "word_count": 134, "char_count": 1229, "description": "Step back in time to Pittsburgh’s birthplace at the Fort Pitt Museum. Open daily 10 a.m. to 5 p.m.", "event_time": "10 a.m."}}
{"url": "https://www.heinzhistorycenter.org/join/", "title": "Become a Member - Heinz History Center", "content": "# Become a Member\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/join/#page_content)\n\nExplore This SectionClose\n\n## Join the Ranks of History!\n\nBe a part of history and become a History Center member today!\n\n[Buy Your Membership](https://my.heinzhistorycenter.org/membership/558/join)\n\n[Renew Your Membership](https://my.heinzhistorycenter.org/auth/558/members?ref=https:%2F%2Fmy.heinzhistorycenter.org%2Fmembership%2F558%2Fprofile)\n\n[Buy a Gift Membership](https://my.heinzhistorycenter.org/membership/558/join)\n\nJoin the Smithsonian’s home in Pittsburgh today and get exclusive member perks and unlimited admission to four dynamic museums: the [Heinz History Center](https://www.heinzhistorycenter.org/visit/heinz-history-center/), [Western Pennsylvania Sports Museum](https://www.heinzhistorycenter.org/visit/sports-museum/ \"Western Pennsylvania Sports Museum\"), [Meadowcroft Rockshelter and Historic Village](https://www.heinzhistorycenter.org/visit/meadowcroft/ \"Meadowcroft Rockshelter and Historic Village\"), and the [Fort Pitt Museum](https://www.heinzhistorycenter.org/visit/fort-pitt/ \"Fort Pitt Museum\").\n\nBonus! You’ll also become a member of the Smithsonian Institution, receiving the popular Smithsonian magazine, members-only discounts, and more.\n\n## Exciting Members-Only Perks\n\nWhen you become a member, you receive these benefits at all levels:\n\n- **Free, unlimited admission** to the History Center, the Western Pennsylvania Sports Museum, Meadowcroft Rockshelter and Historic Village, and the Fort Pitt Museum.\n- **All memberships include free admission for children 17 and under.**\n- **Invitations to special members-only events** including exhibition previews, private tours, and more.\n- **Subscription to Western Pennsylvania History quarterly magazine**.\n- **Subscription to Making History quarterly newsletter.**\n- **10% discount on all purchases in the History Center Museum Shop.**\n- **10% discount in the Café at the History Center.**\n- **Discounts on public programs, tours, Detre Library & Archives services, and more.**\n\nWhen you become a History Center member, you also become a member of the Smithsonian Institution and receive these fantastic benefits:\n\n- **Subscription to Smithsonian monthly magazine.**\n- **Discounts in select Smithsonian shops and dining facilities.**\n- **Free admission to the Cooper Hewitt, Smithsonian Design Museum in New York City.** (The Smithsonian Museums in Washington, DC are free to the public.)\n- **Reciprocal admission and discounts at participating [Smithsonian Affiliate museums](https://affiliations.si.edu/affiliate-benefits/membership/affiliate-reciprocal-membership/).**\n- **…and more!**\n\n## We need your help to preserve our history.\n\nMembers play an essential role in the success of the History Center’s mission and make it possible for the History Center to:\n\n- Present award-winning exhibitions and public programs that engage visitors of all ages.\n- Provide educational resources for students and teachers, including National History Day, educator workshops and school field trips that reach more than 35,000 students each year.\n- Preserve hundreds of thousands of historic artifacts and archival collections for future generations to enjoy.\n\nFor questions, additional information, or details on how to purchase a History Center membership as a gift, please contact the Advancement team at [membership@heinzhistorycenter.org](mailto:membership@heinzhistorycenter.org).\n\n## Memberships Levels\n\n\\\\* _A portion of your membership purchase may be tax deductible, above and beyond the $60 value of tangible goods and services received. We always recommend you consult your own tax preparer._\n\nThe History Center recently received the coveted four-star rating from **Charity Navigator** for sound fiscal management and commitment to accountability and transparency. That means you can give with confidence—knowing your donation is making a meaningful impact in preserving and sharing our region’s history.\n\n* * *\n\n[Buy or Renew Membership](https://my.heinzhistorycenter.org/membership/558/join)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.189533", "metadata": {"original_content_length": 5103, "cleaned_content_length": 4078, "word_count": 488, "char_count": 4078, "description": "Be a part of history and become a History Center member today!"}}
{"url": "https://www.heinzhistorycenter.org/visit/heinz-history-center/", "title": "Heinz History Center - Heinz History Center", "content": "# Welcome to Our Neighborhood\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/visit/heinz-history-center/#page_content)\n\nExplore This SectionClose\n\nAs Pittsburgh’s “people museum,” the History Center preserves and interprets the history of Western Pennsylvanians through six floors of interactive exhibitions that feature iconic artifacts like the TV set from “Mister Rogers’ Neighborhood” and the world’s oldest jeep. The Western Pennsylvania Sports Museum is located on the second and third floors of the History Center.\n\n[buy tickets](https://my.heinzhistorycenter.org/orders/558/calendar?cart=true&eventId=64babd55351d6b414477592b&membershipIds=)\n\n## Hours & Location\n\n- Address: **1212 Smallman St, Pittsburgh, PA 15222** in the heart of Pittsburgh’s historic Strip District\n- Hours: Daily from **10 a.m. to 5 p.m.** for the History Center and Sports Museum\n- Holiday Closures: New Year’s Day, Easter, Thanksgiving, and Christmas.\n- The Detre Library & Archives (6th Floor) operates on [special hours that you can review here](https://www.heinzhistorycenter.org/research/detre-library-archives/).\n\n### **Always Free for Kids!**\n\nThanks to a transformative gift from longtime supporters Daniel G. and Carole L. Kamin, the Heinz History Center now offers free admission for all kids year-round! The [Kamin “Free for Kids” Initiative](https://www.heinzhistorycenter.org/families/kamin-family-legacy/) includes free museum entry for all children aged 17 and under and cover admission costs for all school groups.\n\n## Admission\n\n### **America’s \\#1 History Museum**\n\nThe History Center was voted the #1 History Museum in America by USA Today in 2024 and 2025 as part of its annual [Readers’ Choice Awards](https://10best.usatoday.com/awards/travel/best-history-museum-2024/).\n\n### **Visit with RAD Pass**\n\nWe’re proud to be part of RAD Pass, a free and discounted ticket program from Allegheny Regional Asset District (RAD) that makes it easier than ever to explore more of Pittsburgh’s most beloved arts and entertainment destinations – including the Heinz History Center!\n\nPre-registration is required through the [RAD Pass website](https://radpass.org/) with a valid Allegheny County Library Card. RAD passes are not offered in-person.\n\n## What's On at the History Center?\n\nExhibits & Events\n\nHeinz History Center\n\nGet the inside scoop on featured exhibits and events at the museum.\n\n[What's On](https://www.heinzhistorycenter.org/whats-on/history-center)\n\n## Preserving Pittsburgh’s Memories\n\nDetre Library & Archives\n\nHeinz History Center\n\nResearch family history, explore historic images, and search thousands of documents in the Detre Library & Archives at the History Center. Open Wednesday through Saturday and free to all visitors.\n\n[Detre Library & Archives](https://www.heinzhistorycenter.org/research/detre-library-archives/)\n\n## Kids & Families\n\nThe History Center is fun for everyone! Learn more about the museum’s family-friendly exhibits, activities, and amenities.\n\n[Discover More](https://www.heinzhistorycenter.org/families/)\n\n## The Museum Shop\n\nThe History Center Museum Shop is your one-stop shop for all things Pittsburgh. From Heinz 57 to “Mister Rogers’ Neighborhood,” browse hundreds of one-of-a-kind gifts ranging from classic to quirky. The Museum Shop is open seven days a week during regular museum hours, and always open online.\n\n[Explore the Shop](https://shop.heinzhistorycenter.org/)\n\n## The Café at the History Center\n\nOpen daily during museum hours, the Café at the History Center offers a wide array of grab-and-go items including fresh wraps, salads, sandwiches, and kid-friendly options from Common Plea Catering.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.189533", "metadata": {"original_content_length": 6156, "cleaned_content_length": 3663, "word_count": 475, "char_count": 3663, "description": "As Pittsburgh’s “people museum,” the History Center preserves and interprets the history of Western Pennsylvanians through six floors of interactive exhibitions that feature iconic artifacts like the TV set from “Mister Rogers’ Neighborhood” and the world’s oldest jeep. The Western Pennsylvania Sports Museum is located on the second and third floors of the History Center.", "event_time": "10 a.m."}}
{"url": "https://www.heinzhistorycenter.org/join/frequently-asked-questions/", "title": "Frequently Asked Questions - Heinz History Center", "content": "# Frequently Asked Questions\n\n## How can I join or renew my History Center membership?\n\nThere are several ways you can purchase or renew your membership:\n\n- In person at our Admissions Desk or Museum Shop\n- [Online](https://www.heinzhistorycenter.org/join \"Join\")\n- By mail at: Membership, Senator John Heinz History Center, 1212 Smallman Street, Pittsburgh, PA 15222\n- Call us at 412-454-6436\n\n## What does my membership include?\n\nInformation about specific membership levels and benefits can be located [here](https://www.heinzhistorycenter.org/join/ \"Membership Types\").\n\n## How long does my History Center membership last?\n\nMemberships benefits begin immediately and last through the end of the month of purchase the following year.\n\n## How long does it take to receive my History Center membership packet?\n\nMembership fulfillment usually takes 10-15 business days. If you do not receive your History Center membership packet within this timeframe, please let us know and we will be happy to assist you.\n\n## Can I upgrade my History Center membership to a higher level?\n\nYou can always upgrade your membership to meet your needs. Please contact us at 412-454-6351 or [membership@heinzhistorycenter.org](mailto:membership@heinzhistorycenter.org).\n\n## Can I visit other museums with my History Center membership?\n\nYes! Your History Center membership also includes free, unlimited admission to the [Western Pennsylvania Sports Museum](https://www.heinzhistorycenter.org/sports), [Fort Pitt Museum,](https://www.heinzhistorycenter.org/fort-pitt) and [Meadowcroft Rockshelter and Historic Village](https://www.heinzhistorycenter.org/meadowcroft).\n\nThe Senator John Heinz History Center is also a [Smithsonian Institution Affiliate](http://affiliations.si.edu/) which means that a Smithsonian membership is included with your History Center membership.\n\nThis benefit entitles you to a year’s subscription to _Smithsonian_ magazine, discounts at Smithsonian shops and select dining facilities, and free admission to the Cooper-Hewitt, National Design Museum in New York City (other Smithsonian museums are free for everyone).\n\n## I am a Smithsonian Institution member. Do I receive free or discounted admission to the History Center?\n\nNot currently, but you can receive free admission by becoming a History Center member. All History Center members receive a Smithsonian membership, as well, with access to the benefits described in the question above.\n\nFor more information on our Smithsonian Institution partnership and a directory of Affiliate institutions, please visit [affiliations.si.edu](https://affiliations.si.edu/)\n\n## Can I use my membership for a group tour, field trip, or 21+ nights?\n\nFree membership admission does not apply to group visits or special programs such as 21+ nights due to additional programming and expenses related to these visits.\n\n[All K-12 student groups can visit the museum for field trips free of charge](https://www.heinzhistorycenter.org/learn/education/history-center-field-trips/).\n\n## Is my contact or financial information shared with other organizations or vendors?\n\nPlease refer to our [Privacy Statement](https://www.heinzhistorycenter.org/policies/ \"Financial & Privacy Information\") “Disclosure of Personal Information” section.\n\n## Is it safe to use my credit card to purchase a membership on your e-store?\n\nThe Senator John Heinz History Center contracts with professional payment processing software services that utilize modern software security and encryption technologies to process all transactions. These software providers are required to complete regular compliance certifications to attest to the use of best practices for credit card processing.\n\n## Is my History Center membership tax-deductible?\n\nA portion of your membership is not tax-deductible because of the value of member benefits received. If you wish to receive full tax-deductibility for your gift or have further questions or concerns, please contact us at 412-454-6351 or [membership@heinzhistorycenter.org](mailto:membership@heinzhistorycenter.org).\n\n## I do not want my History Center membership any longer. Can I get a refund?\n\nThe History Center is unable to offer refunds on memberships after 24 hrs of purchasing. If, however, a financial mistake has been made while processing your membership please let us know and we will work to correct and refund our error.\n\n## If I join in person at the History Center, can my admission fees be applied toward a membership?\n\nYes, the cost of your same-day, full-price, admissions transaction can be applied towards a new membership. Any customer service associate at our Admissions Desk or Museum Shop can assist you.\n\n## I recently moved and need to change the information on my membership. How do I do this?\n\nPlease use [**this form**](https://www.heinzhistorycenter.org/join/frequently-asked-questions/members-change-of-information/) or email us at [membership@heinzhistorycenter.org](mailto:membership@heinzhistorycenter.org) to change or update the mailing address, email address, or phone number associated with your History Center membership.\n\n## I am a History Center member, and my employer will match some or all of my charitable contributions. Where can I obtain a matching gift form?\n\nMatching gifts are a great way to double – or sometimes even triple – your gift! Please check with your employer’s human resources department to obtain a matching gift form. Simply complete your form and send it to us at the address below and we will coordinate the rest of the process for you:\n\nSenator John Heinz History Center\nAttention: Angela Gaitaniella, Director of Institutional Giving\n1212 Smallman Street\nPittsburgh, PA 15222", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.194718", "metadata": {"original_content_length": 5700, "cleaned_content_length": 5700, "word_count": 790, "char_count": 5700, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/families/", "title": "Kids & Families - Heinz History Center", "content": "Kamin \"Free for Kids\" Initiative from Heinz History Center on Vimeo\n\nPlaying in picture-in-picture\n\nPause\n\nSettings\n\nSpeedNormal\n\nPicture-in-Picture\n\nPlay VideoPause Video\n\n# Kids & Families\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/families/#page_content)\n\nExplore This SectionClose\n\nThrough support from the **Kamin “Free for Kids” Initiative**, admission is **free for all** **children ages 17 and under** to the Heinz History Center, Western Pennsylvania Sports Museum, and Fort Pitt Museum every day, all year long!\n\n[reserve tickets](https://my.heinzhistorycenter.org/orders/558/calendar?cart=true&eventId=64babd55351d6b414477592b&membershipIds=)\n\n## The Kamin Family Legacy\n\nIn June 2025, longtime supporters Daniel G. and Carole L. Kamin made a transformative $11.5 million gift to ensure free year-round admission for kids.\n\n[Learn More](https://www.heinzhistorycenter.org/families/honoring-the-kamins/)\n\n## Family Fun for Everyone\n\nFrom our two-story “Liberty Tubes” slide to the original sets and puppets from “Mister Rogers’ Neighborhood,” the History Center is the perfect Pittsburgh place to explore with your family.\n\n### Discovery Place\n\nExplore Pittsburgh innovations and learn about the inventing process in _**Discovery Place**_, a kid-friendly zone where creativity, science, and history merge!\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/discovery-place/)\n\n### Kidsburgh\n\nServe up Isaly’s ice cream at the play soda fountain, milk a full-scale mooing cow, and zoom down a spiral slide, in _**Kidsburgh**_— our interactive play place for the history makers of tomorrow!\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/kidsburgh/)\n\n### Heinz\n\nSee a giant ketchup bottle, watch vintage Heinz ads, and explore hands-on displays that bring more than 150 years of dill-lightful history to life. A must-see for kids who love ketchup!\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/heinz/)\n\n### Mister Rogers' Neighborhood\n\nStep into Mister Rogers’ Neighborhood and see the largest collection of original items from the beloved show—including King Friday’s Castle, the Great Oak Tree, and the familiar set where Mister Rogers began every episode.\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/mr-rogers-neighborhood/)\n\n### Western Pennsylvania Sports Museum\n\nGo on an epic journey through the City of Champions, from the almost-forgotten tales of Pittsburgh Olympians to the stories of Western Pa. legends like Franco, Swin, Mario, and Roberto.\n\n[Explore the Museum](https://www.heinzhistorycenter.org/whats-on/sports-museum/)\n\n## Family-Friendly Amenities\n\n- Kid-friendly snacks and refreshments can be purchased in the History Center Café, located on the first floor.\n- Strollers and diaper bags are permitted within the museum.\n- Baby-changing stations can be found in restrooms on the first and third floors and in the fifth floor Mueller Education Center.\n- Visitors are welcome to nurse anywhere they feel comfortable. A private nursing room is located on the sixth floor.\n- All exhibition floors are accessible via elevator.\n- Water fountains can be found on the first, second, and third floors and in the fifth floor Mueller Education Center.\n\n## Kids & Families Events\n\n[View All Events](https://www.heinzhistorycenter.org/events/)\n\n- October 26\n\nHeinz History Center –\n10:00 AM\n\n### [Haunted History Center Halloween](https://www.heinzhistorycenter.org/event/haunted-history-center-halloween/)\n\nStep inside the History Center for a spooktacular day of tricks, treats, and ghoulishly grand fun!\n\nTickets Required\n\n[View All Events](https://www.heinzhistorycenter.org/events/)\n\n## Get to the Point of Pittsburgh History\n\nFort Pitt Museum\n\nKids can step back in time and discover the world-shaping events that occurred right here in Pittsburgh for free at the Fort Pitt Museum!\n\n[Plan Your Visit](https://www.heinzhistorycenter.org/visit/fort-pitt/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.194718", "metadata": {"original_content_length": 6868, "cleaned_content_length": 4064, "word_count": 498, "char_count": 4064, "description": "Thanks to the Kamin “Free for Kids” Initiative, admission to the Heinz History Center, Western Pennsylvania Sports Museum, and Fort Pitt Museum is free for all children ages 17 and under—every day, all year long!"}}
{"url": "https://www.heinzhistorycenter.org/whats-on/exhibits/", "title": "Exhibits - Heinz History Center", "content": "# Exhibits\n\n## Heinz History Center\n\nExplore exhibits that cover over 250 years of Pittsburgh history at the History Center.\n\n[Browse Exhibits](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/)\n\n## Western Pennsylvania Sports Museum\n\nLearn how Pittsburgh became the City of Champions through exhibits at the Sports Museum.\n\n[Browse Exhibits](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/)\n\n## Fort Pitt Museum\n\nDiscover the world-shaping events that occurred in Western Pennsylvania through exhibits at the Fort Pitt Museum.\n\n[Browse Exhibits](https://www.heinzhistorycenter.org/whats-on/fort-pitt)\n\n## Meadowcroft Rockshelter & Historic Village\n\nCheck out 19,000 years of Western Pennsylvania history through exhibits at Meadowcroft Rockshelter and Historic Village.\n\n[Browse Exhibits](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/)\n\n## Past Exhibits\n\nLearn more about the History Center’s past exhibits, like _**We Can Do It! WWII**_, _**Destination Moon**_, _**1968**_, and more.\n\n[Browse Exhibits](https://www.heinzhistorycenter.org/whats-on/exhibits/past-exhibits/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.194718", "metadata": {"original_content_length": 2586, "cleaned_content_length": 1132, "word_count": 113, "char_count": 1132, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/families/kamin-family-legacy/", "title": "The Kamin Family Legacy - Heinz History Center", "content": "# Inspiring Future Generations: Kamin “Free for Kids” Initiative\n\nDaniel G. and Carole L. Kamin have long been passionate about the preservation of Western Pennsylvania’s history and culture, supporting the Heinz History Center as members and contributors for decades.\n\nIn June 2025, the Kamins made a transformative $11.5 million gift to the museum, ensuring kids receive free admission year-round to the History Center, Western Pennsylvania Sports Museum, and Fort Pitt Museum.\n\nThe Kamin “Free for Kids” Initiative includes free museum entry for all children aged 17 and under and covers admission costs for [all K-12 school groups](https://www.heinzhistorycenter.org/learn/education/history-center-field-trips/).\n\n“Learning and understanding our history has never been more critical. We are proud to support the Heinz History Center and its important mission,” said Carole Kamin. “Dan and I hope this gift helps to eliminate one barrier for families and schools alike, so they can explore our region’s rich heritage and be inspired to make a difference.”\n\n## About the Kamin Family\n\nThe Kamin Family Foundation is the result of a journey that began with a family-owned business and evolved into becoming the 38th largest developer in the nation, with properties spanning 45 states and totaling nearly 17 million square feet.\n\nThe visionary leadership of Daniel Kamin, a Shady Side Academy graduate who earned a B.A. in history from the University of Pennsylvania, transformed the real estate landscape and elevated the family’s legacy to national prominence. Dan’s passion for science and history serves as the cornerstone of his philanthropic vision.\n\nCarole Kamin is heavily involved with local charities as a community volunteer, serving as president of the Ladies Hospital Aid Society at UPMC Montefiore hospital and on the History Center Board of Trustees as well as other numerous boards in the region. She was recently honored by the Pittsburgh Business Times as a 2025 Woman of Influence.\n\nThe family’s commitment to community service and involvement in esteemed organizations underscore the foundation’s dedication to the sciences, education, history, arts, medical, and environmental sectors. The Kamin Family Foundation stands as a testament to their enduring legacy, poised to make a meaningful difference in the Greater Pittsburgh Area and beyond for generations.\n\n## Photo Gallery\n\n## Photo Gallery\n\nDaniel G. and Carole L. Kamin with students from St. Therese School.\n\n## Photo Gallery\n\nThe Kamins with Andy Masich, History Center President and CEO, and Tonia Rose, Executive Vice President\n\n## Photo Gallery\n\nStudents with Kids Free friendship bracelets.\n\n## Photo Gallery\n\nKamin “Free for Kids” Initiative press conference at the Heinz History Center on June 3, 2025.\n\nPreviousNext\n\n1234", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.194718", "metadata": {"original_content_length": 4213, "cleaned_content_length": 2808, "word_count": 423, "char_count": 2808, "description": "In June 2025, longtime supporters Daniel G. and Carole L. Kamin made a transformative $11.5 million gift to ensure free year-round admission for kids."}}
{"url": "https://www.heinzhistorycenter.org/about/", "title": "About - Heinz History Center", "content": "# About the Heinz History Center\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/about/#page_content)\n\nExplore This SectionClose\n\nThe Senator John Heinz History Center is Pennsylvania’s largest history museum and a proud affiliate of the [Smithsonian Institution](https://www.heinzhistorycenter.org/about/the-smithsonians-home-in-pittsburgh/). Devoted to the history and heritage of Western Pennsylvania, our family of museums includes the Heinz History Center, Western Pennsylvania Sports Museum, Fort Pitt Museum, and Meadowcroft Rockshelter and Historic Village. The History Center is home to the Thomas & Katherine Detre Library & Archives.\n\nOur mission is to engage and inspire large and diverse audiences through programs that enable links to the past, understanding in the present, and guidance for the future by preserving regional history and presenting the American experience with a Western Pennsylvania connection.\n\nThis work is accomplished in partnership with others through archaeology, archives, artifact collections, broadcast and electronic media, civic engagement, conservation, educational programs, exhibitions, events, library, museums, public outreach, performance, preservation, publications, products, research, technical assistance, and virtual programs.\n\n## Our Story\n\nThe Senator John Heinz History Center traces its roots back to 1879, making it the oldest cultural institution in Western Pennsylvania.\n\nIn 1879, the Old Residents of Pittsburgh and Western Pennsylvania established a historical society to help preserve local history. Five years later, the name changed to the Historical Society of Western Pennsylvania and has been in continuous existence for more than 135 years.\n\nOriginally, membership in the historical society was limited to men who had lived in the region for 50 years or more, though the rules changed within a few years to include women and younger people. In those days, members enjoyed lectures and country outings and got together to reminisce. Perhaps most importantly, early Historical Society members worked to preserve archival materials and objects of historic significance, forming the foundation of the History Center’s collections.\n\nThe Historical Society brought our region’s history to the public. In 1908, it celebrated the region’s 150th anniversary; in 1911, the centennial of steamboat navigation; in 1958, the region’s bicentennial celebration; and in 2008, the region’s 250th anniversary. These events served as the basis for the many events, publications, educational programs, and exhibitions that the History Center offers today.\n\nEarly meetings of the Historical Society were held in members’ homes and churches, though a significant step was taken in 1893 when the Carnegie Library of Pittsburgh at Schenley Park offered space for the archives. In 1914, after securing the funding, the Historical Society built its own building on Bigelow Blvd. In 1996, the History Center moved into its current home in Pittsburgh’s Strip District.\n\nWith the opening of the Smithsonian wing in 2004, the History Center became the largest history museum in Pennsylvania. The new wing allows better opportunities found in our affiliation with the Smithsonian Institution. The additional space added the Western Pennsylvania Sports Museum, the Mueller Education Center, the Special Collections Gallery, and the McGuinn Gallery for traveling exhibitions.\n\nSince its opening, the Smithsonian wing has been home to various exhibitions, including Pennsylvania’s Civil War, Vatican Splendors, 1968: The Year that Rocked America, Pittsburgh’s Lost Steamboat: Treasures of the Arabia, We Can Do It! WWII, Toys of the ’50s, ’60s and ’70s, #Pixburgh: A Photographic Experience, Destination Moon: The Apollo 11 Mission.\n\nIn 2014, the History Center opened the new Museum Conservation Center, located directly behind the museum on Penn Avenue. The nine-story building houses the museum’s artifacts under one roof with Smithsonian-quality storage.\n\n## Heinz History Center\n\nAs Pittsburgh’s “people museum,” the History Center preserves and interprets the history of Western Pennsylvanians through six floors of interactive exhibitions that feature iconic artifacts like the TV set from “Mister Rogers’ Neighborhood” and the world’s oldest jeep.\n\n[Plan your visit](https://www.heinzhistorycenter.org/visit/heinz-history-center/)\n\n## Western Pennsylvania Sports Museum\n\nThe Western Pennsylvania Sports Museum, located on the History Center’s second and third floors, celebrates the unsurpassed sports legacy of the City of Champions. From football to baseball and hockey to golf, the Sports Museum highlights the region’s passion for amateur and professional sports.\n\n[Plan your visit](https://www.heinzhistorycenter.org/visit/sports-museum/)\n\n## Fort Pitt Museum\n\nThe Fort Pitt Museum, located in historic Point State Park in Downtown Pittsburgh, is a two-floor, 12,000-square-foot museum that presents the story of Western Pennsylvania’s essential role during the French & Indian War, the American Revolution, and as the birthplace of Pittsburgh.\n\n[Plan your visit](https://www.heinzhistorycenter.org/visit/fort-pitt/)\n\n## Meadowcroft Rockshelter and Historic Village\n\nMeadowcroft Rockshelter and Historic Village, the oldest site of human habitation in North America, is located in Avella, Washington County, Pa. Meadowcroft Rockshelter, a National Historic Landmark, features 19,000-year-old evidence of the region’s earliest inhabitants under a massive rock overhang. In addition to the Rockshelter, the site is also home to three outdoor historic areas, including a 16th century Indian village, 18th century Frontier Trading Post, and 19th century village that help visitors experience life over the past 500 years.\n\n[Plan your visit](https://www.heinzhistorycenter.org/visit/meadowcroft-rockshelter/)\n\n## Detre Library & Archives\n\nMore than 250 years of our region’s history can be found at the Thomas and Katherine Detre Library & Archives. Founded in 1879, the Library & Archives’ collections are accessible to researchers, students, and the general public.\n\n[Plan your visit](https://www.heinzhistorycenter.org/research/detre-library-archives/)\n\n## Financial Information\n\nThe History Center recently earned the coveted 4-star rating from Charity Navigator for sound fiscal management and commitment to accountability and transparency, so you can be confident that your donation is going to a great place.\n\n[Learn More](https://www.heinzhistorycenter.org/about/financial-information/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.199950", "metadata": {"original_content_length": 7903, "cleaned_content_length": 6548, "word_count": 884, "char_count": 6548, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/blog/david-mccullough-1933-2022/", "title": "David McCullough (1933-2022) - Heinz History Center", "content": "When he was young, David McCullough couldn’t decide if he would be a painter, an actor, an architect, or a writer. Eventually, he did it all. And he did it with a style and passion that engaged and inspired generations of Americans.\n\nGrowing up in Pittsburgh, his father nightly regaled David and his three brothers at the dinner table with stories of people and events that shaped the city. David distinctly recalled bursting his mashed potato dam to release the gravy that inundated the unsuspecting peas below while exclaiming, “it’s the Johnstown flood!”\n\nHe married Rosalee Barnes, who he had met as a teenager at a dance in Pittsburgh, and they began their lifelong partnership. David often pointed out that besides being the mother of their five children, Rosalee was “editor in chief and chairman of the ethics committee.” As a young journalist in Washington, he discovered at the Library of Congress a trove of dam disaster photographs, and in 1968 he published his first book, the highly acclaimed “Johnstown Flood.”\n\nIn 1972, he introduced American readers to “The Great Bridge” – the story of the Brooklyn Bridge and its builder, Western Pennsylvania’s Roebling family. He loved architecture and engineering, and I remember how joyful he was when in 2013 the city of Pittsburgh renamed its beautifully sculptured, historic landmark 16th Street Bridge over the Allegheny River the David McCullough Bridge.\n\n[![](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC_9884-1024x680.jpg)](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC_9884.jpg)\n\n\\[Image: David with his wife Rosalee McCullough (who passed away in June) at the dedication of the David McCullough Bridge.\\]\n\nIn 1977, David helped us discover the Panama Canal in “The Path Between the Seas,” the story of an American engineering triumph that still hasn’t seen its equal. As with most of his stories, there was a Pittsburgh connection, he proudly noted that the lock gates were forged in his hometown.\n\nIn 1981, he trotted out “Mornings on Horseback.” It’s still one of my favorite books, revealing in a very intimate way the life of young Theodore Roosevelt. “The Path between the Seas” and “Mornings on Horseback” earned David a growing following and two National Book Awards. With a growing family, he was not content to rest on his laurels, he kept on writing and filmmaking.\n\nHe lent his voice to public television’s “Smithsonian World” and “The American Experience.” His dulcet baritone and intuitive storyteller timing made Ken Burns’ “Civil War” documentary the amazing success it has become—even decades later.\n\nDavid inspired us with the stories found in his Brave Companions in 1991. Then came “Truman” in 1992 followed by “John Adams” (2001)—both Pulitzer Prize winners.\n\nIn 2005, he took on the American Revolution with his “1776.” David had long been intrigued by the revolutionary generation, perhaps inspired by the stories he heard as a youth here in Western Pennsylvania about young George Washington.\n\n[![](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DMcC.2011-1024x691.jpg)](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DMcC.2011.jpg)\n\n\\[Image: Headshot of David McCullough.\\]\n\nHe was perturbed by how much recent generations take for granted, and he was quick to point out that nothing is fore ordained—the fate of our republic hung by a thread in 1776, and today we have an obligation to ensure its survival. He often quoted Librarian of Congress, Daniel Boorstin, who said that “trying to plan for the future without a sense of the past is like trying to plant cut flowers.” David, would then add, “today we’re raising a lot of cut flowers and trying to plant them!”\n\nHe went to the White House to receive the nation’s highest civilian honor, the Presidential Medal of Freedom.\n\nIn 2011 David took us on “The Greater Journey: Americans in Paris,” which stayed on the New York Times best seller list longer than it took to build the Eiffel Tower.\n\nPittsburgh’s Heinz History Center enjoyed hosting David’s book launches, which inevitably packed the house. He always stayed late to personalize the books he signed for the adoring hometown crowd.\n\n[![](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC_0257-1024x680.jpg)](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC_0257.jpg)\n\n\\[Image: David and Andy at the Heinz History Center.\\]\n\nHis legion of loyal readers had followed David on his voyages on land and sea—but in 2017, he took to the sky. Not a flight of fancy, mind you, but the story of “The Wright Brothers” who, of course, came to Pittsburgh for a lightweight aluminum engine block that enabled them to get their flyer off the ground.\n\nIn 2019, David wrote his last book, “The Pioneers: The Heroic Story of the Settlers Who Brought the American Ideal West.”\n\nI once asked David, “when is the right time to retire?” He advised me that the secret to a long life is: “don’t ever retire.” He also pointed out that he wrote some of his best books, from “John Adams” to “The Pioneers,” after he had turned 65.\n\nHe also reminded me of how important it was to be a teacher. “Stop and think about those teachers who changed your life, maybe with a single sentence, maybe with one lecture, maybe by just taking an interest in your struggle.” He said, “our new heroes should be the teachers, those who share their knowledge and their passion to inspire us to achieve great things and build a better future.”\n\nDavid wrote in his book, “The American Spirit,” that, “history is a larger way of looking at life. It is a source of strength, of inspiration. It is about who we are and what we stand for and is essential to our understanding of what our own role should be in our time. History, as can’t be said too often, is human. It is about people, and they speak to us across the years.”\n\n“The lessons of history,” he would say, “are manifold. We are all part of a larger stream of events, past, present, and future. We are all beneficiaries of those who went before us…from history we learn that sooner is not necessarily better than later…that what we don’t know can often hurt us and badly…and that there is no such thing as a self-made man or woman.”\n\nDavid believed that Pittsburgh was the “essential” American city. “If you can understand Pittsburgh,” he would say, “you’ll understand the American experience.” He knew that art and artifacts, libraries and historic places, are important in our understanding of the past.\n\nHe believed in the Heinz History Center. In fact, he was one of its founders and principal architects. Our Smithsonian-affiliated History Center would not be here today had it not been for David McCullough. At the same time, he became a trusted friend and mentor to me.\n\n[![](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/David-McCullough-with-hard-hat-1024x708.jpg)](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/David-McCullough-with-hard-hat.jpg)\n\n\\[Image: David McCullough pictured here with a hard hat and blueprints during the construction of the Heinz History Center in 1995.\\]\n\nDavid impressed on me the importance of good storytelling. “Facts alone are never\n\nenough,” he said, “facts rarely if ever have any soul. In writing or trying to understand history one may have all manner of ‘data’ and miss the point. One can have all the facts and miss the truth. It can be like the old piano teacher’s lament to her student, ‘I hear all the notes, but I hear no music.’”\n\nDavid had a beautiful singing voice and was a gifted speaker. He lectured around the world in every conceivable venue, including the White House, and was one of only a few private citizens to ever speak before a joint session of Congress. Usually he spoke without notes, crafting a narrative that left audiences spellbound.\n\nNew generations still experience the more than one hundred films and documentaries he introduced or narrated. His books have been published in nineteen languages, and—as may be said of few writers—none of his books has ever been out of print.\n\nI assure you that David McCullough is with us still—in his books and films, in the museums and libraries he supported, in his children, grandchildren and great grandchildren, and in the hearts of those whose lives he touched.\n\nHe is here in spirit, and our work continues … and that, I can guarantee, is music to his ears.\n\nAndy Masich\n\nPresident & CEO\n\n[![](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/Andy-Masich-and-David-McCullough-80th-birthday-1024x680.jpg)](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/Andy-Masich-and-David-McCullough-80th-birthday.jpg)\n\n\\[Image: David McCullough celebrates his 80th birthday with Andy at the History Center in 2013.\\]\n\n# David McCullough (1933-2022)\n\nDateAugust 11, 2022\n\nAuthor\n\n- Andy Masich\n\nCategory\n\n- [From the Desk of Andy Masich](https://www.heinzhistorycenter.org/blog/?filters[category]=from-the-desk-of-andy-masich#filter_results)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.199950", "metadata": {"original_content_length": 9294, "cleaned_content_length": 9019, "word_count": 1361, "char_count": 9019, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/search/", "title": "Search - Heinz History Center", "content": "# Search Results\n\nCustom Search", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.199950", "metadata": {"original_content_length": 204, "cleaned_content_length": 31, "word_count": 5, "char_count": 31, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/whats-on/", "title": "What's On - Heinz History Center", "content": "## What's On\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/whats-on/#page_content)\n\nExplore This SectionClose\n\n## Event Calendar\n\nLearn more about upcoming programs and events at our family of museums.\n\n[Learn More](https://www.heinzhistorycenter.org/events/)\n\n## Exhibits\n\nSee a full list of the exhibitions currently on view across our family of museums.\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/exhibits/)\n\n## Heinz History Center\n\nExplore exhibits and events that cover over 250 years of Pittsburgh history at the History Center.\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/history-center/)\n\n## Western Pennsylvania Sports Museum\n\nLearn how Pittsburgh became the City of Champions through exhibits and events at the Sports Museum.\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/sports-museum/)\n\n## Fort Pitt Museum\n\nDiscover the world-shaping events that occurred in Western Pennsylvania through exhibits and events at the Fort Pitt Museum.\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/fort-pitt/)\n\n## Meadowcroft Rockshelter and Historic Village\n\nStay in the know about upcoming events and exhibits at Meadowcroft Rockshelter and Historic Village.\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/meadowcroft/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.204092", "metadata": {"original_content_length": 3745, "cleaned_content_length": 1291, "word_count": 137, "char_count": 1291, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/whats-on/meadowcroft/", "title": "Meadowcroft Rockshelter and Historic Village - Heinz History Center", "content": "Exhibit\n\nMeadowcroft Rockshelter and Historic Village\n\n# 19,000 Years of History\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/rockshelter/)\n\n## Meadowcroft Rockshelter and Historic Village\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/whats-on/meadowcroft/#page_content)\n\nExplore This SectionClose\n\nExperience what life was like for prehistoric Americans at Meadowcroft Rockshelter and Historic Village.\n\n[Plan Your Visit](https://www.heinzhistorycenter.org/visit/meadowcroft/)\n\n## Meadowcroft Rockshelter\n\nExhibit\n\nMeadowcroft Rockshelter and Historic Village\n\nDig into archaeological evidence that reveals the earliest signs of human habitation dating back 19,000 years.\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/rockshelter/)\n\n## Robert Barensfeld Center\n\nMeadowcroft Rockshelter and Historic Village\n\nBegin your prehistoric journey at the Robert Barensfeld Center, a welcoming new facility at Meadowcroft Rockshelter and Historic Village.\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/robert-barensfeld-center/)\n\n- ![A blacksmith stands at a workbench demonstrating metalworking in a dimly lit workshop. Several children stand in the foreground watching attentively. Various tools, equipment, and a forge are visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Meadowcroft-Blacksmith-300x200.jpg)\n\n## [Meadowcroft Historic Village](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/historic-village/)\n\nExperience everyday 19th century rural life in Meadowcroft’s carefully recreated Historic Village.\n\n- ![A group of children sit on wooden benches under a shelter constructed from branches and leaves, listening to an adult who is speaking. The scene takes place outdoors in a wooded area with sunlight shining through the trees.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/DSC6858-300x200.jpg)\n\n## [Prehistoric Indian Village](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/indian-village/)\n\nGo back 400 years and explore a recreated 16th century Monongahela Indian Village.\n\n- ![A woman in 18th-century historical clothing prepares food outdoors next to a rustic log cabin at Meadowcroft. Several cooking pots hang over an open fire ring, surrounded by trees and a grassy clearing beneath a partly cloudy sky.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC05865-300x200.jpg)\n\n## [Frontier Trading Post](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/frontier-trading-post/)\n\nTwo 1770s era structures help to spotlight the similarities and differences between European settlers and Eastern Woodland Indians.\n\n- ![Display of historic horse-drawn carriages and wagons inside a museum, featuring a red Concord Coach with “U.S. Mail” lettering, surrounded by informational signs and illuminated by dim lighting.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Trails-to-Trains-exhibit-300x200.jpg)\n\n## [Trails to Trains](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/trails-to-trains/)\n\nThe _**Trails to Trains**_ exhibit transports visitors through time, exploring the evolution of transportation in Southwestern Pennsylvania using five vehicles from the collection.\n\n- ![A blacksmith stands at a workbench demonstrating metalworking in a dimly lit workshop. Several children stand in the foreground watching attentively. Various tools, equipment, and a forge are visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Meadowcroft-Blacksmith-300x200.jpg)\n\n## [Meadowcroft Historic Village](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/historic-village/)\n\nExperience everyday 19th century rural life in Meadowcroft’s carefully recreated Historic Village.\n\n- ![A group of children sit on wooden benches under a shelter constructed from branches and leaves, listening to an adult who is speaking. The scene takes place outdoors in a wooded area with sunlight shining through the trees.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/DSC6858-300x200.jpg)\n\n## [Prehistoric Indian Village](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/indian-village/)\n\nGo back 400 years and explore a recreated 16th century Monongahela Indian Village.\n\n- ![A woman in 18th-century historical clothing prepares food outdoors next to a rustic log cabin at Meadowcroft. Several cooking pots hang over an open fire ring, surrounded by trees and a grassy clearing beneath a partly cloudy sky.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC05865-300x200.jpg)\n\n## [Frontier Trading Post](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/frontier-trading-post/)\n\nTwo 1770s era structures help to spotlight the similarities and differences between European settlers and Eastern Woodland Indians.\n\n- ![Display of historic horse-drawn carriages and wagons inside a museum, featuring a red Concord Coach with “U.S. Mail” lettering, surrounded by informational signs and illuminated by dim lighting.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Trails-to-Trains-exhibit-300x200.jpg)\n\n## [Trails to Trains](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/trails-to-trains/)\n\nThe _**Trails to Trains**_ exhibit transports visitors through time, exploring the evolution of transportation in Southwestern Pennsylvania using five vehicles from the collection.\n\n## Upcoming Events\n\n[View All Events](https://www.heinzhistorycenter.org/events/)\n\n- October 5\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Walk in Penn’s Woods](https://www.heinzhistorycenter.org/event/walk-in-penns-woods-2025/)\n\nTake a walk in Penn’s Woods with Meadowcroft.\n\n- October 18\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Archaeology Day](https://www.heinzhistorycenter.org/event/archaeology-day-2025/)\n\nDig into the past at Meadowcroft’s Archaeology Day!\n\n- November 22\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Meadowcroft’s Taffy Pull & Fall Celebration](https://www.heinzhistorycenter.org/event/meadowcrofts-taffy-pull-fall-celebration-2025/)\n\nWrap up the season with a sweet celebration at Meadowcroft!\n\n[View All Events](https://www.heinzhistorycenter.org/events/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.205808", "metadata": {"original_content_length": 8405, "cleaned_content_length": 6413, "word_count": 627, "char_count": 6413, "description": "Experience what life was like for prehistoric Americans at Meadowcroft Rockshelter and Historic Village."}}
{"url": "https://www.heinzhistorycenter.org/whats-on/meadowcroft/events/", "title": "Meadowcroft Events - Heinz History Center", "content": "# Meadowcroft Events\n\n- October 5\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Walk in Penn’s Woods](https://www.heinzhistorycenter.org/event/walk-in-penns-woods-2025/)\n\nTake a walk in Penn’s Woods with Meadowcroft.\n\n- October 18\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Archaeology Day](https://www.heinzhistorycenter.org/event/archaeology-day-2025/)\n\nDig into the past at Meadowcroft’s Archaeology Day!\n\n- November 22\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Meadowcroft’s Taffy Pull & Fall Celebration](https://www.heinzhistorycenter.org/event/meadowcrofts-taffy-pull-fall-celebration-2025/)\n\nWrap up the season with a sweet celebration at Meadowcroft!\n\n[View All Events](https://www.heinzhistorycenter.org/events/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.205808", "metadata": {"original_content_length": 1865, "cleaned_content_length": 780, "word_count": 80, "char_count": 780, "description": "", "event_time": "10:00 AM"}}
{"url": "https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/rockshelter/", "title": "Meadowcroft Rockshelter - Heinz History Center", "content": "# Meadowcroft Rockshelter\n\nDig into archaeological evidence that reveals the earliest signs of human habitation dating back 19,000 years.\n\nIf not for the curiosity of a Washington County, Pa., farmer six decades ago, Meadowcroft Rockshelter – the oldest site of human habitation in North America – might have never been discovered. In 1955, Albert Miller stumbled upon a groundhog hole on his family’s farm in Avella and uncovered what looked to be a prehistoric tool.\n\nMiller chose to cover up the hole and carefully search for a professional archeologist who could properly assess the historical significance of the site. Almost two decades later in 1973, Miller finally connected with University of Pittsburgh anthropology professor Dr. James Adovasio who visited the farm and looked at the object found near the groundhog hole.\n\nAstonished by the artifact, which was a prehistoric flint knife, Dr. Adovasio assembled a team of archaeology, anthropology and geology students to study the area as part of a curriculum. The field school’s excavation of the site over the next six years yielded nearly two million artifacts and ecofacts, including ancient stone tools, pottery fragments, and evidence of ice-age fire pits.\n\nFurther testing of the newly found artifacts concluded that the rock ledge overhang – naturally formed by the waters of Cross Creek – served as a campsite for prehistoric hunters and gatherers 19,000 years ago. Meadowcroft Rockshelter provided shelter for visitors with nearby fresh water springs and sources of plants and animals for food.\n\nIn 2005, the U.S. Secretary of the Interior designated Meadowcroft Rockshelter a National Historic Landmark.\n\nDiscover this important archeological treasure for yourself and visit Meadowcroft Rockshelter and Historic Village. Tours of the Rockshelter are available during regular operating hours and begin in the Meadowcroft visitor center.\n\n**During Meadowcroft’s open season, daily tours of the Rockshelter begin at the Visitors Center. Tour times vary and last approximately one hour.**\n\nFor information about scheduling and reservations, please contact Meadowcroft at 724-587-3412 or meadowcroftinfo@heinzhistorycenter.org.\n\n## Explore the Rockshelter\n\nVirtual Exhibit\n\nMeadowcroft Rockshelter and Historic Village\n\nThis GigaPan is a series of interactive images that allows anyone to explore the Meadowcroft Rockshelter archaeological site from any computer. This project was made possible through the generous support of the Claude Worthington Benedum Foundation, and through partnership with Carnegie Mellon University’s CREATE Lab and Learning Media Design Center.\n\n[View the GigaPan](https://www.heinzhistorycenter.org/meadowcroft-gigapan)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.205808", "metadata": {"original_content_length": 3504, "cleaned_content_length": 2714, "word_count": 391, "char_count": 2714, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/visit/sports-museum/", "title": "Western Pennsylvania Sports Museum - Heinz History Center", "content": "# Get in the game at the Sports Museum\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/visit/sports-museum/#page_content)\n\nExplore This SectionClose\n\nWhen it comes to sports pride and sports history, no other region in the world compares. The Western Pennsylvania Sports Museum tells the stories of Pittsburghers who became champions and champions who became Pittsburghers.\n\n### **Always Free for Kids!**\n\nThanks to a transformative gift from longtime supporters Daniel G. and Carole L. Kamin, the Heinz History Center now offers free admission for all kids year-round! The [Kamin “Free for Kids” Initiative](https://www.heinzhistorycenter.org/families/kamin-family-legacy/) includes free museum entry for all children aged 17 and under and cover admission costs for all school groups.\n\n## Hours & Location\n\n- Address: **1212 Smallman St, Pittsburgh, PA 15222** in the heart of Pittsburgh’s historic Strip District\n- Hours: Daily from **10 a.m. to 5 p.m.** for the History Center and Sports Museum\n- Holiday Closures: New Year’s Day, Easter, Thanksgiving, and Christmas.\n\n## Admission\n\n### **Visit with RAD Pass**\n\nWe’re proud to be part of RAD Pass, a free and discounted ticket program from Allegheny Regional Asset District (RAD) that makes it easier than ever to explore more of Pittsburgh’s most beloved arts and entertainment destinations – including the Heinz History Center!\n\nPre-registration is required through the [RAD Pass website](https://radpass.org/) with a valid Allegheny County Library Card. RAD passes are not offered in-person.\n\nTickets may be [purchased in advance online](https://tickets-historycenter.heinzhistorycenter.org/calendar) or at the door. Admission includes full access to the History Center and Sports Museum.\n\n[Purchase Tickets](https://my.heinzhistorycenter.org/orders/558/calendar?cart=true&eventId=64babd55351d6b414477592b&membershipIds=)\n\n## What's On at the Sports Museum?\n\nExhibits & Events\n\nWestern Pennsylvania Sports Museum\n\nGet the inside scoop on featured exhibits and events at the museum.\n\n[What's On](https://www.heinzhistorycenter.org/whats-on/sports-museum)\n\n## The Shop\n\nThe History Center Museum Shop is your one-stop shop for all things Pittsburgh. From vintage sports tees and pennants to car magnets and books, the shop is stocked with gear that celebrates Pittsburgh teams and sports history. The Museum Shop is open seven days a week during regular museum hours, and always open online.\n\n[Explore the Shop](https://shop.heinzhistorycenter.org/collections/western-pennsylvania-sports-museum)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.210370", "metadata": {"original_content_length": 3974, "cleaned_content_length": 2559, "word_count": 334, "char_count": 2559, "description": "When it comes to sports pride and sports history, no other region in the world compares. The Western Pennsylvania Sports Museum tells the stories of Pittsburghers who became champions and champions who became Pittsburghers."}}
{"url": "https://www.heinzhistorycenter.org/about/contact-us/", "title": "Contact Us - Heinz History Center", "content": "# Contact Us\n\nPlease find our most frequently contacted numbers and information below.\n\n#### Senator John Heinz History Center & Western Pennsylvania Sports Museum\n\n412-454-6000 \\| [info@heinzhistorycenter.org](mailto:info@heinzhistorycenter.org)\n\n#### Fort Pitt Museum\n\n412-281-9284 \\| [fortpittinfo@heinzhistorycenter.org](mailto:fortpittinfo@heinzhistorycenter.org)\n\n#### Meadowcroft Rockshelter and Historic Village\n\n724-587-3412 \\| [meadowcroftinfo@heinzhistorycenter.org](mailto:meadowcroftinfo@heinzhistorycenter.org)\n\n#### Historical Research Inquiries\n\nLibrary & Archives Reference Desk\n\n412-454-6364 \\| [library@heinzhistorycenter.org](mailto:library@heinzhistorycenter.org) \\| [Online Form](https://www.heinzhistorycenter.org/research/detre-library-archives/contact/)\n\n#### Lost & Found\n\nSecurity Office: 412-454-6311\n\n#### Artifact & Archival Donations\n\n**[acquisitions@heinzhistorycenter.org](mailto:acquisitions@heinzhistorycenter.org)**\n\n#### Discounted Admission Inquiries\n\n(for educational and non-profit organizations)\n\n[In-Kind Donation Request Form](https://www.heinzhistorycenter.org/about/contact-us/in-kind-donation-request/)\n\n_Please note that all requests must be received at least 30 days prior to your event._\n\n#### Event & Facility Rental Inquiries\n\n[events.team@heinzhistorycenter.org](mailto:events.team@heinzhistorycenter.org)\n\n#### Fundraising Inquiries\n\n_To request a donation of items for your event, please refer to_ **_Discounted Admission Inquiries_** _, above, for our procedure._\n\n#### Group Tour Inquiries\n\n[groups@heinzhistorycenter.org](mailto:groups@heinzhistorycenter.org)\n\n#### School Group Inquiries\n\n**[learn@heinzhistorycenter.org](mailto:learn@heinzhistorycenter.org)**\n\n#### Media Inquiries\n\nBrady Smith, Director of Marketing and Communications\n\n412-454-6459 \\| [media@heinzhistorycenter.org](mailto:media@heinzhistorycenter.org)\n\n#### Membership Inquiries\n\n**[membership@heinzhistorycenter.org](mailto:membership@heinzhistorycenter.org)**\n\n#### Museum Shop & E-store Order Inquires\n\nCaitlin Stayrook, Director of Museum Stores & Visitor Services\n\n412-454-6374 \\| [museumshop@heinzhistorycenter.org](mailto:museumshop@heinzhistorycenter.org)\n\n#### Public Programs Inquiries\n\n**[programs@heinzhistorycenter.org](mailto:programs@heinzhistorycenter.org)**\n\n#### Volunteer Inquiries\n\n412-454-6428 \\| [volunteers@heinzhistorycenter.org](mailto:volunteers@heinzhistorycenter.org)\n\n#### Ticketing or Admission Questions\n\nCaitlin Stayrook, Director of Museum Stores & Visitor Services\n\n412-454-6374 \\| [admission@heinzhistorycenter.org](mailto:admission@heinzhistorycenter.org)\n\n#### Website Problems or Questions\n\n**[digitalservices@heinzhistorycenter.org](mailto:digitalservices@heinzhistorycenter.org)**\n\nStay up-to-date with the History Center, Western Pennsylvania Sports Museum, Fort Pitt Museum, and Meadowcroft Rockshelter and Historical Village. Get updates sent straight to your email inbox or follow us on social media!\n\n**Sign up for the E-Newsletter to learn about the latest museum news.**\n\n[Sign up for emails](https://lp.constantcontactpages.com/su/JY1eUky)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.210370", "metadata": {"original_content_length": 3498, "cleaned_content_length": 3116, "word_count": 259, "char_count": 3116, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/", "title": "Sports Museum Exhibits - Heinz History Center", "content": "# Sports Museum Exhibits\n\nThe Western Pennsylvania Sports Museum is a dynamic, 20,000-square-foot museum-within-a-museum located inside the Heinz History Center.  Enjoy a stunning collection of sports artifacts and more than 70 interactive activities that celebrate the rich tradition of sports in our region.  Beginning with a two-story, multi-screen theatre, fans can relive the spine-tingling moments and championship athletes throughout sports.  From boxing to baseball, from the sandlots to the professional leagues, your entire family will find something to cheer about.\n\n## Sport and the Body\n\nExhibit\n\nWestern Pennsylvania Sports Museum\n\nThe Western Pennsylvania Sports Museum’s new Sport and the Body exhibition highlights Pittsburgh’s critical role in the evolution of sports medicine and orthopaedic surgery.\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/sport-and-the-body/)\n\n- ![Two boys throw yellow footballs toward a painted indoor wall that features illustrations of football players and black circular targets marked with point values.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/WPSM_0570_football-toss-web-300x200.jpg)\n\n## [Super Steelers](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/super-steelers/)\n\nTackle more than a century of football in Western Pennsylvania from Friday Night Lights through Steelers Sundays.\n\n- ![A woman stands in front of a museum display case containing a green VBC Richland soccer jersey, a soccer ball, goalkeeper gloves, several trophies, and framed photographs and newspaper articles related to a soccer championship.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/WPSM_0395_womens-sports-history_best-web-300x200.jpg)\n\n## [City of Champions](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/city-of-champions/)\n\nLearn the almost-forgotten tales of Pittsburgh’s champions in the Sports Museum.\n\n- ![A wax figure of a hockey player wearing a Pittsburgh Penguins jersey holds the Stanley Cup trophy above their head, positioned in front of an enlarged photograph showing the real Pittsburgh Penguins team celebrating a championship victory.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/Hockey_16by9-300x200.jpg)\n\n## [A Great Day for Hockey!](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/hockey/)\n\nSkate through the history of hockey in Western Pennsylvania from its start here in 1895 to the five-time Stanley Cup champion Pittsburgh Penguins.\n\n- ![Three life-sized statues of Pittsburgh Pirates baseball players in uniform stand in front of a mural showing a historic stadium with crowds of fans outside; glass exhibit cases containing baseball memorabilia appear in the foreground.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_HistoryCenter_040_0318_16by9-300x200.jpg)\n\n## [Beat 'Em Bucs](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/beat-em-bucs/)\n\nRelive your favorite players and legendary moments in Pittsburgh Pirates history. Five World Series championships. Nine National League pennants. Honus. Maz. Clemente. Stargell. McCutchen.\n\n- ![Black and white photo of a vintage baseball team; eleven players pose on steps in striped uniforms labeled Crawfords, with one person standing at the end wearing a dark jacket instead of a uniform.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/Negro-League-Pittsburgh-Crawfords-300x200.jpg)\n\n## [Negro League Baseball](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/negro-league-baseball/)\n\nWith 15 future National Baseball Hall of Famers and two championship teams – the Homestead Grays and the Pittsburgh Crawfords – no city can claim a Negro League baseball tradition quite like Pittsburgh.\n\n- ![A museum exhibit showcases golf memorabilia including vintage golf clubs, historic black-and-white photographs, and various trophies arranged in glass cases. The background displays large images of golfers mid-swing, with informational panels mounted on the walls and spotlights illuminating the artifacts.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_Golf_HistoryCenter_056_0432-300x200.jpg)\n\n## [Hit the Links: Golf in Western Pa.](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/golf/)\n\nFrom the unforgiving sand traps at Oakmont to the sweet swing of “The King,” Western Pennsylvania has made a historic impact on the sport of golf.\n\n- ![A group of people stand in front of a display case containing vintage high school sports memorabilia, such as old footballs, leather helmets, athletic shoes, sweaters with team logos, and colorful school banners, inside a museum gallery.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/sports1-300x200.jpg)\n\n## [High School Glory Days](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/high-school-glory-days/)\n\nLearn the well-known and almost forgotten tales of high school athletics in Western Pa., from record-setting performances and championship teams to legendary coaches and school rivalries.\n\n- ![A red IndyCar race car with FUJIFILM and Energizer logos is displayed in a museum exhibit. The car is surrounded by glass cases containing trophies, a red racing suit on a mannequin, and framed photographs. Dramatic lighting illuminates the race car and surrounding memorabilia against a dark background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC_6053-credit-Amy-Cicconi-300x200.jpg)\n\n## [Need for Speed](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/racing/)\n\nShift into gear in the Sports Museum’s racing section and learn how Pittsburgh’s Chip Ganassi became an Indy 500 winner and one of auto racing’s most decorated owners.\n\n- ![A glass display case at the sports museum containing a gold championship boxing belt decorated with an eagle emblem, a pair of vintage brown leather boxing gloves, and a black-and-white photograph showing two boxers fighting in the ring. Additional pieces of boxing memorabilia are visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_HistoryCenter_065_0485-golden-gloves-300x200.jpg)\n\n## [Golden Gloves](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/golden-gloves/)\n\nIt’s no surprise that Pittsburgh produced some of the nation’s grittiest fighters over the past 100 years.\n\n- ![Two boys throw yellow footballs toward a painted indoor wall that features illustrations of football players and black circular targets marked with point values.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/WPSM_0570_football-toss-web-300x200.jpg)\n\n## [Super Steelers](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/super-steelers/)\n\nTackle more than a century of football in Western Pennsylvania from Friday Night Lights through Steelers Sundays.\n\n- ![A woman stands in front of a museum display case containing a green VBC Richland soccer jersey, a soccer ball, goalkeeper gloves, several trophies, and framed photographs and newspaper articles related to a soccer championship.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/WPSM_0395_womens-sports-history_best-web-300x200.jpg)\n\n## [City of Champions](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/city-of-champions/)\n\nLearn the almost-forgotten tales of Pittsburgh’s champions in the Sports Museum.\n\n- ![A wax figure of a hockey player wearing a Pittsburgh Penguins jersey holds the Stanley Cup trophy above their head, positioned in front of an enlarged photograph showing the real Pittsburgh Penguins team celebrating a championship victory.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/Hockey_16by9-300x200.jpg)\n\n## [A Great Day for Hockey!](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/hockey/)\n\nSkate through the history of hockey in Western Pennsylvania from its start here in 1895 to the five-time Stanley Cup champion Pittsburgh Penguins.\n\n- ![Three life-sized statues of Pittsburgh Pirates baseball players in uniform stand in front of a mural showing a historic stadium with crowds of fans outside; glass exhibit cases containing baseball memorabilia appear in the foreground.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_HistoryCenter_040_0318_16by9-300x200.jpg)\n\n## [Beat 'Em Bucs](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/beat-em-bucs/)\n\nRelive your favorite players and legendary moments in Pittsburgh Pirates history. Five World Series championships. Nine National League pennants. Honus. Maz. Clemente. Stargell. McCutchen.\n\n- ![Black and white photo of a vintage baseball team; eleven players pose on steps in striped uniforms labeled Crawfords, with one person standing at the end wearing a dark jacket instead of a uniform.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/Negro-League-Pittsburgh-Crawfords-300x200.jpg)\n\n## [Negro League Baseball](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/negro-league-baseball/)\n\nWith 15 future National Baseball Hall of Famers and two championship teams – the Homestead Grays and the Pittsburgh Crawfords – no city can claim a Negro League baseball tradition quite like Pittsburgh.\n\n- ![A museum exhibit showcases golf memorabilia including vintage golf clubs, historic black-and-white photographs, and various trophies arranged in glass cases. The background displays large images of golfers mid-swing, with informational panels mounted on the walls and spotlights illuminating the artifacts.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_Golf_HistoryCenter_056_0432-300x200.jpg)\n\n## [Hit the Links: Golf in Western Pa.](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/golf/)\n\nFrom the unforgiving sand traps at Oakmont to the sweet swing of “The King,” Western Pennsylvania has made a historic impact on the sport of golf.\n\n- ![A group of people stand in front of a display case containing vintage high school sports memorabilia, such as old footballs, leather helmets, athletic shoes, sweaters with team logos, and colorful school banners, inside a museum gallery.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/sports1-300x200.jpg)\n\n## [High School Glory Days](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/high-school-glory-days/)\n\nLearn the well-known and almost forgotten tales of high school athletics in Western Pa., from record-setting performances and championship teams to legendary coaches and school rivalries.\n\n- ![A red IndyCar race car with FUJIFILM and Energizer logos is displayed in a museum exhibit. The car is surrounded by glass cases containing trophies, a red racing suit on a mannequin, and framed photographs. Dramatic lighting illuminates the race car and surrounding memorabilia against a dark background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC_6053-credit-Amy-Cicconi-300x200.jpg)\n\n## [Need for Speed](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/racing/)\n\nShift into gear in the Sports Museum’s racing section and learn how Pittsburgh’s Chip Ganassi became an Indy 500 winner and one of auto racing’s most decorated owners.\n\n- ![A glass display case at the sports museum containing a gold championship boxing belt decorated with an eagle emblem, a pair of vintage brown leather boxing gloves, and a black-and-white photograph showing two boxers fighting in the ring. Additional pieces of boxing memorabilia are visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_HistoryCenter_065_0485-golden-gloves-300x200.jpg)\n\n## [Golden Gloves](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/golden-gloves/)\n\nIt’s no surprise that Pittsburgh produced some of the nation’s grittiest fighters over the past 100 years.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.213530", "metadata": {"original_content_length": 12830, "cleaned_content_length": 12066, "word_count": 1303, "char_count": 12066, "description": "The Western Pennsylvania Sports Museum is a dynamic, 20,000-square-foot museum-within-a-museum located inside the Heinz History Center. Enjoy a stunning collection of sports artifacts and more than 70 interactive activities that celebrate the rich tradition of sports in our region. Beginning with a two-story, multi-screen theatre, fans can relive the spine-tingling moments and championship athletes throughout sports. From boxing to baseball, from the sandlots to the professional leagues, your entire family will find something to cheer about."}}
{"url": "https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/", "title": "History Center Exhibits - Heinz History Center", "content": "# History Center Exhibits\n\n- ![Collage of famous Pittsburghers with books, awards, and city landmarks on an American flag background, vibrant with color. *AI generated alt text](https://www.heinzhistorycenter.org/wp-content/uploads/2025/09/Mellett-History-of-Persistence-300x200.jpg)\n\n## [My America: An Illustrated Experience](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/my-america-an-illustrated-experience/)\n\n**Opening October 11, 2025** What does America mean to you?\n\n- ![](https://www.heinzhistorycenter.org/wp-content/uploads/2025/03/list-image-PHH-exhibit-page-1-300x200.png)\n\n## [Pittsburgh’s Hidden History](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/pittsburghs-hidden-history/)\n\n**Open now!** This spring, the Heinz History Center is unlocking the vault and unveiling a treasure trove of artifacts from its vast collection.\n\n- ![People walk through a brightly lit museum exhibit featuring a large artificial tree, colorful display panels, and interactive areas; a woman holds a young childs hand as they explore the exhibit together.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/Mister-Rogers-Neighborhood-display-300x200.jpg)\n\n## [Mister Rogers' Neighborhood](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/mr-rogers-neighborhood/)\n\nVisit the _**Special Collections Gallery**_ to see original set pieces and exclusive artifacts from “Mister Rogers’ Neighborhood.”\n\n- ![A museum exhibit titled From Slavery to Freedom displays a large metal shackle and chain on a pedestal, floor illustrations depicting bodies linked by chains, and a seated mannequin representing an enslaved person. The display evokes the transatlantic slave trade era within a history museum in the US.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/FromSlaverytoFreedom_HistoryCenter_011_0072-300x200.jpg)\n\n## [From Slavery to Freedom](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/from-slavery-to-freedom/)\n\nEmbark on a journey that begins in 18th century Africa and continues through 21st century Western Pennsylvania.\n\n- ![A blue Ford self-driving car is displayed in a museum exhibit titled Pittsburgh: A Tradition of Innovation, surrounded by informational panels and artifacts. Two people are walking past the display, with brick walls and additional exhibit pieces visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/Innovation-ARGO-CAR-W-VISITORS_16by9-300x200.jpg)\n\n## [Pittsburgh: A Tradition of Innovation](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/pittsburgh-tradition-of-innovation/)\n\nFrom the Ferris Wheel to the Big Mac, celebrate 250 years of Pittsburgh innovations.\n\n- ![A large, illuminated Heinz Tomato Ketchup bottle display stands in the center of a vibrant exhibition space featuring colorful walls, retro-style signage, classic Heinz memorabilia cases, and vintage decor elements.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/DSC_6041_HDR-credit-Amy-Cicconi_16by9-300x200.jpg)\n\n## [Heinz](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/heinz/)\n\nPour on the excitement for 150 years of Heinz innovations as part of the History Center’s newest exhibition.\n\n- ![A well-lit Visible Storage room in a US museum with metal shelves filled with antiques, glassware, paintings, and wooden furniture. The space features tall pillars labeled “ARMAMENTS,” “DECORATIVE ARTS,” and “GLASS.”.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/Visible-Storage-photo-300x200.jpg)\n\n## [Visible Storage](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/visible-storage/)\n\nGo behind-the-scenes and enjoy hundreds of artifacts from the History Center’s collection.\n\n- ![A museum exhibit features vintage clothing on mannequins, historical artifacts, and framed portraits displayed in glass cases. Benches are positioned along a central walkway, and dim overhead lights highlight the displays.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/HHC_SpecialCollections-300x200.jpg)\n\n## [Special Collections](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/special-collections/)\n\nEnjoy our state-of-the-art open storage gallery that reflects Western Pennsylvania’s unique blend of cultures, people, and ideas.\n\n- ![Three men closely observe a large, translucent yellow-green gemstone displayed in a glass case inside a dimly lit museum with brick walls and historical exhibits visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/Glass-Shattering-Notions-exhibit-300x200.jpg)\n\n## [Glass: Shattering Notions](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/glass/)\n\nShatter your knowledge of glass and Western Pennsylvania history.\n\n- ![A young boy looks up while playing with large blue foam building blocks in an indoor play area. Another child is in the background among scattered blocks. The area is brightly lit and colorful.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/DiscoveryPlace_HHC_271216_AnnieONeill06-300x200.jpg)\n\n## [Discovery Place](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/discovery-place/)\n\n_**For kids!**_ Explore Pittsburgh innovations and the invention process in a fun setting where creativity, science, and history merge.\n\n- ![Exhibit hall in a US history museum with exposed wooden beams and brick walls, containing life-sized historical mannequins dressed in period clothing. The scene includes glass display cases and informational panels about the clash of empires and other significant historical events.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/ClashofEmpires03-300x200.jpg)\n\n## [Clash of Empires: The British, French & Indian War, 1754-1763](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/clash-of-empires/)\n\nExperience the dramatic story of the French & Indian War and its impact as a turning point in American history.\n\n- ![Two people walk up a stairwell inside a history museum; the walls feature a large mural of a football player, a “We Can Do It!” Rosie the Riveter poster, and several directional signs indicating stadium seating. The railing also displays directional signage.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/SmartSteps_HistoryCenter_004_0653_16by9-300x200.jpg)\n\n## [SmartSteps](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/smartsteps/)\n\nTake the stairs and explore unique facts about Pittsburgh history to encourage your climb to fitness.\n\n- ![An older man and a young boy sit at a small table playing a game in a museum room featuring a large model cow, a “No Stopping In Tunnel” sign, and a black-and-white photograph of a store mounted on the wall.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/KidsBurgh_HistoryCenter_014_0471-300x200.jpg)\n\n## [Kidsburgh](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/kidsburgh/)\n\nEnjoy the interactive play place for the history fans of tomorrow.\n\n- ![A museum exhibit featuring a large black-and-white portrait of a man mounted on a brick wall; an information plaque sits to the left, and a display case is positioned to the right in front of a large metal column.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/SenatorJohnHeinz_HistoryCenter_004_0701_16by9-300x200.jpg)\n\n## [Senator John Heinz: A Western Pennsylvania Legacy](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/senator-john-heinz-a-western-pennsylvania-legacy/)\n\nHonor John Heinz’s life, public service, and contributions to arts and culture, the environment, economic development, and society.\n\n- ![Collage of famous Pittsburghers with books, awards, and city landmarks on an American flag background, vibrant with color. *AI generated alt text](https://www.heinzhistorycenter.org/wp-content/uploads/2025/09/Mellett-History-of-Persistence-300x200.jpg)\n\n## [My America: An Illustrated Experience](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/my-america-an-illustrated-experience/)\n\n**Opening October 11, 2025** What does America mean to you?\n\n- ![](https://www.heinzhistorycenter.org/wp-content/uploads/2025/03/list-image-PHH-exhibit-page-1-300x200.png)\n\n## [Pittsburgh’s Hidden History](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/pittsburghs-hidden-history/)\n\n**Open now!** This spring, the Heinz History Center is unlocking the vault and unveiling a treasure trove of artifacts from its vast collection.\n\n- ![People walk through a brightly lit museum exhibit featuring a large artificial tree, colorful display panels, and interactive areas; a woman holds a young childs hand as they explore the exhibit together.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/Mister-Rogers-Neighborhood-display-300x200.jpg)\n\n## [Mister Rogers' Neighborhood](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/mr-rogers-neighborhood/)\n\nVisit the _**Special Collections Gallery**_ to see original set pieces and exclusive artifacts from “Mister Rogers’ Neighborhood.”\n\n- ![A museum exhibit titled From Slavery to Freedom displays a large metal shackle and chain on a pedestal, floor illustrations depicting bodies linked by chains, and a seated mannequin representing an enslaved person. The display evokes the transatlantic slave trade era within a history museum in the US.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/FromSlaverytoFreedom_HistoryCenter_011_0072-300x200.jpg)\n\n## [From Slavery to Freedom](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/from-slavery-to-freedom/)\n\nEmbark on a journey that begins in 18th century Africa and continues through 21st century Western Pennsylvania.\n\n- ![A blue Ford self-driving car is displayed in a museum exhibit titled Pittsburgh: A Tradition of Innovation, surrounded by informational panels and artifacts. Two people are walking past the display, with brick walls and additional exhibit pieces visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/Innovation-ARGO-CAR-W-VISITORS_16by9-300x200.jpg)\n\n## [Pittsburgh: A Tradition of Innovation](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/pittsburgh-tradition-of-innovation/)\n\nFrom the Ferris Wheel to the Big Mac, celebrate 250 years of Pittsburgh innovations.\n\n- ![A large, illuminated Heinz Tomato Ketchup bottle display stands in the center of a vibrant exhibition space featuring colorful walls, retro-style signage, classic Heinz memorabilia cases, and vintage decor elements.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/DSC_6041_HDR-credit-Amy-Cicconi_16by9-300x200.jpg)\n\n## [Heinz](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/heinz/)\n\nPour on the excitement for 150 years of Heinz innovations as part of the History Center’s newest exhibition.\n\n- ![A well-lit Visible Storage room in a US museum with metal shelves filled with antiques, glassware, paintings, and wooden furniture. The space features tall pillars labeled “ARMAMENTS,” “DECORATIVE ARTS,” and “GLASS.”.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/Visible-Storage-photo-300x200.jpg)\n\n## [Visible Storage](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/visible-storage/)\n\nGo behind-the-scenes and enjoy hundreds of artifacts from the History Center’s collection.\n\n- ![A museum exhibit features vintage clothing on mannequins, historical artifacts, and framed portraits displayed in glass cases. Benches are positioned along a central walkway, and dim overhead lights highlight the displays.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/HHC_SpecialCollections-300x200.jpg)\n\n## [Special Collections](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/special-collections/)\n\nEnjoy our state-of-the-art open storage gallery that reflects Western Pennsylvania’s unique blend of cultures, people, and ideas.\n\n- ![Three men closely observe a large, translucent yellow-green gemstone displayed in a glass case inside a dimly lit museum with brick walls and historical exhibits visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/Glass-Shattering-Notions-exhibit-300x200.jpg)\n\n## [Glass: Shattering Notions](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/glass/)\n\nShatter your knowledge of glass and Western Pennsylvania history.\n\n- ![A young boy looks up while playing with large blue foam building blocks in an indoor play area. Another child is in the background among scattered blocks. The area is brightly lit and colorful.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/DiscoveryPlace_HHC_271216_AnnieONeill06-300x200.jpg)\n\n## [Discovery Place](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/discovery-place/)\n\n_**For kids!**_ Explore Pittsburgh innovations and the invention process in a fun setting where creativity, science, and history merge.\n\n- ![Exhibit hall in a US history museum with exposed wooden beams and brick walls, containing life-sized historical mannequins dressed in period clothing. The scene includes glass display cases and informational panels about the clash of empires and other significant historical events.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/ClashofEmpires03-300x200.jpg)\n\n## [Clash of Empires: The British, French & Indian War, 1754-1763](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/clash-of-empires/)\n\nExperience the dramatic story of the French & Indian War and its impact as a turning point in American history.\n\n- ![Two people walk up a stairwell inside a history museum; the walls feature a large mural of a football player, a “We Can Do It!” Rosie the Riveter poster, and several directional signs indicating stadium seating. The railing also displays directional signage.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/SmartSteps_HistoryCenter_004_0653_16by9-300x200.jpg)\n\n## [SmartSteps](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/smartsteps/)\n\nTake the stairs and explore unique facts about Pittsburgh history to encourage your climb to fitness.\n\n- ![An older man and a young boy sit at a small table playing a game in a museum room featuring a large model cow, a “No Stopping In Tunnel” sign, and a black-and-white photograph of a store mounted on the wall.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/KidsBurgh_HistoryCenter_014_0471-300x200.jpg)\n\n## [Kidsburgh](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/kidsburgh/)\n\nEnjoy the interactive play place for the history fans of tomorrow.\n\n- ![A museum exhibit featuring a large black-and-white portrait of a man mounted on a brick wall; an information plaque sits to the left, and a display case is positioned to the right in front of a large metal column.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/07/SenatorJohnHeinz_HistoryCenter_004_0701_16by9-300x200.jpg)\n\n## [Senator John Heinz: A Western Pennsylvania Legacy](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/senator-john-heinz-a-western-pennsylvania-legacy/)\n\nHonor John Heinz’s life, public service, and contributions to arts and culture, the environment, economic development, and society.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.215597", "metadata": {"original_content_length": 16017, "cleaned_content_length": 15547, "word_count": 1524, "char_count": 15547, "description": "", "event_date": "October 11, 2025"}}
{"url": "https://www.heinzhistorycenter.org/whats-on/sports-museum/", "title": "Western Pennsylvania Sports Museum - Heinz History Center", "content": "Exhibit\n\nWestern Pennsylvania Sports Museum\n\n# Super Steelers\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/super-steelers/)\n\n## Western Pennsylvania Sports Museum\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/whats-on/sports-museum/#page_content)\n\nExplore This SectionClose\n\nThe Western Pennsylvania Sports Museum is located within the [Heinz History Center](https://www.heinzhistorycenter.org/visit/heinz-history-center/) at 1212 Smallman Street in the heart of Pittsburgh’s historic Strip District, one of the city’s most vibrant neighborhoods and a popular destination for shoppers and foodies alike.\n\n[Plan Your Visit](https://www.heinzhistorycenter.org/visit/sports-museum/)\n\n## Exhibits On View\n\n### Super Steelers\n\nExhibit\n\nWestern Pennsylvania Sports Museum\n\nTackle more than a century of football in Western Pennsylvania from Friday Night Lights through Steelers Sundays.\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/super-steelers/)\n\n### A Great Day for Hockey!\n\nExhibit\n\nWestern Pennsylvania Sports Museum\n\nSkate through the history of hockey in Western Pennsylvania from its start here in 1895 to the five-time Stanley Cup champion Pittsburgh Penguins.\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/hockey/)\n\n- ![Two women in a sports history museum observe a life-sized football player mannequin display. One woman with purple hair sits in a wheelchair and wears a face mask; the other woman stands beside her, holding a colorful bag from the museums donate shop.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/WPSM_0385-copy-300x200.jpg)\n\n## [City of Champions](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/city-of-champions/)\n\nLearn the almost-forgotten tales of Pittsburgh’s champions in the Sports Museum.\n\n- ![Three life-sized statues of Pittsburgh Pirates baseball players in uniform stand in front of a mural showing a historic stadium with crowds of fans outside; glass exhibit cases containing baseball memorabilia appear in the foreground.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_HistoryCenter_040_0318_16by9-300x200.jpg)\n\n## [Beat 'Em Bucs](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/beat-em-bucs/)\n\nRelive your favorite players and legendary moments in Pittsburgh Pirates history. Five World Series championships. Nine National League pennants. Honus. Maz. Clemente. Stargell. McCutchen.\n\n- ![Black and white photo of a vintage baseball team; eleven players pose on steps in striped uniforms labeled Crawfords, with one person standing at the end wearing a dark jacket instead of a uniform.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/Negro-League-Pittsburgh-Crawfords-300x200.jpg)\n\n## [Negro League Baseball](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/negro-league-baseball/)\n\nWith 15 future National Baseball Hall of Famers and two championship teams – the Homestead Grays and the Pittsburgh Crawfords – no city can claim a Negro League baseball tradition quite like Pittsburgh.\n\n- ![A glass display case containing a pair of vintage brown leather boxing gloves, a gold championship belt with an eagle emblem at the center, and several black and white photographs showing boxers in the ring during matches.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_HistoryCenter_065_0485-300x200.jpg)\n\n## [See All Exhibits On View](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/)\n\nEnjoy a stunning collection of sports artifacts and more than 70 interactive activities that celebrate the rich tradition of sports in our region. Everyone will find something to cheer about!\n\n- ![Two women in a sports history museum observe a life-sized football player mannequin display. One woman with purple hair sits in a wheelchair and wears a face mask; the other woman stands beside her, holding a colorful bag from the museums donate shop.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/WPSM_0385-copy-300x200.jpg)\n\n## [City of Champions](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/city-of-champions/)\n\nLearn the almost-forgotten tales of Pittsburgh’s champions in the Sports Museum.\n\n- ![Three life-sized statues of Pittsburgh Pirates baseball players in uniform stand in front of a mural showing a historic stadium with crowds of fans outside; glass exhibit cases containing baseball memorabilia appear in the foreground.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_HistoryCenter_040_0318_16by9-300x200.jpg)\n\n## [Beat 'Em Bucs](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/beat-em-bucs/)\n\nRelive your favorite players and legendary moments in Pittsburgh Pirates history. Five World Series championships. Nine National League pennants. Honus. Maz. Clemente. Stargell. McCutchen.\n\n- ![Black and white photo of a vintage baseball team; eleven players pose on steps in striped uniforms labeled Crawfords, with one person standing at the end wearing a dark jacket instead of a uniform.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/Negro-League-Pittsburgh-Crawfords-300x200.jpg)\n\n## [Negro League Baseball](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/negro-league-baseball/)\n\nWith 15 future National Baseball Hall of Famers and two championship teams – the Homestead Grays and the Pittsburgh Crawfords – no city can claim a Negro League baseball tradition quite like Pittsburgh.\n\n- ![A glass display case containing a pair of vintage brown leather boxing gloves, a gold championship belt with an eagle emblem at the center, and several black and white photographs showing boxers in the ring during matches.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/SportsMuseum_HistoryCenter_065_0485-300x200.jpg)\n\n## [See All Exhibits On View](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/)\n\nEnjoy a stunning collection of sports artifacts and more than 70 interactive activities that celebrate the rich tradition of sports in our region. Everyone will find something to cheer about!", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.215597", "metadata": {"original_content_length": 7235, "cleaned_content_length": 6285, "word_count": 672, "char_count": 6285, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/about/work-with-us/", "title": "Work With Us - Heinz History Center", "content": "# Work With Us\n\nThe History Center, Fort Pitt Museum, and Meadowcroft Rockshelter and Historic Village offer a variety of full-time and part-time employment opportunities, as well as seasonal internships. The History Center also has numerous volunteer opportunities.\n\n**Learn More About:**\n\n- [Employment Opportunities](https://www.heinzhistorycenter.org/about/work-with-us#employment)\n- [Internship Opportunities](https://www.heinzhistorycenter.org/about/work-with-us#internships)\n- [Volunteer Opportunities](https://www.heinzhistorycenter.org/about/work-with-us#volunteer)\n\n## Employment Opportunities\n\nJob Opportunities [Skip to main content](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#main-content)\n\nThis website uses cookies to customize and improve your experience.\nIf you are a California resident, you may be entitled to certain rights regarding your personal information.\nAdditional information about our data collection practices and location specific notices is available on our privacy policy.\n\nX\n\nAccept Cookies\n\nThis website uses cookies to customize and improve your experience.\nIf you are a California resident, you may be entitled to certain rights regarding your personal information.\nAdditional information about our data collection practices and location specific notices is available on our privacy policy.\n\nX\n\nAccept Cookies\n\n[Skip Search and Filters](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#listings)\n\n### Search Job Postings\n\nSort By:\nNewestOldestJob TitleLocation\n\nCreate Your Job Alert\n\n**Can't find what you are looking for? Upload your resume and**\n**[Join the Talent Community for Senator John Heinz History Center!](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#)**\n\nThe following \"quick search\" text field filters the job results as you type.\n\n[Filters](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#)\n\n## Filters\n\n### Search Job Postings\n\nSort By:\nNewestOldestJob TitleLocation\n\nCreate Your Job Alert\n\n**Can't find what you are looking for? Upload your resume and**\n**[Join the Talent Community for Senator John Heinz History Center!](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#)**\n\n_chevron\\_left_\n\n## Create Your Job Alert\n\nThank you for setting up your job alert.\n\nYou'll be the first to know when a job is posted.\n\nTo review or manage Job Alerts, click [Account Settings](https://www.paycomonline.net/v4/ats/web.php/session/Authorized/account)\n\nWe created a profile for you based off your resume.\n\nTo review or manage your Job Alerts, click [Manage Profile](https://www.paycomonline.net/v4/ats/web.php/application/info/profile)\n\n_chevron\\_left_\n\n## Talent Community\n\n\\*Indicates Required Field\n\nWe invite you to stay connected with us to learn about opportunities by joining our Talent Community below.\n\nLegal First Name\\*\n\nLegal Last Name\\*\n\nEmail\\*\n\nConfirm Email\\*\n\nPhone\n\n![United States of America (USA) flag image](https://www.paycomonline.net/v4/assets/images/flags/us.png)+1 _arrow\\_drop\\_down_\n\n_search_\n\n_search_\n\nNo results found.\n\nUnited States of America (USA)\n\n+1\nCanada\n\n+1\n\n* * *\n\nAfghanistan\n\n+93\nAland Islands\n\n+358\nAlbania\n\n+355\nAlgeria\n\n+213\nAmerican Samoa\n\n+1\nAndorra\n\n+376\nAngola\n\n+244\nAnguilla\n\n+1\nAntarctica\n\n+672\nAntigua and Barbuda\n\n+1\nArgentina\n\n+54\nArmenia\n\n+374\nAruba\n\n+297\nAustralia\n\n+61\nAustria\n\n+43\nAzerbaijan\n\n+994\nBahamas\n\n+1\nBahrain\n\n+973\nBangladesh\n\n+880\nBarbados\n\n+1\nBelarus\n\n+375\nBelgium\n\n+32\nBelize\n\n+501\nBenin\n\n+229\nBermuda\n\n+1\nBhutan\n\n+975\nBolivia\n\n+591\nBonaire, Sint Eustatius and Saba\n\n+599\nBosnia and Herzegovina\n\n+387\nBotswana\n\n+267\nBouvet Island\n\n+47\nBrazil\n\n+55\nBritish Indian Ocean Territory\n\n+246\nBritish Virgin Islands\n\n+1\nBrunei\n\n+673\nBulgaria\n\n+359\nBurkina Faso\n\n+226\nBurundi\n\n+257\nCambodia\n\n+855\nCameroon\n\n+237\nCape Verde\n\n+238\nCayman Islands\n\n+1\nCentral Africa\n\n+236\nChad\n\n+235\nChile\n\n+56\nChina\n\n+86\nChristmas Island\n\n+61\nCocos (Keeling) Islands\n\n+61\nColombia\n\n+57\nComoros\n\n+269\nCongo\n\n+242\nCook Islands\n\n+682\nCosta Rica\n\n+506\nCroatia\n\n+385\nCuba\n\n+53\nCuraçao\n\n+599\nCyprus\n\n+357\nCzechia\n\n+420\nCôte d'Ivoire\n\n+225\nDR Congo\n\n+243\nDemocratic People's Republic of Korea\n\n+850\nDenmark\n\n+45\nDjibouti\n\n+253\nDominica\n\n+1\nDominican Republic\n\n+1\nEast Timor\n\n+670\nEcuador\n\n+593\nEgypt\n\n+20\nEl Salvador\n\n+503\nEquatorial Guinea\n\n+240\nEritrea\n\n+291\nEstonia\n\n+372\nEswatini (formerly Swaziland)\n\n+268\nEthiopia\n\n+251\nFalkland Islands\n\n+500\nFaroe Islands\n\n+298\nFiji\n\n+679\nFinland\n\n+358\nFrance\n\n+33\nFrench Guiana\n\n+594\nFrench Polynesia\n\n+689\nFrench Southern Territories\n\n+262\nGabon\n\n+241\nGambia\n\n+220\nGeorgia\n\n+995\nGermany\n\n+49\nGhana\n\n+233\nGibraltar\n\n+350\nGreece\n\n+30\nGreenland\n\n+299\nGrenada\n\n+1\nGuadeloupe\n\n+590\nGuam\n\n+1\nGuatemala\n\n+502\nGuernsey\n\n+44\nGuinea\n\n+224\nGuinea-Bissau\n\n+245\nGuyana\n\n+592\nHaiti\n\n+509\nHeard Island and McDonald Islands\n\n+672\nHoly See (Vatican City)\n\n+39\nHonduras\n\n+504\nHong Kong\n\n+852\nHungary\n\n+36\nIceland\n\n+354\nIndia\n\n+91\nIndonesia\n\n+62\nIran\n\n+98\nIraq\n\n+964\nIreland\n\n+353\nIsle of Man\n\n+44\nIsrael\n\n+972\nItaly\n\n+39\nJamaica\n\n+1\nJapan\n\n+81\nJersey\n\n+44\nJordan\n\n+962\nKazakhstan\n\n+7\nKenya\n\n+254\nKiribati\n\n+686\nKosovo\n\n+383\nKuwait\n\n+965\nKyrgyzstan\n\n+996\nLaos\n\n+856\nLatvia\n\n+371\nLebanon\n\n+961\nLesotho\n\n+266\nLiberia\n\n+231\nLibya\n\n+218\nLiechtenstein\n\n+423\nLithuania\n\n+370\nLuxembourg\n\n+352\nMacau\n\n+853\nMadagascar\n\n+261\nMalawi\n\n+265\nMalaysia\n\n+60\nMaldives\n\n+960\nMali\n\n+223\nMalta\n\n+356\nMarshall Islands\n\n+692\nMartinique\n\n+596\nMauritania\n\n+222\nMauritius\n\n+230\nMayotte\n\n+262\nMexico\n\n+52\nMicronesia\n\n+691\nMoldova\n\n+373\nMonaco\n\n+377\nMongolia\n\n+976\nMontenegro\n\n+382\nMontserrat\n\n+1\nMorocco\n\n+212\nMozambique\n\n+258\nMyanmar\n\n+95\nNamibia\n\n+264\nNauru\n\n+674\nNepal\n\n+977\nNetherlands\n\n+31\nNew Caledonia\n\n+687\nNew Zealand\n\n+64\nNicaragua\n\n+505\nNiger\n\n+227\nNigeria\n\n+234\nNiue\n\n+683\nNorfolk Island\n\n+672\nNorth Macedonia\n\n+389\nNorthern Mariana Islands\n\n+1\nNorway\n\n+47\nOman\n\n+968\nPakistan\n\n+92\nPalau\n\n+680\nPalestinian Territory\n\n+970\nPanama\n\n+507\nPapua New Guinea\n\n+675\nParaguay\n\n+595\nPeru\n\n+51\nPhilippines\n\n+63\nPitcairn\n\n+64\nPoland\n\n+48\nPortugal\n\n+351\nPuerto Rico\n\n+1\nQatar\n\n+974\nReunion\n\n+262\nRomania\n\n+40\nRussia\n\n+7\nRwanda\n\n+250\nSaint Barthelemy\n\n+590\nSaint Helena, Ascension and Tristan da Cunha\n\n+290\nSaint Kitts and Nevis\n\n+1\nSaint Lucia\n\n+1\nSaint Martin\n\n+590\nSaint Pierre and Miquelon\n\n+508\nSaint Vincent and the Grenadines\n\n+1\nSamoa\n\n+685\nSan Marino\n\n+378\nSao Tome and Principe\n\n+239\nSaudi Arabia\n\n+966\nSenegal\n\n+221\nSerbia\n\n+381\nSeychelles\n\n+248\nSierra Leone\n\n+232\nSingapore\n\n+65\nSint Maarten\n\n+1\nSlovakia\n\n+421\nSlovenia\n\n+386\nSolomon Islands\n\n+677\nSomalia\n\n+252\nSouth Africa\n\n+27\nSouth Georgia and the South Sandwich Islands\n\n+500\nSouth Korea\n\n+82\nSouth Sudan\n\n+211\nSpain\n\n+34\nSri Lanka\n\n+94\nSudan\n\n+249\nSuriname\n\n+597\nSvalbard and Jan Mayen\n\n+47\nSweden\n\n+46\nSwitzerland\n\n+41\nSyria\n\n+963\nTaiwan\n\n+886\nTajikistan\n\n+992\nTanzania\n\n+255\nThailand\n\n+66\nTogo\n\n+228\nTokelau\n\n+690\nTonga\n\n+676\nTrinidad and Tobago\n\n+1\nTunisia\n\n+216\nTurkey\n\n+90\nTurkmenistan\n\n+993\nTurks and Caicos Islands\n\n+1\nTuvalu\n\n+688\nUganda\n\n+256\nUkraine\n\n+380\nUnited Arab Emirates (UAE)\n\n+971\nUnited Kingdom (UK)\n\n+44\nUruguay\n\n+598\nUnited States Minor Outlying Islands\n\n+1\nUS Virgin Islands\n\n+1\nUzbekistan\n\n+998\nVanuatu\n\n+678\nVenezuela\n\n+58\nVietnam\n\n+84\nWallis and Futuna\n\n+681\nWestern Sahara\n\n+212\nYemen\n\n+967\nZambia\n\n+260\nZimbabwe\n\n+263\nlanguageInternational\n\n_priority\\_high_\n\n_priority\\_high_\n\nAttach Resume\\*\n\nJoinCancel\n\n## Success!\n\nThank you for submitting your resume and joining our Talent Community!\n\nWe created a profile for you based off your resume.\n\nTo review or make any changes click [Manage Profile](https://www.paycomonline.net/v4/ats/web.php/application/info/profile)\n\n**Can't find what you are looking for? Upload your resume and**\n\n**Join the Talent Community for Senator John Heinz History Center!**\n\nShowing 1-10 of 11\n\n[1](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#) [2](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#) [_arrow\\_back_](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#) [_arrow\\_forward_](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#)\n\nShow 102550 Records\n\n11 results available.\n\n- [Interpreter / Tour Guide](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=141658&clientkey=8C418A547E1D3E774FF0277E8175A385) Seasonal \\| Meadowcroft Rockshelter and Historic Vil - Avella, PA, 15312 About Meadowcroft Rockshelter and Historic Village\nMeadowcroft Rockshelter and Historic Village operates in association with the Senator John Heinz Hi...\n\n_chevron\\_right_\n\n- [Security Officer, Part-time & Casual](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=85523&clientkey=8C418A547E1D3E774FF0277E8175A385) Part Time \\| Senator John Heinz History Center - Pittsburgh, PA, 15222 The Senator John Heinz History Center, the largest history museum in Pennsylvania dedicated to history\nand an affiliate of the Smithsonian Institutio...\n\n_chevron\\_right_\n\n- [Visitor Services Coordinator](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=180163&clientkey=8C418A547E1D3E774FF0277E8175A385) Full Time \\| Senator John Heinz History Center - Pittsburgh, PA, 15222 About the Senator John Heinz History Center\n\nThe Senator John Heinz History Center is a Smithsonian-affiliated museum and a first-day Pittsburgh attra...\n\n_chevron\\_right_\n\n- [Volunteer & Intern Coordinator](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=128420&clientkey=8C418A547E1D3E774FF0277E8175A385) Full Time \\| Senator John Heinz History Center - Pittsburgh, PA, 15222 About the Senator John Heinz History Center\n\nThe Senator John Heinz History Center is a Smithsonian-affiliated museum and a first-day Pittsburgh attra...\n\n_chevron\\_right_\n\n- [Advancement Associate - Constituent Records Coordinator](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=191562&clientkey=8C418A547E1D3E774FF0277E8175A385) Full Time \\| Senator John Heinz History Center - Pittsburgh, PA, 15222 About the Senator John Heinz History Center\n\nThe Senator John Heinz History Center is a Smithsonian-affiliated Museum and a first-day Pittsburgh attra...\n\n_chevron\\_right_\n\n- [Events Associate](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=157047&clientkey=8C418A547E1D3E774FF0277E8175A385) Part Time \\| Senator John Heinz History Center - Pittsburgh, PA, 15222\n\nThe Heinz History Center, an affiliate of the Smithsonian Institution and the largest history museum in the Commonwealth of Pennsylvania, is...\n\n_chevron\\_right_\n\n- [Events Operations Manager](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=170483&clientkey=8C418A547E1D3E774FF0277E8175A385) Full Time \\| Senator John Heinz History Center - Pittsburgh, PA, 15222 About Senator John Heinz History Center\n\nThe Senator John Heinz History Center is a Smithsonian-affiliated museum and a first-day Pittsburgh attractio...\n\n_chevron\\_right_\n\n- [Exhibit Production Manager](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=175140&clientkey=8C418A547E1D3E774FF0277E8175A385) Full Time \\| Senator John Heinz History Center - Pittsburgh, PA, 15222 About Senator John Heinz History Center\n\nThe Senator John Heinz History Center is a Smithsonian-affiliated museum and a first-day Pittsburgh attractio...\n\n_chevron\\_right_\n\n- [Housekeeper - FPM, Part-time](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=175158&clientkey=8C418A547E1D3E774FF0277E8175A385) About the Fort Pitt Museum\n\nThe Fort Pitt Museum, located in historic Point State Park in downtown Pittsburgh, is a two-floor, 12,000-square-foot muse...\n\n_chevron\\_right_\n\n- [Public Programs Coordinator](https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=196678&clientkey=8C418A547E1D3E774FF0277E8175A385) Senator John Heinz History Center - Pittsburgh, PA, 15222 The Senator John Heinz History Center, the Smithsonian’s home in Pittsburgh and the #1 History Museum in America, is currently seeking a Public ...\n\n_chevron\\_right_\n\nShowing 1-10 of 11\n\n[1](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#) [2](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#) [_arrow\\_back_](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#) [_arrow\\_forward_](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#)\n\nShow 102550 Records\n\n**Can't find what you are looking for? Upload your resume and**\n**[Join the Talent Community for Senator John Heinz History Center!](https://www.paycomonline.net/v4/ats/web.php/jobs?clientkey=8C418A547E1D3E774FF0277E8175A385#)**\n\n# Join the Talent Community for Senator John Heinz History Center!\n\n_It is the policy of the History Center to practice equal employment opportunity without regard to race, color, age, religious creed, national origin, sex, non-job related mental and/or physically challenged, or status as a Vietnam Era or Disabled Veteran, except in those instances where a bona fide occupational qualification exists. Further, the History Center will make reasonable accommodations with respect to non-job related disabilities or disabilities for otherwise qualified applicants. Minorities are encouraged to apply._\n\n## Internships\n\n### History Center Internships\n\nThe Senator John Heinz History Center, Fort Pitt Museum, and Meadowcroft Rockshelter and Historic Village are great places to learn about numerous professions in a host of fields. These are unpaid internships available for credit or not for credit. Minorities encouraged to apply. If you are interested in applying for a History Center internship, please [click here](https://www.heinzhistorycenter.org/about/work-with-us/internship-application \"Internship Application\") to fill out an online application form. Additionally, please send a resume and cover letter to [rafalbo@heinzhistorycenter.org](mailto:rafalbo@heinzhistorycenter.org).\n\nWe are no longer accepting applications for Summer 2025.\n\nWe are currently accepting applications for the Fall 2025 term: the application deadline is July 1, 2025.\n\n### Departments & Divisions\n\n## Library & Archives Internship\n\nThe Library & Archives at the History Center preserves primary and secondary research materials that document life in Western Pennsylvania. Interns may assist with processing collections, preservation management, and research. Information Science students, with a concentration in library or archival studies, are preferred. The Library and Archives staff will work with the intern to tailor an experience that will help meet their professional goals.\n\n## Rauh Jewish History Program & Archives Internship\n\nThe Rauh Jewish History Program & Archives collects, preserves, and disseminates information about Jewish history in Western Pennsylvania. The program works closely with a diverse group of researchers and partners with organizations in the Jewish community and beyond. Interns may be asked to assist with processing collections, responding to reference requests, conducting research and planning public programs. Rauh Jewish History Program & Archives staff will work with the intern to tailor an experience that will help meet their professional goals.\n\n## Museum Internship\n\nThe Museum Division is responsible for researching, developing, installing, and maintaining all exhibits in the History Center. The division manages and documents regional history by collecting, cataloguing, researching, interpreting, displaying, and conserving and preserving, the History Center’s artifact collections. Interns may choose to work in curatorial, collections, or exhibits functions depending upon student skills, interest and current departmental needs.\n\n**Museum Internship (Curatorial)**\n\nInterns in the curatorial department do task related research on artifact collections or conduct research on selected history topics or artifact lender sources for upcoming exhibits. They must have some background in American history, American art, public history, or museum studies. Interns must be able to work independently and as part of a team. Experience doing research in primary source materials and strong writing skills a plus.\n\nPreference will be given to graduate students, or rising undergraduate juniors and seniors, who study public history.\n\n**Museum Internship (Collections)**\n\nInterns in the Collections/Registration department will work with objects – inventorying the collection, cataloging, cleaning, working in storage, scanning or photographing, and researching artifacts. An understanding of material culture and artifact handling and familiarity with cataloging a plus.\n\n## Fort Pitt Museum Internship\n\nThe Fort Pitt Museum is dedicated to preserving the history of Fort Pitt and Pittsburgh during the French and Indian War, Pontiac’s Rebellion, Lord Dunmore’s War, the American Revolution, and the Ohio Country Indian wars of the 1790’s. The museum comprises two floors of exhibit space, an active education program, and a living history program depicting both military and civilian life on the frontier. The museum’s permanent exhibits are continually being improved, and temporary exhibits are periodically developed. Interns may choose to work in research or exhibit fabrication, depending upon student skills, interest and current departmental needs. The education department oversees both regular group visitation and scouting programs. Interns will be assigned projects related to historical research, curriculum development, docent training, or special events depending upon student interest and current departmental needs. Interns may choose visible roles (front of house tour guiding) or behind the scenes roles. Living history demonstrations take place in Point State Park and range from campfire cooking to firing of a replica cannon. Interns to this department will be assigned projects related to historical research, program development, performing costumed interpretation, or special events depending upon student interest and current departmental needs.\n\n## African American Program Internships\n\nThe African American Collection is an initiative of the African American Program (AAP) and comprises over 300 Library & Archives sources that are primary to the understanding of historical experiences of African Americans in Western Pennsylvania. In addition, artifacts and material culture are housed in the museum of the History Center and make up the basis of the exhibition and preservation of local material history. These collections provide students, researchers, scholars, media professionals, writers, and others with a primary source of information about African Americans in Western Pennsylvania. Books, theses, dissertations, documentaries, and other forms of academic, educational, and cultural products have been derived from the AAC. Please check out the [AAC webpage](https://www.heinzhistorycenter.org/research/african-american-program/) for a depth look. Internships provide practical and applicable skills and knowledge in historic research, collections management, and exhibit development and research.\n\nPreference will be given to graduate student or undergraduate juniors or seniors with research skills.\n\n## Italian American Program internship\n\nThe Italian American Program is dedicated to preserving and interpreting the history and culture of Italian Americans in Western Pennsylvania through exhibitions, educational programs, publications, and community outreach. The Italian American Collection is one of the largest repositories of Italian American artifacts, photographs, oral histories, and archival materials in the United States. The program works closely with a diverse group of researchers, partner organizations, and community groups in the tri-state and beyond. Interns may be asked to assist with researching collections and historical topics, preparing content for public programming, or other research and writing-based tasks. The Italian American Program staff will work with the intern to tailor an experience that will help meet their professional goals and provide experiences to develop practical and applicable skills in the field of Public History.\n\n**_If you are interested in applying for a History Center internship, please [click here](https://www.heinzhistorycenter.org/about/work-with-us/internship-application \"Internship Application\") to fill out an online application form. Additionally, please send a resume and cover letter to [rafalbo@heinzhistorycenter.org](mailto:rafalbo@heinzhistorycenter.org)._**\n\nIf you have any questions about the History Center’s internships or the process, please contact Renee Falbo at [rafalbo@heinzhistorycenter.org](mailto:rafalbo@heinzhistorycenter.org).\n\n[Back to top](https://www.heinzhistorycenter.org/about/work-with-us/)\n\n## Volunteer\n\nVolunteers play a key role in making the History Center one of the finest cultural organizations in the U.S. By donating time and talents, volunteers assist with many facets of the organization.\n\nVolunteers with a wide range of skills and expertise are needed at the History Center, Western Pennsylvania Sports Museum, Meadowcroft Rockshelter and Historic Village, and the Fort Pitt Museum.\n\nSome of the ways to serve include:\n\n- **Docent:** Become a docent and guide visitors through a thematic exploration of the museum collection and its unique exhibits, engage in storytelling, prompt meaningful conversations, and lead interactive activities with a diverse audience, including students K-12 as well as adults. [Learn more about becoming a docent](https://www.heinzhistorycenter.org/about/work-with-us#docents).\n- **Library & Archives Volunteer:** Assist librarians and archivists with a variety of inventorying tasks, digitization, reference desk assistance, and oral history transcriptions.\n- **History Center Affiliate Liaison**: Represent the History Center at one of our affiliated organizations, including libraries, universities, and historical societies, in a variety of capacities based upon the volunteer needs of each organization.\n- **Events & Special Opportunities**: Be placed on an email listserv to help at special events, educational programs, and various administrative tasks around the Heinz History Center. You can sign up for these events according to your availability and interest.\n\nIn appreciation of donating time and talents, volunteers receive numerous benefits:\n\n- Unique learning, enrichment, and networking opportunities\n- Complimentary admission to all related museums\n- Free parking, as available, at 15th and Smallman Streets\n- 20% discount at the History Center’s museum shops\n- 10% discount at the Café at the History Center\n\nAre you interested in learning how you can help? Please fill out an online application and a History Center staff member will be in touch soon.\n\n[Apply here](https://www.volgistics.com/ex/portal.dll/ap?AP=2079433123)\n\nFor additional questions, please contact us at 412-454-6412 or [volunteers@heinzhistorycenter.org](mailto:volunteers@heinzhistorycenter.org).\n\n[**Volunteer Log-in**](https://www.volgistics.com/ex2/vicnet.dll?FROM=6571)\n\nCurrent History Center volunteers can login to their Volunteer Information Center Network (Vicnet) accounts **[here](https://www.volgistics.com/ex/portal.dll/?FROM=6571)**.\n\n### Docents\n\nLooking for ways to stay engaged with the History Center’s mission while educating the next generation and enjoying a life-long learning experience?\n\nThen consider becoming a History Center docent! Each docent receives special training in innovative ways to present American history with a Western Pennsylvania connection.\n\nThese trained volunteer educators lead tours for all ages throughout the History Center’s exhibitions and work directly with the History Center’s education division to receive all the training and tools necessary for success.\n\nDocents-in-training will become certified by obtaining all necessary security clearances and successfully completing the docent training program, which includes:\n\n- History Center volunteer orientation\n- Docent school\n- Reading assignments focusing on History Center exhibits\n- Shadowing current docents to learn the ropes\n- Assisting with special events\n- Reflective writing assignments\n\nPlease [**apply online**](http://www.volgistics.com/ex/portal.dll/ap?AP=2079433123). For questions about the Docent Program, please contact us at 412-454-6412 or [volunteers@heinzhistorycenter.org](mailto:volunteers@heinzhistorycenter.org).\n\n[Back to top](https://www.heinzhistorycenter.org/about/work-with-us/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.232476", "metadata": {"original_content_length": 46577, "cleaned_content_length": 24871, "word_count": 3021, "char_count": 24871, "description": "The History Center, Fort Pitt Museum, and Meadowcroft Rockshelter and Historic Village offer a variety of full-time and part-time employment opportunities, as well as seasonal internships. The History Center also has numerous volunteer opportunities.", "event_time": "13\nAm"}}
{"url": "https://www.heinzhistorycenter.org/events/", "title": "Events for October 2025 – Heinz History Center", "content": "October 26\n\nHeinz History Center — 10:00 AM\n\n# Haunted History Center Halloween\n\n[Event Details](https://www.heinzhistorycenter.org/event/haunted-history-center-halloween/)\n\n## Event Calendar\n\nCategory\n\nAll Categories\nAmerica 101\nAnnual Events\nBlack History Month\nBook Talk\nCivic Season\nEducation\nFeatured\nFrom Slavery to Freedom\nGenealogy\nGuided Tour\nItalian American Program\nJewish Genealogy\nKids & Families\nLibrary & Archives\nMeadowcroft Insider Tours\nMember Event\nPittsburgh’s Hidden History\nRauh Jewish Archives\nSanta at the History Center\nVirtual Option Available\n\nLocation\n\nAll Locations\nHeinz History Center\nWestern Pennsylvania Sports Museum\nFort Pitt Museum\nMeadowcroft Rockshelter and Historic Village\nOther\n\nMonth\n\nAll Months\nOctober 2025\nNovember 2025\n\nSubmit\n\n- October 5\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Walk in Penn’s Woods](https://www.heinzhistorycenter.org/event/walk-in-penns-woods-2025/)\n\nTake a walk in Penn’s Woods with Meadowcroft.\n\n- October 7\n\nHeinz History Center –\n5:30 PM\n\n### [Fall Educator Open House](https://www.heinzhistorycenter.org/event/fall-educator-open-house/)\n\nExplore the museum and learn about History Center teacher resources.\n\nTickets Required\n\n- October 11\n\nFort Pitt Museum –\n1:00 PM\n\n### [Speaker Saturday: Overshadowed by These Occult Influences](https://www.heinzhistorycenter.org/event/speaker-saturday-overshadowed-by-these-occult-influences/)\n\nJoin the Fort Pitt Museum to learn about the hidden beliefs that lingered in the Ohio Valley.\n\n- October 16\n\nHeinz History Center –\n6:30 PM\n\n### [Hidden History Trivia Night](https://www.heinzhistorycenter.org/event/hidden-history-trivia-night-10162025/)\n\nIt’s a dark and stormy trivia night in Pittsburgh…with a spooky twist!\n\nTickets Required\n\n- October 18\n\nHeinz History Center –\n8:30 AM\n\n### [Act 48: Preparing Students for America’s 250th](https://www.heinzhistorycenter.org/event/act-48-preparing-students-for-americas-250th/)\n\nJoin the Learning Team to learn primary sources strategies for your classroom.\n\nTickets Required\n\n- October 18\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Archaeology Day](https://www.heinzhistorycenter.org/event/archaeology-day-2025/)\n\nDig into the past at Meadowcroft’s Archaeology Day!\n\n- October 26\n\nHeinz History Center –\n10:00 AM\n\n### [Haunted History Center Halloween](https://www.heinzhistorycenter.org/event/haunted-history-center-halloween/)\n\nStep inside the History Center for a spooktacular day of tricks, treats, and ghoulishly grand fun!\n\nTickets Required\n\n- October 26\n\nHeinz History Center –\n2:00 PM\n\n### [“Hurdle-isms” Book Talk with Clint Hurdle](https://www.heinzhistorycenter.org/event/hurdle-isms-book-talk-with-clint-hurdle-10262025/)\n\nJoin former Pittsburgh Pirates manager Clint Hurdle for the launch of his book, “Hurdle-isms.”\n\nTickets Required\n\n- November 13\n\nHeinz History Center –\n6:30 PM\n\n### [Hidden History Trivia Night](https://www.heinzhistorycenter.org/event/hidden-history-trivia-night-11132025/)\n\nIt’s a trivia night in Pittsburgh!\n\nTickets Required\n\n- November 22\n\nMeadowcroft Rockshelter and Historic Village –\n10:00 AM\n\n### [Meadowcroft’s Taffy Pull & Fall Celebration](https://www.heinzhistorycenter.org/event/meadowcrofts-taffy-pull-fall-celebration-2025/)\n\nWrap up the season with a sweet celebration at Meadowcroft!", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.237569", "metadata": {"original_content_length": 6169, "cleaned_content_length": 3339, "word_count": 377, "char_count": 3339, "description": "Learn more about upcoming programs and events at our family of museums.", "event_time": "10:00 AM"}}
{"url": "https://www.heinzhistorycenter.org/event/haunted-history-center-halloween/", "title": "Haunted History Center Halloween - Heinz History Center", "content": "# Haunted History Center Halloween\n\n## Event Information\n\nDate & Time\n\nSunday, Oct. 26, 2025\n\n10:00 AM\n\nLocationHeinz History Center [1212 Smallman Street\\\\\n\\\\\nPittsburgh PA, 15222](https://www.google.com/maps/place/?q=place_id:ChIJr7aBzePzNIgRi2Dp2ZCFmUY)\n\nTicketingFREE for Kids!\n\nIncluded with admission\n\nCategories\n\n- [Annual Events](https://www.heinzhistorycenter.org/events/?filters[category]=annual-events#filter_results)\n- [Kids & Families](https://www.heinzhistorycenter.org/events/?filters[category]=kids-families#filter_results)\n\nRegister [Register](https://my.heinzhistorycenter.org/orders/558/tickets?eventId=64babd55351d6b414477592b&cdEventIds=64babd55351d6b414477592b&date=2025-10-26T10:00:00-04:00)\n\nStep inside the History Center for a spooktacular day of tricks, treats, and ghoulishly grand fun!\n\nOn Sunday, Oct. 26, the museum will transform into a Halloween wonderland packed with family-friendly festivities.\n\nThe sweetest treat of all – kids ages 17 and under always receive FREE admission to the History Center, supported by the Kamin “Free for Kids” Initiative.\n\nLittle ghouls, goblins, and ghosts can embark on a haunted scavenger hunt that leads them to trick-or-treat stations across all six floors of exhibitions. While collecting candy and clues, families can explore the Scary Pittsburgh section of _**Pittsburgh’s Hidden History**_ and cross paths with costumed spirits roaming the galleries. Afterwards, kids can create their own creepy mask inspired by the exhibit.\n\nAt 11 a.m. and 1 p.m., gather for Spooky Storytime with folklorist Thomas White, who will share eerie tales and legends from Pittsburgh’s past. Perfect for kids ages 6 to 12, these sessions will bring local folklore to life in a fun, not-too-scary way.\n\nThroughout the program, families can also enjoy nonstop Halloween activities. Kids can show off their monster side with freaky face painting and temporary tattoos, strike a pose in the photo booth to capture the day’s memories, and collect a free, special edition orange pickle pin!\n\nPlus, don’t forget to step outside for a chillingly fun sip from The Coffin Bean & Co., a mobile coffee bar pulled by a hearse that will be serving themed drinks.\n\nWith candy, crafts, costumes, and surprises around every corner, frightful fun awaits on every floor. Don’t ghost us — reserve your tickets today!\n\n## [Get Tickets (Before They Disappear)](https://my.heinzhistorycenter.org/orders/558/tickets?eventId=64babd55351d6b414477592b&cdEventIds=64babd55351d6b414477592b&date=2025-10-26T10:00:00-04:00)   Spooktacular Schedule\n\n**10 a.m. to 2 p.m. \\| Museum Activities**\n\n- **Halloween Mask-Making** – Create your own creepy-cool mask inspired by Pittsburgh’s Hidden History.\n- **Fang-tastic Face Painting & Temporary Tattoos** – Transform into a monster, ghoul, or ghost with a frightful new look.\n- **Oh Snap! Photo Booth** – Say BOO and snap a photo with your costumed crew!\n- **Ghostly Encounters** – Meet spirits of Pittsburgh’s past as they roam the museum.\n- **Trick-or-Treat Scavenger Hunt** – Follow the clues and collect treats at stations throughout six floors of exhibits.\n- **Wicked Artifacts & Archival Materials** – Peek inside the Detre Library & Archives to see historic cemetery maps, “Night of the Living Dead” materials, and family photos from Halloweens past in Pittsburgh.\n- **The Coffin Bean & Co Truck** – Grab a bone-chilling sip from The Coffin Bean & Co, a mobile coffee bar pulled by a hearse, outside the museum.\n\n**11 a.m. and 1 p.m. \\| Spooky Storytime (Multipurpose Room, 3rd floor)**\n\n- **Spooky Storytime** – Gather ‘round for chilling tales and eerie legends from Pittsburgh’s past, designed for kids ages 6–12.\n\n## [RESERVE TICKETS, IF YOU DARE](https://my.heinzhistorycenter.org/orders/558/tickets?eventId=64babd55351d6b414477592b&cdEventIds=64babd55351d6b414477592b&date=2025-10-26T10:00:00-04:00)   Admission\n\nRegular admission rates apply for adults. Kids ages 17 and under always receive free admission at the History Center through the [Kamin “Free for Kids” Initiative](https://www.heinzhistorycenter.org/families/kamin-family-legacy/). Please note that tickets are still required for all guests, and we strongly recommend reserving in advance online.\n\n**Costumes are encouraged, but for everyone’s safety, please leave masks and toy weapons at home.**\n\nQuestions creeping up? Send them to [programs@heinzhistorycenter.org](mailto:programs@heinzhistorycenter.org) … if you dare!", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.237569", "metadata": {"original_content_length": 4748, "cleaned_content_length": 4464, "word_count": 575, "char_count": 4464, "description": "Step inside the History Center for a spooktacular day of tricks, treats, and ghoulishly grand fun!", "event_date": "Oct. 26, 2025", "event_time": "10:00 AM"}}
{"url": "https://www.heinzhistorycenter.org/about/work-with-us/internship-application/", "title": "Internship Application - Heinz History Center", "content": "# Internship Application\n\nThe History Center, Meadowcroft, and Fort Pitt Museum offer seasonal internships. [Find more information on internships here.](https://www.heinzhistorycenter.org/about/work-with-us/#internships)\n\nIf you are interested in an internship, please fill out the form below. In addition to completing the information below, candidates should also send a resume and cover letter to internships@heinzhistorycenter.org.\n\n## Apply for an Internship\n\n### Your Information\n\nName(Required)\n\nFirstMiddleLast\n\nPronouns\n\nExamples: she/her, he/him, they/them\n\nEmail(Required)\n\nAddress(Required)\n\nStreet AddressAddress Line 2CityAlabamaAlaskaAmerican SamoaArizonaArkansasCaliforniaColoradoConnecticutDelawareDistrict of ColumbiaFloridaGeorgiaGuamHawaiiIdahoIllinoisIndianaIowaKansasKentuckyLouisianaMaineMarylandMassachusettsMichiganMinnesotaMississippiMissouriMontanaNebraskaNevadaNew HampshireNew JerseyNew MexicoNew YorkNorth CarolinaNorth DakotaNorthern Mariana IslandsOhioOklahomaOregonPennsylvaniaPuerto RicoRhode IslandSouth CarolinaSouth DakotaTennesseeTexasUtahU.S. Virgin IslandsVermontVirginiaWashingtonWest VirginiaWisconsinWyomingArmed Forces AmericasArmed Forces EuropeArmed Forces PacificStateZIP Code\n\n### School Information\n\nName of University or College(Required)\n\nMajor(Required)\n\nMinor\n\nDegree you will be obtaining(Required)\n\nAnticipated Graduation Date\n\nMM slash DD slash YYYY\n\nFaculty Contact(Required)\n\nName of High School(Required)\n\nCity & State of High School(Required)\n\n### Internship Information\n\nThe Heinz History Center offers Fall, Spring, and Summer semester internships. Please write the semester and year of your preferred internship term.\n\nIs this internship for credit?\n\nYes\n\nNo\n\nA minimum of 120 hours per semester is needed to qualify as an intern.\n\nIf yes, how many hours for the semester?\n\nNumber of hours available to work per week\n\n### Essay Questions\n\nPlease answer all of these questions in order to be considered for a History Center internship.\n\nChoose which division or department you would like to work with.(Required)\n\nPlease choose one from the listMarketing & CommunicationsEducationLibrary & ArchivesRauh Jewish History Program & ArchivesMuseum - CuratorialMuseum - CollectionsPublicationsAfrican American ProgramItalian American ProgramFort Pitt MuseumMeadowcroft Rockshelter and Historic Village\n\nDescribe why you are interested in the division or department you chose above.(Required)\n\nPlease list any courses taken which have prepared you for this internship.(Required)\n\nPlease list any specialized skills that could be applicable to work with the History Center.(Required)\n\nWhy are you interested in an internship with the History Center specifically?(Required)\n\nWhat do you expect to gain from your internship experience? What do you hope to contribute to the organization?(Required)\n\nPlease explain how an internship with the Heinz History Center fits with your specific academic and/or career goals.(Required)\n\nDate\n\nMM slash DD slash YYYY\n\nCAPTCHA\n\nreCAPTCHA\n\nRecaptcha requires verification.\n\nI'm not a robot\n\nreCAPTCHA is changing its terms of service. [Take action.](https://google.com/recaptcha/admin/migrate)\n\nreCAPTCHA\n\n[Privacy](https://www.google.com/intl/en/policies/privacy/) \\- [Terms](https://www.google.com/intl/en/policies/terms/)\n\nPlease note that in order to be considered for an internship, all applicants must email a resume and cover letter to [rafalbo@heinzhistorycenter.org](mailto:rafalbo@heinzhistorycenter.org).", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.239502", "metadata": {"original_content_length": 3503, "cleaned_content_length": 3503, "word_count": 392, "char_count": 3503, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/visit/", "title": "Visit - Heinz History Center", "content": "# It’s a beautiful day at our family of museums.\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/visit/#page_content)\n\nExplore This SectionClose\n\n## Plan your visit today.\n\n- [![A brightly lit, blue-colored castle model with rounded towers and arched windows displayed indoors; the structure is designed in a playful, whimsical style, and a small puppet or character is visible standing on one of the balconies.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/MicrosoftTeams-image-15-100x100.png)\\\\\n\\\\\n**Heinz History Center** \\\\\n\\\\\n10 AM - 5 PM](https://www.heinzhistorycenter.org/visit/heinz-history-center/)\n- [![A wax figure of a Black baseball player dressed in a vintage catcher’s uniform holds a mitt and baseball in a throwing pose; multiple baseballs and wooden bats are displayed on shelves in the background at a museum exhibit.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/SportsMuseum_WPSM_281216_AnnieONeill10-100x100.jpg)\\\\\n\\\\\n**Western Pennsylvania Sports Museum** \\\\\n\\\\\n10 AM - 5 PM](https://www.heinzhistorycenter.org/visit/sports-museum/)\n- [![Four men in historical military uniforms stand beside a cannon as it fires, releasing white smoke. They are participating in a reenactment on a grassy field with tents and various equipment visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/MicrosoftTeams-image-17-100x100.png)\\\\\n\\\\\n**Fort Pitt Museum** \\\\\n\\\\\n10 AM - 5 PM](https://www.heinzhistorycenter.org/visit/fort-pitt/)\n- [![A modern building with wooden slats and a slanted roof is built into a lush, green forest hillside. People walk up stairs and ramps toward the entrance, surrounded by tall trees and dense foliage.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/06/Meadowcroft-Rockshelter-exterior-100x100.jpg)\\\\\n\\\\\n**Meadowcroft Rockshelter and Historic Village** \\\\\n\\\\\n10 AM - 4 PM](https://www.heinzhistorycenter.org/visit/meadowcroft/)\n\nThe Heinz History Center is committed to providing exhibits, programs, and public spaces that are inclusive and accessible for all visitors.\n\n[Accessibility Information](https://www.heinzhistorycenter.org/visit/accessibility/)\n\n## Preserving Pittsburgh’s Memories\n\nDetre Library & Archives\n\nHeinz History Center\n\nResearch family history, explore historic images, and search thousands of documents in the Detre Library & Archives at the History Center. Open Wednesday through Saturday and free for researchers.\n\n[Plan your research visit](https://www.heinzhistorycenter.org/research/detre-library-archives/)\n\n## The Museum Shop\n\nShop\n\nThe History Center Museum Shop is your one-stop shop for all things Pittsburgh. From Heinz 57 to “Mister Rogers’ Neighborhood,” browse hundreds of one-of-a-kind gifts ranging from classic to quirky. The Museum Shop is open seven days a week during regular museum hours, and always open online.\n\n[Shop now](https://shop.heinzhistorycenter.org/)\n\nOur museums have implemented extensive health and sanitation measures to ensure a safe and enjoyable experience for visitors and staff.\n\n[Health & Safety Information](https://www.heinzhistorycenter.org/visit/health-safety/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.239502", "metadata": {"original_content_length": 3980, "cleaned_content_length": 3165, "word_count": 362, "char_count": 3165, "description": "", "event_time": "10 AM - 5 PM"}}
{"url": "https://www.heinzhistorycenter.org/visit/fort-pitt/", "title": "Fort Pitt Museum - Heinz History Center", "content": "fort\\_pitt\\_web\\_hero.mov (1080p).mp4 from Heinz History Center on Vimeo\n\nPlaying in picture-in-picture\n\nPause\n\nPicture-in-Picture\n\nPlay VideoPause Video\n\n# Get to the Point of Pittsburgh History\n\n[Skip Sub Navigation](https://www.heinzhistorycenter.org/visit/fort-pitt/#page_content)\n\nExplore This SectionClose\n\nDiscover the world-shaping events that occurred right here in Pittsburgh at the Fort Pitt Museum, located within Point State Park.\n\nThe Fort Pitt Museum tells the story of Western Pennsylvania’s pivotal role during the French & Indian War, the American Revolution, and as the birthplace of Pittsburgh through interactive exhibitions, life-like figures, and 18th-century artifacts.\n\nDuring the summer months, you can witness living history in Point State Park as the Fort Pitt Museum’s colonial reenactors demonstrate how life was lived during the 1700s.\n\n## Hours & Location\n\n- Address: **Point State Park, 601 Commonwealth Pl, Pittsburgh, PA 15222**, in the heart of Downtown Pittsburgh.\n- Hours: Daily from **10 a.m. to 5 p.m**.\n- Holiday Closures: New Year’s Day, Easter, Thanksgiving, and Christmas.\n- Follow the footpath entrance to Point State Park, via Commonwealth Place, crossing under the portal bridge.\n\n## Admission\n\n### **Always Free for Kids!**\n\nThanks to a transformative gift from longtime supporters Daniel G. and Carole L. Kamin, the Heinz History Center now offers free admission for all kids year-round!\n\nThe [Kamin “Free for Kids” Initiative](https://www.heinzhistorycenter.org/families/kamin-family-legacy/) includes free museum entry for all children aged 17 and under and cover admission costs for all school groups.\n\n## Learn More About Fort Pitt Museum\n\nThe Fort Pitt Museum, located in historic Point State Park in downtown Pittsburgh, is a two-floor, 12,000-square-foot museum that tells the story of Western Pennsylvania’s pivotal role during the French & Indian War, the American Revolution, and as the birthplace of Pittsburgh.\n\nThe strategic location of the fort – at the Forks of the Ohio River – helped to shape the course of American and world history.\n\nFirst opened in 1969 in a reconstructed bastion, the Fort Pitt Museum provides visitors with a rich understanding of the world-changing events that occurred right here in Western Pennsylvania.\n\nThrough interactive exhibitions, life-like historical figures, and recently added artifacts, visitors will learn the important role our region played in shaping the United States.\n\n## What's On at Fort Pitt?\n\nFort Pitt Museum\n\nGet the inside scoop on featured exhibits and events at the museum.\n\n[What’s On](https://www.heinzhistorycenter.org/whats-on/fort-pitt)\n\n## The Shop at Fort Pitt\n\nThe Fort Pitt Museum Shop is your one-stop shop for quirky colonial gifts. The Museum Shop is open 24/7 online, and seven days a week during regular museum hours.\n\n[Explore the Shop](https://shop.heinzhistorycenter.org/collections/fort-pitt-museum)\n\n## Fort Pitt Block House\n\nThe Fort Pitt Museum’s historic neighbor is the Fort Pitt Block House, owned and maintained by the Pittsburgh Chapter of the National Society Daughters of the American Revolution. The Block House is not affiliated with the Fort Pitt Museum or the Heinz History Center.\n\n[Learn More](http://www.fortpittblockhouse.com/)\n\n- October 11\n\nFort Pitt Museum –\n1:00 PM\n\n### [Speaker Saturday: Overshadowed by These Occult Influences](https://www.heinzhistorycenter.org/event/speaker-saturday-overshadowed-by-these-occult-influences/)\n\nJoin the Fort Pitt Museum to learn about the hidden beliefs that lingered in the Ohio Valley.\n\n[View All Events](https://www.heinzhistorycenter.org/events/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.239502", "metadata": {"original_content_length": 5604, "cleaned_content_length": 3645, "word_count": 504, "char_count": 3645, "description": "Discover the world-shaping events that occurred right here in Pittsburgh at the Fort Pitt Museum, located within Point State Park."}}
{"url": "https://www.heinzhistorycenter.org/visit/fort-pitt/directions-parking/", "title": "Directions & Parking - Heinz History Center", "content": "# Directions & Parking\n\nThe Fort Pitt Museum is located in Point State Park in the heart of Downtown Pittsburgh. The museum is most accessible by walking through the entrance to Point State Park (via Commonwealth Place) and crossing under the portal bridge.\n\n## Parking\n\nThe Fort Pitt Museum does not own or operate any nearby parking lots, but a variety of metered parking spaces and several garages are available in Downtown Pittsburgh, all within a half-mile walk of the museum:\n\n- [Boulos Parking Lot](https://www.parkme.com/lot/81638/boulos-parking-lot-pittsburgh-pa) (temporarily closed)\n- [Gateway Parking Garage](https://parkpgh.org/lots/10)\n- [Stanwix Street Garage](https://alcoparking.com/lot-garage/11-stanwix-street-garage/)\n- [Wood-Allies Garage](http://www.pittsburghparking.com/wood-allies)\n- [Monongahela Parking Wharf](https://www.pittsburghparking.com/Facilities/Monongahela-Wharf)\n- [Fort Duquesne and Sixth Avenue Garage](https://www.pittsburghparking.com/Facilities/Ft.-Duquesne-Sixth-Garage)\n- [Third Avenue Garage](https://www.pittsburghparking.com/Facilities/Third-Avenue-Garage)\n- [Wood-Allies Garage](https://www.pittsburghparking.com/Facilities/Wood-Allies-Garage)\n- [Smithfield Liberty Garage](https://www.pittsburghparking.com/Facilities/Smithfield-Liberty-Garage)\n\n## Map & Driving Directions\n\nOur address for your GPS: Point State Park, 601 Commonwealth Pl, Pittsburgh, PA 15222", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.239502", "metadata": {"original_content_length": 1617, "cleaned_content_length": 1410, "word_count": 139, "char_count": 1410, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/policies/", "title": "Policies - Heinz History Center", "content": "# Policies\n\nUse this page to view our [Privacy Policy](https://www.heinzhistorycenter.org/policies/#privacy-policy), [Social Media Policy](https://www.heinzhistorycenter.org/policies/#social-media-policy) and [Guest/Events Wireless Access Policy](https://www.heinzhistorycenter.org/policies/#GuestEventsWirelessAccess).\n\n## Privacy Policy\n\nA COMMITMENT TO YOUR PRIVACY\n\nYour privacy is very important to us. To better protect your privacy our policies below explain the information we collect, how it is used, how it is safeguarded, and how to contact us if you have any concerns.\n\nWHAT INFORMATION IS COLLECTED:\n\n_Online Shop, Ticket Purchases, and Event Registrations_\n\nWhen you make a purchase from the History Center Museum Shop, buy tickets online, or register for our events, we require your name, billing and shipping addresses, telephone number, email address, and credit card information in order to process your order. Your credit card information will be used only as needed to process your transaction. We work to ensure that such transactions utilize SSL (Secure Socket Layer) encryption. SSL technology, an industry standard, is designed to prevent someone other than operators of our Site from capturing and viewing your Personal Information. Since any order information you provide to us on our Site will be transmitted using a secure connection, if your Web browser cannot support this level of security, you will not be able to order products through our Site. Unfortunately, no data transmission over the Internet is 100% secure. While we strive to protect your information as much as possible, we cannot ensure or warrant the security of that information.\n\n_Online Memberships and Donations_\n\nWhen you purchase a History Center membership or make an online donation, we ask you to provide us with the information we need to process your membership and/or to acknowledge your contribution. This information includes your name, billing and shipping addresses, telephone number, email address and credit card information. Your credit card information will be used only as needed to process your transaction. We work to ensure that such transactions utilize SSL (Secure Socket Layer) encryption. SSL technology, an industry standard, is designed to prevent someone other than operators of our Site from capturing and viewing your Personal Information. Since any order information you provide to us on our Site will be transmitted using a secure connection, if your Web browser cannot support this level of security, you will not be able to order products through our Site. Unfortunately, no data transmission over the Internet is 100% secure. While we strive to protect your information as much as possible, we cannot ensure or warrant the security of that information.\n\n_Online Surveys_\n\nFrom time to time, we may invite you to participate in surveys posted on our website or sent to you by email. You may decide whether or not you wish to complete such surveys, which may ask about your background, opinions or similar questions. We use this information to help us better understand our audience, which in turn allows us to better meet your needs and interests.\n\n_History Center E-Newsletter_\n\nAs a service, the History Center offers the opportunity to subscribe to our e-newsletter. If you choose to subscribe, you will receive these newsletters. You may subscribe or unsubscribe at any time by following the e-newsletter instructions.\n\n_Children Eighteen Years Old and Younger_\n\nThe Heinz History Center does not solicit personal information from children. Visitors 18 years of age and under should remember that they are required to obtain an adult’s permission before submitting any personal information to this or any other website.\n\n_On-site Purchases, Donations, and Other Transactions_\n\nWhen you make a purchase from the Heinz History Center, Meadowcroft Rockshelter and Historic Village or the Fort Pitt Museum, any information gathered is used only as needed to process your transaction. While we strive to protect your information as much as possible, we cannot ensure or warrant the security of that information.\n\nDISCLOSURE OF PERSONAL INFORMATION\n\nThe History Center does not sell or rent any information to third parties. This applies to all donor information, including transactions both online and on-site. Periodically we do trade donor lists with other similar non-profit organizations that might be of interest to you. These trades may include your name, postal address, email address, and phone number.\n\nDonors and others may choose to opt out of these trades and their names will be removed from such lists within 48 hours.\n\nIf you would like to opt out or if you have comments or questions regarding the History Center’s Privacy Policy, please contact us at development@heinzhistorycenter.org.\n\nINFORMATION COLLECTED AUTOMATICALLY\n\nThe History Center may automatically collect information relating to visitors when they access our website. This information may include information on how you use our website, what pages you have visited, or any errors that occurred while you were visiting our sites. This information may be used to help us in developing content and improving our website to create the best experience for our visitors. In addition to information collected automatically, we may also utilize cookies, i.e. small files sent to your browser by our website when you visit. Cookies can be used to track usage patterns, trends and visitor behavior, as well as to record other information regarding your visit. Information that we collect from cookies will only be used in aggregate form.\n\nUSE AND DISCLOSURE OF THE INFORMATION WE COLLECT ON THE HISTORY CENTER WEBSITE\n\nThe History Center uses the personal information you provide to us for internal purposes, such as filling and tracking your order, analyzing trends and collecting statistics. The History Center may also compile and provide aggregate statistics about our visitors, customers, sales, traffic patterns and related site information to third parties, but these statistics will not include any personally identifying information.\n\nThe History Center may release account information when such release is reasonably necessary to comply with the law; enforce the terms of any of our user agreements; or protect the rights, property and safety of the History Center, the users of its site or others.\n\nIf you have provided us with your email address, we may send you emails in order to inform you of events or activities that we believe may be of interest to you, or to alert you about sales or other promotions. If you would like to opt out from these communications, these emails include an “Unsubscribe” option that you may select.\n\nCHANGES TO PRIVACY POLICY\n\nThis Privacy Policy may change from time to time. The History Center reserves the right to change it without notice.\n\n_Last updated July 2022_\n\n## Social Media Policy\n\nThe Senator John Heinz History Center is an educational institution that engages and inspires large and diverse audiences through programs that enable links to the past, understanding in the present, and guidance for the future by preserving regional history and presenting the American experience with a Western Pennsylvania connection.\n\nWe encourage visitors to the History Center, Sports Museum, Fort Pitt Museum, and Meadowcroft to share their experiences on social media. We strive to ensure that our social media channels provide a public forum for respectful discussion and dialogue.\n\n- The use of threatening language, harassment, racism, bullying, profanity, attacks on or intimidation of any party, including our online community members or the History Center’s staff; malicious speech regarding topics of gender, sexual orientation, religion, gender identity, age, ethnic origin or race; sexist comments; hate speech; suggestion or encouragement of illegal activities; and demeaning remarks about personal appearance.\n- Failure to provide appropriate explanatory context for any links, photos, and videos you post.\n- Repeated posts to our Facebook wall, which may be treated as spam and deleted; repeat offenders may be banned.\n- Information that is false, inaccurate, or misleading.\n- The inclusion of third-party intellectual property, such as any copyright-protected material, trademarks or logos and/or any violations of rights of publicity or privacy\n- The solicitation or marketing of products or services.\n- Spam, malicious, or fraudulent links.\n\nPlease note: the Heinz History Center reserves the right to ban repeat offenders from posting on our social media platforms.\n\nBy posting, commenting, or replying on one of our posts on our social media channels or on our website’s blog, you are agreeing to abide by this policy and that of the particular platform you are utilizing.\n\nThe History Center’s social media policy is designed to provide our online community with a positive experience on our platforms. We hope you find our social content to be educational, thought-provoking, and inspiring.\n\nWe encourage you to contact us at socialmedia@heinzhistorycenter.org with any issues, questions, or suggestions on how we can improve your social media experience.\n\nThis Social Media Policy may change from time to time. The Heinz History Center reserves the right to change it without notice.\n\n_Last updated July 2022_\n\n## Guest/Events Wireless Access: Terms of Use for All Sites\n\nThe Guest/Events Wireless service provided by the Heinz History Center is a public wireless network with no guarantee of secure, confidential, or private transmission of data for any user of this service. There is also no guarantee of quality or reliability of service of the HHC Guest/Events Wireless networks or services.\n\nBy connecting your device to this Wireless Service and its underlying infrastructure, you agree to engage in good faith use of the service only, and you agree to never utilize the service for any illegal, obscene, intrusive, or unauthorized activities, including but not limited to hacking, distribution of web threats (e.g. Trojan horses, computer ‘worms,’ viruses, infected code, etc.), sending of non-solicited messages, information gathering (e.g. port scans), distribution of threats, accessing of obscene or indecent materials, accessing pornography of any kind, etc.\n\nAdditionally, you agree to hold harmless the provider/owner of this network, and the staff of the provider/owner of this network, for any actions that may occur or transpire during your use of or because of your use of this service, including but not limited to interception of data transmitted or misuse of any of your personal information on the public Internet by third parties.\n\nAs a reminder, there is no guarantee of quality of service or consistent bandwidth/Internet access on this service. You understand that at any time, your connection may be disrupted or dropped without any prior notification. This is a public, unsecured network designed only for temporary utilization. Additionally, the SSID name of the Guest/Events Wireless service at the Heinz History Center is subject to change without notice.\n\n_Last updated Dec. 2024_", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.244154", "metadata": {"original_content_length": 11397, "cleaned_content_length": 11182, "word_count": 1715, "char_count": 11182, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/visit/accessibility/", "title": "Accessibility - Heinz History Center", "content": "# Accessibility\n\nThe Heinz History Center is committed to providing exhibits, programs, and public spaces that are inclusive and accessible for all visitors.\n\n**View accessibility information for:**\n\n- [History Center and Sports Museum](https://www.heinzhistorycenter.org/visit/accessibility#historycenter)\n- [Fort Pitt Museum](https://www.heinzhistorycenter.org/visit/accessibility#fortpitt)\n- [Meadowcroft Rockshelter and Historic Village](https://www.heinzhistorycenter.org/visit/accessibility#meadowcroft)\n\n## Heinz History Center and Sports Museum\n\n### Accessibility Details\n\n- Accessible parking is available in the surrounding [parking lots](https://www.heinzhistorycenter.org/visit/heinz-history-center/directions-parking/).\n- The History Center galleries are wheelchair accessible.\n- Many exhibits have videos with closed captioning and induction loops.\n- Service animals are always welcome. Please see below for our service animals policy.\n- A map of the History Center is available at the admissions desk.\n- Accessible restrooms are located on floors 1, 2, 3, and 6.\n- Visitors are welcome to nurse anywhere they feel comfortable. A private nursing room is located on the 6th floor.\n\n### Additional Services\n\n**Wheelchairs:** A limited number of manual wheelchairs and baby strollers are available to visitors on a first come, first served basis located in the first floor coat room.\n\n**Sensory Bags:** Sensory bags containing fidgets, noise reducing earmuffs and earplugs, sunglasses and a flashlight are available to borrow (at no cost by leaving an ID) on a first come, first served basis in the Museum Shop.\n\n**Assistive Listening Devices (ALDs):** The History Center offers personal amplification systems for all General Public and Adult tours as well as all Public Programs such as talks and lectures. Our ALDs consist of a single earpiece and a receiver and are also compatible with T-coil equipped hearing aids. ALDs are available to borrow at no cost by leaving an ID.\n\n**Sign language:** Sign language interpreters are available for tours and programs with advance notice to ensure availability. To schedule a sign language interpreter, please contact the group tour coordinator at 412-454-6304 or reservations@heinzhistorycenter.org.\n\n**Support staff:** The History Center will grant free admission to any therapeutic staff support, counselor, doctor, therapist, or nurse that accompanies a visitor.\n\n### Service Animal Policy\n\nService animals are always welcome at the Heinz History Center, Fort Pitt Museum, and the Meadowcroft Rockshelter and Historic Village.\n\nDogs are the only animals recognized as service animals by federal and state law. Service animals are individually trained to do work or perform tasks for people with disabilities and must be under control at all times by the owner. Service animals must be harnessed, leashed, or tethered, unless these devices interfere with the service animal’s work or the individual’s disability prevents using these devices. In that case, the individual must maintain control of the animal through voice, signal, or other effective controls. The owner of a service animal may be asked to remove the animal from the premises if they do not take effective action to control the animal.\n\nThe Heinz History Center, Fort Pitt Museum, and the Meadowcroft Rockshelter and Historic Village abide by the Americans with Disabilities Act (ADA) definition of service animals. However, animals such as “comfort animals,” “therapy animals,” “companion animals” or “emotional support animals” are not service animals as defined by the ADA, because they are not trained to perform a specific task for an individual with a disability. Therefore, these animals are not permitted entry into our family of museums.\n\nFor more information, please contact [visitorservices@heinzhistorycenter.org](mailto:visitorservices@heinzhistorycenter.org).\n\n[Back to Top](https://www.heinzhistorycenter.org/visit/accessibility/)\n\n## Fort Pitt Museum\n\nThe Fort Pitt Museum is located within Point State Park in downtown Pittsburgh. [View accessibility information for Point State Park.](https://www.dcnr.pa.gov/StateParks/FindAPark/PointStatePark/Pages/default.aspx)\n\n### Accessibility Details\n\n- Accessible parking is available in the surrounding parking lots.\n- An ADA push button door opener is installed at the museum’s entrance.\n- The Fort Pitt Museum galleries are wheelchair accessible.\n- An elevator is located next to the stairwell on the museum’s first floor.\n- Two videos with closed captioning, one on the causes of the French and Indian War and another on the American Revolution in the West, are located in the museum’s second floor gallery.\n- Service animals are always welcome. Please see below for our service animal policy.\n- Accessible restrooms are located on the first floor.\n- Visitors are welcome to nurse anywhere they feel comfortable.\n\n### Additional Services\n\n**Wheelchairs:** A manual wheelchair is available to visitors on a first come, first served basis. It is located in the 1st floor coat room.\n\n**Support staff:** The Fort Pitt Museum will grant free admission to any therapeutic staff support, counselor, doctor, therapist, or nurse that accompanies a visitor.\n\n### Service Animal Policy\n\nService animals are always welcome at the Heinz History Center, Fort Pitt Museum, and the Meadowcroft Rockshelter and Historic Village.\n\nDogs are the only animals recognized as service animals by federal and state law. Service animals are individually trained to do work or perform tasks for people with disabilities and must be under control at all times by the owner. Service animals must be harnessed, leashed, or tethered, unless these devices interfere with the service animal’s work or the individual’s disability prevents using these devices. In that case, the individual must maintain control of the animal through voice, signal, or other effective controls. The owner of a service animal may be asked to remove the animal from the premises if they do not take effective action to control the animal.\n\nThe Heinz History Center, Fort Pitt Museum, and the Meadowcroft Rockshelter and Historic Village abide by the Americans with Disabilities Act (ADA) definition of service animals. However, animals such as “comfort animals,” “therapy animals,” “companion animals” or “emotional support animals” are not service animals as defined by the ADA, because they are not trained to perform a specific task for an individual with a disability. Therefore, these animals are not permitted entry into our family of museums.\n\n[Back to Top](https://www.heinzhistorycenter.org/visit/accessibility/)\n\n## Meadowcroft Rockshelter and Historic Village\n\nMeadowcroft Rockshelter and Historic Village is committed to providing exhibits, programs, and public spaces that are inclusive and accessible for all visitors.\n\n### Accessibility Details\n\n- Accessible parking is available directly in front of the Visitor Center.\n- The Visitor Center is wheelchair accessible, although there are no automatic doors on site.\n- Service animals are always welcome. Please see below for our service animal policy.\n- A map of the Meadowcroft site is available at the admissions desk.\n- Accessible restrooms are located in the Visitor Center.\n- Visitors are welcome to nurse anywhere they feel comfortable.\n\n### Meadowcroft Rockshelter\n\nThe Meadowcroft Rockshelter is located in the sandstone cliff face almost 50 feet above Cross Creek. Current access to the site is provided by a set of stairs that lead to the main observation platform (65 steps) and another set of stairs which lead to a smaller observation area at the north end of the excavation (25 more steps).\n\nFor our visitors who are unable to ascend the steps, the video program shown at the Rockshelter is also available upon request in the accessible Visitor Center. In addition, an interactive kiosk in the Visitor Center allows visitors to virtually explore the archaeological excavation in great detail using GigaPan image technology.\n\n### Additional Services\n\n**Wheelchairs:** A limited number of manual wheelchairs are available to visitors on a first come, first served basis located in the Visitor Center.\n\n**Support staff:** Meadowcroft will grant free admission to any therapeutic staff support, counselor, doctor, therapist, or nurse that accompanies a visitor.\n\n### Service Animal Policy\n\nService animals are always welcome at the Heinz History Center, Fort Pitt Museum, and the Meadowcroft Rockshelter and Historic Village.\n\nDogs are the only animals recognized as service animals by federal and state law. Service animals are individually trained to do work or perform tasks for people with disabilities and must be under control at all times by the owner. Service animals must be harnessed, leashed, or tethered, unless these devices interfere with the service animal’s work or the individual’s disability prevents using these devices. In that case, the individual must maintain control of the animal through voice, signal, or other effective controls. The owner of a service animal may be asked to remove the animal from the premises if they do not take effective action to control the animal.\n\nThe Heinz History Center, Fort Pitt Museum, and the Meadowcroft Rockshelter and Historic Village abide by the Americans with Disabilities Act (ADA) definition of service animals. However, animals such as “comfort animals,” “therapy animals,” “companion animals” or “emotional support animals” are not service animals as defined by the ADA, because they are not trained to perform a specific task for an individual with a disability. Therefore, these animals are not permitted entry into our family of museums.\n\n[Back to Top](https://www.heinzhistorycenter.org/visit/accessibility/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.244154", "metadata": {"original_content_length": 10154, "cleaned_content_length": 9788, "word_count": 1427, "char_count": 9788, "description": "The Heinz History Center is committed to providing exhibits, programs, and public spaces that are inclusive and accessible for all visitors."}}
{"url": "https://www.heinzhistorycenter.org/sitemap/", "title": "Sitemap - Heinz History Center", "content": "# Sitemap\n\n- ## [Visit](https://www.heinzhistorycenter.org/visit/)\n\n- ### [Heinz History Center](https://www.heinzhistorycenter.org/visit/heinz-history-center/)\n\n- #### [Tickets](https://my.heinzhistorycenter.org/orders/558/calendar?cart=true&eventId=64babd55351d6b414477592b&membershipIds=)\n\n- #### [What's On](https://www.heinzhistorycenter.org/whats-on/history-center/)\n\n- #### [Kids & Families](https://www.heinzhistorycenter.org/families/)\n\n- #### [Accessibility](https://www.heinzhistorycenter.org/visit/accessibility/)\n\n- #### [Directions & Parking](https://www.heinzhistorycenter.org/visit/heinz-history-center/directions-parking/)\n\n- #### [Group Tours](https://www.heinzhistorycenter.org/visit/heinz-history-center/group-tours/)\n\n- [Plan a Guided Field Trip](https://www.heinzhistorycenter.org/visit/heinz-history-center/group-tours/plan-a-self-guided-visit/)\n- [Plan a Guided Field Trip](https://www.heinzhistorycenter.org/visit/heinz-history-center/group-tours/plan-a-docent-guided-tour/)\n- ### [Western Pennsylvania Sports Museum](https://www.heinzhistorycenter.org/visit/sports-museum/)\n\n- #### [Tickets](https://my.heinzhistorycenter.org/orders/558/calendar?cart=true&eventId=64babd55351d6b414477592b&membershipIds=)\n\n- #### [What's On](https://www.heinzhistorycenter.org/whats-on/sports-museum/)\n\n- #### [Accessibility](https://www.heinzhistorycenter.org/visit/accessibility/)\n\n- #### [Directions & Parking](https://www.heinzhistorycenter.org/visit/heinz-history-center/directions-parking/)\n\n- #### [Group Tours](https://www.heinzhistorycenter.org/visit/heinz-history-center/group-tours/)\n- ### [Fort Pitt Museum](https://www.heinzhistorycenter.org/visit/fort-pitt/)\n\n- #### [Tickets](https://my.heinzhistorycenter.org/orders/558/calendar?cart=true&eventId=64babe29351d6b41447759c7&membershipIds=)\n\n- #### [What's On](https://www.heinzhistorycenter.org/whats-on/fort-pitt/)\n\n- #### [Accessibility](https://www.heinzhistorycenter.org/visit/accessibility/)\n\n- #### [Directions & Parking](https://www.heinzhistorycenter.org/visit/fort-pitt/directions-parking/)\n\n- #### [Field Trips](https://www.heinzhistorycenter.org/learn/education/fort-pitt-field-trips/)\n\n- #### [Scout Programs](https://www.heinzhistorycenter.org/learn/scout-programs/fort-pitt-scout-programs/)\n- ### [Meadowcroft Rockshelter and Historic Village](https://www.heinzhistorycenter.org/visit/meadowcroft/)\n\n- #### [Tickets](https://my.heinzhistorycenter.org/orders/558/calendar?cart=true&eventId=64babe950cc5e535df6f93d3&membershipIds=)\n\n- #### [What's On](https://www.heinzhistorycenter.org/whats-on/meadowcroft/)\n\n- #### [Accessibility](https://www.heinzhistorycenter.org/visit/accessibility/\\#meadowcroft)\n\n- #### [Directions & Parking](https://www.heinzhistorycenter.org/visit/meadowcroft/directions-parking/)\n\n- #### [Field Trips](https://www.heinzhistorycenter.org/learn/education/meadowcroft-field-trips/)\n- ## [What’s On](https://www.heinzhistorycenter.org/whats-on/)\n\n- ### [Event Calendar](https://www.heinzhistorycenter.org/events/)\n\n- ### [Exhibits](https://www.heinzhistorycenter.org/whats-on/exhibits/)\n\n- ### [Heinz History Center](https://www.heinzhistorycenter.org/whats-on/history-center/)\n\n- #### [History Center Exhibits](https://www.heinzhistorycenter.org/whats-on/history-center/exhibits/)\n\n- #### [History Center Events](https://www.heinzhistorycenter.org/whats-on/history-center/events/)\n- ### [Western Pennsylvania Sports Museum](https://www.heinzhistorycenter.org/whats-on/sports-museum/)\n\n- #### [Sports Museum Exhibits](https://www.heinzhistorycenter.org/whats-on/sports-museum/exhibits/)\n\n- #### [The Immaculate Reception Turns 50](https://www.heinzhistorycenter.org/whats-on/sports-museum/the-immaculate-reception-turns-50/)\n- ### [Fort Pitt Museum](https://www.heinzhistorycenter.org/whats-on/fort-pitt/)\n\n- ### [Meadowcroft Rockshelter and Historic Village](https://www.heinzhistorycenter.org/whats-on/meadowcroft/)\n\n- #### [Exhibitions](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/)\n\n- #### [Events](https://www.heinzhistorycenter.org/whats-on/meadowcroft/events/)\n- ## [Research](https://www.heinzhistorycenter.org/research/)\n\n- ### [Explore Our Collections](https://www.heinzhistorycenter.org/research/explore/)\n\n- ### [Detre Library & Archives](https://www.heinzhistorycenter.org/research/detre-library-archives/)\n\n- #### [Research](https://www.heinzhistorycenter.org/research/detre-library-archives/search-library-and-archives/)\n\n- #### [Research](https://www.heinzhistorycenter.org/research/detre-library-archives/digital-collections/)\n\n- #### [Additional Resources](https://www.heinzhistorycenter.org/research/detre-library-archives/additional-resources/)\n\n- #### [Reproductions](https://www.heinzhistorycenter.org/research/detre-library-archives/reproductions/)\n\n- #### [Programs](https://www.heinzhistorycenter.org/research/detre-library-archives/la-programs/)\n\n- #### [Contact](https://www.heinzhistorycenter.org/research/detre-library-archives/contact/)\n- ### [African American Program](https://www.heinzhistorycenter.org/research/african-american-program/)\n\n- #### [African American Collection](https://www.heinzhistorycenter.org/research/african-american-program/african-american-collection/)\n\n- #### [Statements of Solidarity](https://www.heinzhistorycenter.org/research/african-american-program/statements-of-solidarity/)\n- ### [Rauh Jewish History Program & Archives](https://www.heinzhistorycenter.org/research/rauh-jewish-history-program-archives/)\n\n- #### [Digital Resources](https://www.heinzhistorycenter.org/research/rauh-jewish-history-program-archives/digital-resources/)\n\n- #### [Cornerstone Podcast](https://www.heinzhistorycenter.org/research/rauh-jewish-history-program-archives/cornerstone-podcast/)\n- ### [Italian American Program](https://www.heinzhistorycenter.org/research/italian-american-program/)\n\n- #### [Italian American Collection](https://www.heinzhistorycenter.org/research/italian-american-program/italian-american-collection/)\n\n- #### [Italian American Oral Histories](https://www.heinzhistorycenter.org/research/italian-american-program/italian-american-oral-histories/)\n\n- #### [IDARM Project](https://www.heinzhistorycenter.org/research/italian-american-program/idarm-project/)\n- ### [Publications](https://www.heinzhistorycenter.org/research/publications/)\n\n- #### [Western Pennsylvania History Magazine](https://www.heinzhistorycenter.org/research/publications/western-pennsylvania-history-magazine/)\n\n- #### [Newsletter](https://www.heinzhistorycenter.org/research/publications/newsletter/)\n\n- #### [Books](https://www.heinzhistorycenter.org/research/publications/books/)\n- ### [Contribute to Our Collections](https://www.heinzhistorycenter.org/research/contribute-to-our-collections/)\n\n- #### [Collection Donation Form](https://www.heinzhistorycenter.org/research/contribute-to-our-collections/collection-donation-form/)\n- ## [Join & Give](https://www.heinzhistorycenter.org/give/)\n\n- ### [Become a Member](https://www.heinzhistorycenter.org/join/)\n\n- #### [Membership Types](https://www.heinzhistorycenter.org/?page_id=1533)\n\n- #### [Frequently Asked Questions](https://www.heinzhistorycenter.org/join/frequently-asked-questions/)\n\n- #### [Membership Cards](https://www.heinzhistorycenter.org/?page_id=1542)\n\n- #### [Policies](https://www.heinzhistorycenter.org/?page_id=1539)\n- ### [Make a Donation](https://www.heinzhistorycenter.org/give/make-a-donation/)\n\n- ### [Fundraising Events](https://www.heinzhistorycenter.org/give/fundraising-events/)\n\n- ### [Commemorative Gifts](https://www.heinzhistorycenter.org/give/commemorative-gifts/)\n\n- ### [Planned Giving](https://www.heinzhistorycenter.org/give/planned-giving/)\n\n- ### [Contribute to Our Collections](https://www.heinzhistorycenter.org/research/contribute-to-our-collections/)\n- ## [Learn](https://www.heinzhistorycenter.org/learn/)\n\n- ### [For Schools & Teachers](https://www.heinzhistorycenter.org/learn/education/)\n\n- #### [Sign Up for Educator eNewsletter](https://lp.constantcontactpages.com/su/1E0nfIL)\n\n- #### [National History Day](https://www.heinzhistorycenter.org/learn/education/national-history-day/)\n\n- #### [Homeschool Programs](https://www.heinzhistorycenter.org/learn/education/homeschool-programs/)\n\n- #### [Plan a Field Trip](https://www.heinzhistorycenter.org/learn/education/plan-a-field-trip/)\n- ### [Scout Programs](https://www.heinzhistorycenter.org/learn/scout-programs/)\n\n- #### [History Center Scout Programs](https://www.heinzhistorycenter.org/learn/scout-programs/history-center-scout-programs/)\n\n- #### [Fort Pitt Scout Programs](https://www.heinzhistorycenter.org/learn/scout-programs/fort-pitt-scout-programs/)\n\n- #### [Meadowcroft Scout Programs](https://www.heinzhistorycenter.org/learn/scout-programs/meadowcroft-scout-programs/)\n- ### [America 101](https://www.heinzhistorycenter.org/learn/america-101/)\n\n- #### [The Civic Season](https://www.heinzhistorycenter.org/learn/america-101/the-civic-season/)\n\n- #### [Apps](https://www.heinzhistorycenter.org/learn/america-101/apps/)\n- ### [Virtual Tours](https://www.heinzhistorycenter.org/learn/virtual-tours/)\n\n- ### [Blog](https://www.heinzhistorycenter.org/blog/)\n\n- ### [Videos & Podcasts](https://www.heinzhistorycenter.org/learn/videos-and-podcasts/)\n- ## [About](https://www.heinzhistorycenter.org/about/)\n\n- ### [Our People](https://www.heinzhistorycenter.org/about/people/)\n\n- ### [Press Releases, Awards & Honors](https://www.heinzhistorycenter.org/about/press-awards-honors/)\n\n- ### [History Center Affiliates Program](https://www.heinzhistorycenter.org/about/history-center-affiliates-program/)\n\n- #### [Civic Empathy Project](https://www.heinzhistorycenter.org/about/history-center-affiliates-program/civic-empathy-project/)\n- ### [Event Rentals](https://www.heinzhistorycenter.org/about/event-rentals/)\n\n- #### [Host an Event](https://www.heinzhistorycenter.org/about/event-rentals/host-an-event/)\n\n- #### [Weddings](https://www.heinzhistorycenter.org/about/event-rentals/weddings/)\n\n- #### [Special Events](https://www.heinzhistorycenter.org/about/event-rentals/special-events/)\n\n- #### [Our Spaces](https://www.heinzhistorycenter.org/about/event-rentals/our-spaces/)\n\n- #### [Our Team](https://www.heinzhistorycenter.org/about/event-rentals/our-team/)\n\n- #### [Testimonials](https://www.heinzhistorycenter.org/about/event-rentals/testimonials/)\n\n- #### [Frequently Asked Questions](https://www.heinzhistorycenter.org/about/event-rentals/frequently-asked-questions/)\n- ### [Contact Us](https://www.heinzhistorycenter.org/about/contact-us/)\n\n- ### [Work With Us](https://www.heinzhistorycenter.org/about/work-with-us/)\n\n- ### [Blog](https://www.heinzhistorycenter.org/blog/)\n- ## [Heinz History Center](https://www.heinzhistorycenter.org/whats-on/history-center/)\n\n- ## [Sports Museum](https://www.heinzhistorycenter.org/whats-on/sports-museum/)\n\n- ## [Fort Pitt Museum](https://www.heinzhistorycenter.org/whats-on/fort-pitt/)\n\n- ## [Meadowcroft Rockshelter](https://www.heinzhistorycenter.org/whats-on/meadowcroft/)\n\n- ## [Join](https://www.heinzhistorycenter.org/join/)\n\n- ## [Donate](https://www.heinzhistorycenter.org/give/make-a-donation/)\n\n- ## [Kids & Families](https://www.heinzhistorycenter.org/families/)\n\n- ## [Groups](https://www.heinzhistorycenter.org/groups/)\n\n- ## [Educators](https://www.heinzhistorycenter.org/learn/education/)\n\n- ## [Members](https://www.heinzhistorycenter.org/members/)\n\n- ## [Donate](https://www.heinzhistorycenter.org/give/make-a-donation/)\n\n- ## [Host an Event](https://www.heinzhistorycenter.org/about/event-rentals/)\n\n- ## [Shop](https://shop.heinzhistorycenter.org/)\n\n- ## [Home](https://www.heinzhistorycenter.org/)\n\n- ## [About](https://www.heinzhistorycenter.org/about/)\n\n- ## [Contact Us](https://www.heinzhistorycenter.org/about/contact-us/)\n\n- ## [Accessibility](https://www.heinzhistorycenter.org/visit/accessibility/)\n\n- ## [Health & Safety](https://www.heinzhistorycenter.org/visit/health-safety/)\n\n- ## [Work With Us](https://www.heinzhistorycenter.org/about/work-with-us/)\n\n- ## [Sitemap](https://www.heinzhistorycenter.org/sitemap/)\n\n- ## [Policies](https://www.heinzhistorycenter.org/policies/)", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.249266", "metadata": {"original_content_length": 12535, "cleaned_content_length": 12187, "word_count": 569, "char_count": 12187, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/", "title": "Meadowcroft Exhibits - Heinz History Center", "content": "# Meadowcroft Exhibits\n\n## Meadowcroft Rockshelter\n\nExhibit\n\nMeadowcroft Rockshelter and Historic Village\n\nDig into archaeological evidence that reveals the earliest signs of human habitation dating back 19,000 years.\n\n[Explore the Exhibit](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/rockshelter/)\n\n## Robert Barensfeld Center\n\nMeadowcroft Rockshelter and Historic Village\n\nBegin your prehistoric journey at the Robert Barensfeld Center, a welcoming new facility at Meadowcroft Rockshelter and Historic Village.\n\n[Learn More](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/robert-barensfeld-center/)\n\n- ![A blacksmith stands at a workbench demonstrating metalworking in a dimly lit workshop. Several children stand in the foreground watching attentively. Various tools, equipment, and a forge are visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Meadowcroft-Blacksmith-300x200.jpg)\n\n## [Meadowcroft Historic Village](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/historic-village/)\n\nExperience everyday 19th century rural life in Meadowcroft’s carefully recreated Historic Village.\n\n- ![A group of children sit on wooden benches under a shelter constructed from branches and leaves, listening to an adult who is speaking. The scene takes place outdoors in a wooded area with sunlight shining through the trees.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/DSC6858-300x200.jpg)\n\n## [Prehistoric Indian Village](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/indian-village/)\n\nGo back 400 years and explore a recreated 16th century Monongahela Indian Village.\n\n- ![A woman in 18th-century historical clothing prepares food outdoors next to a rustic log cabin at Meadowcroft. Several cooking pots hang over an open fire ring, surrounded by trees and a grassy clearing beneath a partly cloudy sky.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC05865-300x200.jpg)\n\n## [Frontier Trading Post](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/frontier-trading-post/)\n\nTwo 1770s era structures help to spotlight the similarities and differences between European settlers and Eastern Woodland Indians.\n\n- ![Display of historic horse-drawn carriages and wagons inside a museum, featuring a red Concord Coach with “U.S. Mail” lettering, surrounded by informational signs and illuminated by dim lighting.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Trails-to-Trains-exhibit-300x200.jpg)\n\n## [Trails to Trains](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/trails-to-trains/)\n\nThe _**Trails to Trains**_ exhibit transports visitors through time, exploring the evolution of transportation in Southwestern Pennsylvania using five vehicles from the collection.\n\n- ![A blacksmith stands at a workbench demonstrating metalworking in a dimly lit workshop. Several children stand in the foreground watching attentively. Various tools, equipment, and a forge are visible in the background.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Meadowcroft-Blacksmith-300x200.jpg)\n\n## [Meadowcroft Historic Village](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/historic-village/)\n\nExperience everyday 19th century rural life in Meadowcroft’s carefully recreated Historic Village.\n\n- ![A group of children sit on wooden benches under a shelter constructed from branches and leaves, listening to an adult who is speaking. The scene takes place outdoors in a wooded area with sunlight shining through the trees.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/DSC6858-300x200.jpg)\n\n## [Prehistoric Indian Village](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/indian-village/)\n\nGo back 400 years and explore a recreated 16th century Monongahela Indian Village.\n\n- ![A woman in 18th-century historical clothing prepares food outdoors next to a rustic log cabin at Meadowcroft. Several cooking pots hang over an open fire ring, surrounded by trees and a grassy clearing beneath a partly cloudy sky.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/08/DSC05865-300x200.jpg)\n\n## [Frontier Trading Post](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/frontier-trading-post/)\n\nTwo 1770s era structures help to spotlight the similarities and differences between European settlers and Eastern Woodland Indians.\n\n- ![Display of historic horse-drawn carriages and wagons inside a museum, featuring a red Concord Coach with “U.S. Mail” lettering, surrounded by informational signs and illuminated by dim lighting.](https://www.heinzhistorycenter.org/wp-content/uploads/2022/09/Trails-to-Trains-exhibit-300x200.jpg)\n\n## [Trails to Trains](https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/trails-to-trains/)\n\nThe _**Trails to Trains**_ exhibit transports visitors through time, exploring the evolution of transportation in Southwestern Pennsylvania using five vehicles from the collection.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.249266", "metadata": {"original_content_length": 5968, "cleaned_content_length": 5069, "word_count": 505, "char_count": 5069, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/robert-barensfeld-center/", "title": "Robert Barensfeld Center - Heinz History Center", "content": "# Robert Barensfeld Center\n\nBegin your prehistoric journey at the Robert Barensfeld Center, a welcoming new facility at Meadowcroft Rockshelter and Historic Village.\n\nThe Barensfeld Center offers an exciting launch point to explore one of the most significant archaeological sites in North America.\n\nEnjoy a wide range of amenities, including:\n\n- An orientation room that sets the stage for exploring Meadowcroft’s 275-acre site\n- A gift shop filled with exclusive merchandise, educational items, and local souvenirs\n- A shaded picnic pavilion with a wood-burning fireplace that makes the perfect place for lunch\n- A library for research and reference\n- Meeting and event spaces that support school field trips, public programs, workshops, and private rentals\n\nThe Barensfeld Center also houses the new _**Meadowcroft: The Site that Rocked the World**_ exhibition, which brings the incredible story of Meadowcroft’s discovery to life.\n\nAmong the artifacts displayed in the new exhibition, the Miller Point takes center stage. On view for the first time in Meadowcroft’s history, this prehistoric stone tool played a pivotal role in reshaping our understanding of early human life in North America.\n\nDiscovered on July 31, 1976, by archaeologist Joe Yedlowski during a University of Pittsburgh excavation led by Dr. James M. Adovasio, the Miller Point provided critical evidence that Meadowcroft is the earliest known site of human habitation in North America, used as a campsite by prehistoric hunters and gatherers nearly 19,000 years ago.\n\nThe Robert Barensfeld Center is made possible with support from the **Barensfeld Family, Cindrich Family, Torrence M. Hunt Jr., E. Alex Paris III,** and **Richard L. & Margaret White.** Financial support provided by **Commonwealth of Pennsylvania, Honorable Josh Shapiro, Governor; Pennsylvania Department of Community and Economic Development (DCED); Washington County Local Share Account (LSA) Program;** and with funds from gaming revenues under the **Pennsylvania Racehorse Development and Gaming Act** and **Washington County Tourism Promotion Agency**.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.249266", "metadata": {"original_content_length": 2208, "cleaned_content_length": 2100, "word_count": 310, "char_count": 2100, "description": "Begin your prehistoric journey at the Robert Barensfeld Center, a welcoming new facility at Meadowcroft Rockshelter and Historic Village."}}
{"url": "https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/historic-village/", "title": "Meadowcroft Historic Village - Heinz History Center", "content": "# Meadowcroft Historic Village\n\nHeavily altered by a coal mining operation, the landscape of Albert and Delvin Miller’s Avella farm drastically changed during the 1940s and 50s. The Millers were determined to reclaim the land and restore it to a new place where youth groups could camp and learn about history and the natural environment.\n\nThe Miller family began collecting examples of 19th century rural architecture, such as the Pine Bank Covered Bridge from neighboring Greene County, a barn slated for demolition on state game lands, and a log house constructed by their great-great-grandfather in 1800.\n\nBy 1969, the Meadowcroft Historic Village and its collection of 19th century artifacts and structures was ready to open to the public.\n\nToday, visitors are amazed as they tour through the recreated Upper Ohio Valley Village, interact with various re-enactors, and enjoy living history demonstrations designed to show how Western Pennsylvanians once lived.\n\nGet educated with a lesson in a one-room schoolhouse, experience a reassembled 1870s log church, watch a blacksmith forge red-hot iron, and step back in time at Meadowcroft’s Historic Village.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.255302", "metadata": {"original_content_length": 1481, "cleaned_content_length": 1159, "word_count": 179, "char_count": 1159, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/frontier-trading-post/", "title": "Frontier Trading Post - Heinz History Center", "content": "# Frontier Trading Post\n\nThe first European settlers arrived in Western Pennsylvania during the 18th century. The Old World and new collided on the frontier, as Europeans and Africans encountered the native Lenapes, Shawnees, and Iroquoian-speaking Mingoes.\n\nThe often violent frontier became a cultural mixing ground. American Indians traded furs and deerskins for a wide variety of European goods. Backcountry settlers in turn adopted native food crops, articles of clothing, and forest survival skills. Despite their many cultural differences, Indians and Europeans shared a common, vital need for the land and its natural resources.\n\nAt the 1770s frontier trading post, visitors will visit a trading shelter typical of the first few years of European settlement in Western Pennsylvania and learn about the many challenges both Native people and European settlers faced as these cultures came together.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.256080", "metadata": {"original_content_length": 1225, "cleaned_content_length": 905, "word_count": 136, "char_count": 905, "description": ""}}
{"url": "https://www.heinzhistorycenter.org/whats-on/meadowcroft/exhibits/indian-village/", "title": "Prehistoric Indian Village - Heinz History Center", "content": "# Prehistoric Indian Village\n\nMeadowcroft’s recreated Monongahela Indian Village gives visitors a close look at the everyday lives of 16th century American Indians.\n\nExplore the interior of a wigwam, inspect carefully recreated prehistoric artifacts, and learn about American Indian agriculture. Enjoy the traditional Three Sisters Garden and a hunting camp filled with furs, hunting tools, and fishing equipment.\n\nOne of the most popular activities at Meadowcroft’s Indian Village, visitors can try their hand at using an atlatl, a prehistoric spear thrower used by American Indians for hunting fish, waterfowl, and mammals. Prehistoric hunters used a spear-thrower called the atlatl, a precursor to the bow and arrow, to hunt for food. The atlatl would have been carved from wood, antler, or bone and used to increase a spear’s force and velocity during the hunt for deer, elk, and other large animals.", "source_category": "music_culture", "source_root_url": "https://www.heinzhistorycenter.org/", "format": "HTML", "is_pdf": false, "scraped_at": "2025-10-05T03:24:42.256080", "metadata": {"original_content_length": 1216, "cleaned_content_length": 904, "word_count": 140, "char_count": 904, "description": ""}}
